{
  "wiki.ic2.category.addons": "IC2Classic Аддони",
  "wiki.ic2.category.armors": "Обладунки",
  "wiki.ic2.category.batteries": "Акумулятори",
  "wiki.ic2.category.block_misc": "Різні блоки",
  "wiki.ic2.category.blocks": "Блоки",
  "wiki.ic2.category.brewing": "Броварення",
  "wiki.ic2.category.cables": "Кабелі",
  "wiki.ic2.category.cfoam": "Будівельна Піна",
  "wiki.ic2.category.credits": "Розробники",
  "wiki.ic2.page.credits.head": "Розробники",
  "wiki.ic2.category.crops": "Культури",
  "wiki.ic2.category.early_game": "Початкова гра",
  "wiki.ic2.category.electric_blocks": "Електричні Блоки",
  "wiki.ic2.category.electric_tools": "Електроприлади",
  "wiki.ic2.category.electricity": "Електрика",
  "wiki.ic2.category.essentials": "Основне",
  "wiki.ic2.category.explosives": "Вибухівка",
  "wiki.ic2.category.first_day": "Що у перший День?",
  "wiki.ic2.category.fluid_blocks": "Рідинні Блоки",
  "wiki.ic2.category.fluids": "Рідини",
  "wiki.ic2.category.fourth_tier": "Четвертий Рівень",
  "wiki.ic2.category.second_tier": "Другий Рівень",
  "wiki.ic2.category.third_tier": "Третій Рівень",
  "wiki.ic2.category.general": "Загальне",
  "wiki.ic2.category.generators": "Генератори",
  "wiki.ic2.category.gui": "Інтерфейс",
  "wiki.ic2.category.item_energy": "Портативна енергія",
  "wiki.ic2.category.item_misc": "Різні Речі",
  "wiki.ic2.category.items": "Речі",
  "wiki.ic2.category.logistic": "Транспортна логістика",
  "wiki.ic2.category.machines": "Машини",
  "wiki.ic2.category.misc": "Різне",
  "wiki.ic2.category.misc_tutorials": "Різне",
  "wiki.ic2.category.monitor_cards": "Картки Моніторингу",
  "wiki.ic2.category.personal_blocks": "Персональні Блоки",
  "wiki.ic2.category.progression": "Прогресія",
  "wiki.ic2.category.reactor": "Компоненти Реактора",
  "wiki.ic2.category.reactors": "Реактори",
  "wiki.ic2.category.scanners": "Сканери",
  "wiki.ic2.category.tools": "Інструменти",
  "wiki.ic2.category.tubes": "Труби",
  "wiki.ic2.category.tutorials": "Підручники\n§l§4Інструкції для початківців!§r",
  "wiki.ic2.category.upgrades": "Покращення",
  "wiki.ic2.category.villager": "Селяни",
  "wiki.ic2.category.wrenches": "Гайковерти",
  "wiki.ic2.page.blocks.cables": "Кабелі",
  "wiki.ic2.page.blocks.cables.desc": "Кабелі - єдиний спосіб транспортування електроенергії на будь-які відстані.\n\nВони мають різні обмеження щодо того, скільки енергії вони можуть переносити та які втрати можуть мати.\nОбов'язково ізолюйте їх, інакше вони можуть вас вбити...§<newPage>§<header;Рекомендація;true>\nПереконайтеся, що ви переглянули §<redirect;true;Посібник з електроенергії;ic2:subpage.electricity>\nщоб розуміти, як працює!",

  "wiki.ic2.page.blocks.cfoam": "Будівельна піна",
  "wiki.ic2.page.blocks.cfoam.desc": "Будівельна піна - вхідний матеріал у світ будівництва.\n\nРекомендується бути обережним тут!\nБудьте обережні, бо не всі повертаються...§<newPage>§<header;Що таке?;true>\nВін може бути використаний для:\n- §lДекорування§r \n- Копіювання §lТекстури§r за допомогою §<redirect;true;Обскуратора;ic2:preview.obscurator> \n- §lПриховування§r блоків, таких як Труби/Кабелі/Трубки\n- §lСтворення§r §<redirect;true;Армованого каменя;ic2:preview.reinforced_stone>§<newPage>§<header;Як цим користуватися?;true>\nЗа замовчуванням ви виготовляєте §<redirect;true;Волога будівельна піна;ic2:preview.wet_cfoam> і кладете його. \nВін висохне самостійно, якщо достатньо світло, або може бути висушений за допомогою піску/бетонного порошку, якщо ви не хочете чекати.\nВикористання бетону автоматично дозволяє розфарбувати його. Хоча також можна зробити після факту за допомогою §<redirect;true;Валику;ic2:preview.painter>§<newPage>§<header;Піна у стисненому вигляді;true>\nЯкщо ви стискаєте його у Пеллет, ви отримуєте 13х піни, і потім її можна помістити у §<redirect;true;Розбризкувачі;ic2:preview.foam_sprayer>.\nБазовий варіант розпилює у напрямку погляду. \nМожна використовувати §<redirect;true;Електричний розбризкувач;ic2:preview.electric_sprayer>, щоб контролювати кількість розпиленого.\nХоча для цього потрібна Машина для Консервування для його заповнення. §<newPage>§<header;Затемнення;true>\nЯк тільки піна висохне, його можна Затемнити за допомогою §<redirect;true;Обскуратор;ic2:preview.obscurator>.\nСам Обскуратор може копіювати текстури, що означає, що ви можете використовувати його, щоб накладати майже будь-яку текстуру на піна, як ви бажаєте.\n\nХочете будинок з Блоків Діаманта, але не хочете марнувати діаманти?\nПоставте блок, затемніть його і розкладіть навколо безліч піни!\nХочете пожартувати з друзями, що RF працює з IC2?\nСкопіюйте Блоки RF Mods і вставте їх на Кабель IC2, а поруч поставте кабель!\nВони, повірте, злякуються. (Перевірено кілька разів)§<newPage>§<header;Примітки;true>\nЗверніть увагу, що Затемнення працює лише з наступними типами піни:\n- Повні блоки\n- Підлоги\n- Сходи\n- Стіни\n\nЧому? Тому що процес їх зроблення сумісними є дуже складним.\nОсобливо з їхнім функціоналом в них.",

  "wiki.ic2.page.blocks.electric_blocks": "Електричні Блоки", 
  "wiki.ic2.page.blocks.electric_blocks.desc": "Електричні блоки - ваші інструменти для забезпечення стабільності та складності вашої електричної мережі.\n\nЕлектричні сховища, трансформатори, зарядні пристрої, станції, ліхтарі - все, що ви можете побажати.\n\nЗвичайно вони поділені на рівні.",
  
  "wiki.ic2.page.blocks.explosives": "Вибухівка",
  "wiki.ic2.page.blocks.explosives.desc": "Вибухівка є частиною індустріалізації.\n\nТому IC2Cдодає кілька блоків, що стосуються цього.\nКрім того, IC2C зменшує опір кількох блоків вибуху, щоб зробити руйнування менш контрольованим.\nЦе не змінює ванільний грунт ні в якій формі, оскільки опір було зменшено лише для того, щоб зробити більш потужні вибухи насправді потужнішими.\n\nНаприклад: 6 блоків обсидіану було достатньо міцними, щоб утримати 1 ядерний вибух без будь-яких пошкоджень.\nТепер вам потрібно набагато більше.\nОбсидіан був зменшений з міцності 1200 до 60. (Ванільна версія робить 4)",
  
  "wiki.ic2.page.blocks.fluid_blocks": "Блоки Рідини",
  "wiki.ic2.page.blocks.fluid_blocks.desc": "У IC2C є багато блоків, які використовують або працюють з рідинами.\n\nодже виходить так що транспортування рідин - обов'язкова частина гри.\nПредставляємо вам систему труб для рідин.\n\nБільшість устаткування для активного видобутку рідин автоматично сумісна з цією системою.§<newPage>§<header;Труби;true>\nДля всього іншого у труб є графічний інтерфейс, де їх можна налаштовувати для самостійного видобутку рідини.\nТруби також мають «Систему пріоритетів», яка базується на принципі: менше число => вищий пріоритет.\nЗазначений графічний інтерфейс можна отримати, якщо є резервуар, і в руці немає жодного предмета.§<newPage>§<header;Фізика;true>\nТруби мають опір при покиданні рідин через них.\nЗалежно від сили джерела, ви можете йти лише до певної міри.\nРух по горизонталі споживає 1 силу, рух вниз нічого не потребує, а рух вгору споживає 2 сили.\nТакож мережа намагається розподілити рідину рівномірно, і тільки якщо є залишок рідини, вона буде робити речі з меншим пріоритетом.",

  "wiki.ic2.page.blocks.generator": "Генератори",
  "wiki.ic2.page.blocks.generator.category": "Наступні рівні генераторів, доступні вам в залежності від вашого прогресу\n\n- §<redirect;true;Генератори низької напруги (НН);ic2:blocks.generators.lv> \n- §<redirect;true;Генератори середньої напруги (СН);ic2:blocks.generators.mv> \n- §<redirect;true;Генератори високої напруги (ВН);ic2:blocks.generators.hv> \n- §<redirect;true;Компактні генератори;ic2:blocks.generators.compact> ",

  "wiki.ic2.page.blocks.generator.compact": "Компактні Генератори",
  "wiki.ic2.page.blocks.generator.compact.desc": "Компактні генератори - дивний концепт, створений за конкретною потребою\nу зменшенні затримок у світі, оскільки вони дійсно не оптимізовані.\n\nВ наши дні вже не є необхідним, оскільки ці генератори гіпероптимізовані,\nале вони все ще існують для збереження місця і просто для приколу.\n\nЩоб зробити менш ефективним, вам доводиться витрачати додаткові ресурси для досягнення звільнення пространства.",

  "wiki.ic2.page.blocks.generator.desc": "Вам потрібна енергія?\nУ нас буде енергія!\n\nНижче наведено рішення з генерації електроенергії в IC2C для всіх ваших потреб, від Низької напруги (НН) до Високої напруги (ВН).\nФормат енергії - 'EU/t', або Electrical Units/t. Якщо ви ще не переглядали навчальні матеріали, то вам варто зробити.\nБільше про EU пояснюється саме там.",
  "wiki.ic2.page.blocks.generator.hv": "Генератори Високої Напруги (ВН)",
  "wiki.ic2.page.blocks.generator.hv.desc": "ВН Генератори - ваши кінцеві виробники електроенергії.\n\nЦе вдосконалені форми існуючих джерел енергії, які роблять їх значно кращими,\n\nщоб компенсувати підвищені вимоги до електроенергії, які на вас надходитимуть на цьому етапі.\nКрім того, ці генератори не легко автоматизувати.\n\n\nВони або небезпечні, або мають спеціальні вимоги, такі як постійні втрати.",
  "wiki.ic2.page.blocks.generator.lv": "Генератори Низької Напруги (НН)",
  "wiki.ic2.page.blocks.generator.lv.desc": "НН Генератори - ваш доступ до електроенергії на ранньому етапі гри.\n\nЦі рішення є невеликими пасивними виробниками електроенергії, або споживачами ресурсів для виробництва електроенергії.\n\n\nЦе повинно допомогти вам на ранніх етапах гри, поки ви не перейдете до виробництва енергії на пізніших етапах гри.",
  "wiki.ic2.page.blocks.generator.mv": "Генератори Середньої Напруги (СН)",
  "wiki.ic2.page.blocks.generator.mv.desc": "СН Генератори - крок до надійного виробництва електроенергії.\n\nЦі генератори ефективніше використовують паливо та/або вимагають використання більш дорогого палива.\n\n\nВони повинні значно збільшити виробництво електроенергії.",

  "wiki.ic2.page.blocks.machines": "Машини",
  "wiki.ic2.page.blocks.machines.category": "Наступні рівні машин доступні вам в залежності від того, як ви прогресуєте в грі.\n\n- §<redirect;true;ПН Машини;ic2:blocks.machines.nv> \n- §<redirect;true;НН Машини;ic2:blocks.machines.lv> \n- §<redirect;true;СН Машини;ic2:blocks.machines.mv> \n- §<redirect;true;ВН Машини;ic2:blocks.machines.hv> \n- §<redirect;true;ЕН Машини;ic2:blocks.machines.ev> \n- §<redirect;true;АН Машини;ic2:blocks.machines.luv> \n- §<redirect;true;Промисловий верстак;ic2:blocks.machines.worktable> ",
  "wiki.ic2.page.blocks.machines.desc": "IC2C - мод, який додає механізмами.\nМайже усі блоки - механізми, розділені на шість рівнів за споживаною енергією EU/t.\nМашини ПН не потребують енергії, а лише палива.",

  "wiki.ic2.page.blocks.machines.ev": "Машини Екстремальної Напруги (ЕН)",
  "wiki.ic2.page.blocks.machines.ev.desc": "Машини екстремальної напруги - ваш шлях до кінцевої гри. Вони надають вам доступ до останнього рівня інструментів та машин, які вимагають великої потужності.\n\nДеякі можуть стверджувати, що не варто зусиль. АЛЕ всі знають, що груба сила - краща сила!\n\nЦей рівень приймає до екстремальної напруги (2048EU) і забезпечує останній набір універсальних машин.\nЦе Колосальні Машини.\n\nКолосальні Машини - динамічні багатоблочні структури, які обробляють кілька предметів одночасно, але вимагають більше простору та енергії\nпроте ефективніше за своїх аналогів.",
  "wiki.ic2.page.blocks.machines.hv": "Машини Високої Напруги (ВН)",
  "wiki.ic2.page.blocks.machines.hv.desc": "Машини високої напруги - ваш крок до фінального етапу гри.\n\nМашини стають більш вдосконаленими і більше вимагають енергії.\n\nЯкщо на цей момент ваша енергетична інфраструктура вже ледь вистачає, щоб встигнути з споживанням,\nто зараз саме час розширити її. Більшість машин на цьому етапі приймають Високу Напругу (512EU) та мають менше ймовірності випадіння при звичайному гаечному ключі.\n\nХоча невелика ціна за доступ до вдосконалених інструментів.",
  "wiki.ic2.page.blocks.machines.luv": "Машини Абсурдної Напруги (АН)",
  "wiki.ic2.page.blocks.machines.luv.desc": "Машини абсурдної напруги - завершення гри.\n\nНемає більше, що можна розблокувати після цього рівня прогресу!\nЦі машини працюють при абсурдній напрузі (32765 EU).\n\nЙмовірність випадіння за допомогою гаечного ключа становить 55%. Цього не достатньо для випадіння АН,тому рекомендується зробити абсолютно невтратний прецезійний гайковерт",
  "wiki.ic2.page.blocks.machines.lv": "Машини Низької Напруги (НН)",
  "wiki.ic2.page.blocks.machines.lv.desc": "Машини низької напруги - початковий етап електричної обробки ресурсів.\n\nЦі машини приймають до 32 EU.\nЯкщо машину видаляють без гайкового ключа, вона втрачається назавжди.\n\nЗа замовчуванням ймовірність не втратити машину із гайковим ключем становить 80%.\nЦе може змінюватися в залежності від самого гайкового ключа.\n\nПрактично кожна машина НН приймає модифікації.",
  "wiki.ic2.page.blocks.machines.mv": "Машини Середньої Напруги (СН)",
  "wiki.ic2.page.blocks.machines.mv.desc": "Машини середньої напруги - початок середньої гри в IC2C.\n\nВони надають вам багато нових корисних інструментів та машин, з якими ви тепер можете грати.\n\nБагато цих машин працюють при середній напрузі (128EU) і, загалом, працюють швидше, ніж їхні аналоги НН.\nЦе коштує менше можливостей модифікацій і, звісно ж, трошки більше витрат ресурсів/енергії,\nабо потребує активного живлення машин в режимі очікування.\n\nРежим очікування - пасивна витрата, яка споживає 1EU/t і потребує сигналу червоного каменю для підтримання повної швидкості.",

  "wiki.ic2.page.blocks.machines.nv": "Примитивні Машини (ПН)",
  "wiki.ic2.page.blocks.machines.nv.desc": "Примітивні машини, які не використовують електрику, є дуже ранніми машинами, до яких ви маєте доступ у грі.\n\nВони використовують спалювальні палива, такі як дерево та вугілля, для своєї роботи.\n\nХоча вони надто неефективні за витратами палива, вони надають багато бонусів і можуть легко використовуватися на льоту.",

  "wiki.ic2.page.blocks.machines.worktable": "Промисловий верстат",
  "wiki.ic2.page.blocks.machines.worktable.desc": "Промисловий верстат - неймовірно потужний інструмент для виготовлення.\n\nФактично, він настільки потужний, що потребує власного розділу.\n\nЦей розділ охоплює сам промисловий верстат та всі розширення.§<newPage>Зверніть увагу, що всі розширення вимагають промислового верстату для роботи.\nІ якщо вони прямо або непрямо торкнуться його, їх буде виявлено.\n\nТакож розширення можна використовувати на кількох верстатах.",

  "wiki.ic2.page.blocks.misc": "Різні Блоки",
  "wiki.ic2.page.blocks.misc.desc": "Це блоки, які не підходять під жодну конкретну категорію або є Декорацією.",

  "wiki.ic2.page.blocks.personal_blocks": "Персональні Блоки!",
  "wiki.ic2.page.blocks.personal_blocks.desc": "Іноді ви хочете зберегти предмети від того, щоб інші люди їх чіпали;\n\nОсобисті блоки є особистими!\nТільки ви вирішуєте, хто може мати до них доступ.\n\nТакож є особисті Торгові Блоки.\nВони дозволяють за бажанням користувачам торгувати предметами/рідинами/блоками.§<newPage>§<header;Додаткове про Трейд-О-Мат;true>\nНевелика додаткова інформація.\nЯкщо ви натискатимете клавішу §<key;key.ic2.inv> при відкритті Торгових блоків, ви можете переглядати вид покупця та випробовувати різні можливості.",

  "wiki.ic2.page.blocks.tubes": "Труби",
  "wiki.ic2.page.blocks.tubes.desc": "Труби - один із способів автоматизації транспортування предметів.\n\nЦі труби є дуже простими і не можуть виконати багато функцій.\nАле всі базові компоненти для створення складної системи присутні.\n\nОтже, як вони працюють? Предмети просто протікають через них і рухаються випадковими напрямками, але не в тому напрямку, з якого прийшли.\nЯкщо у трубі занадто багато предметів, труба просто не оброблятиме їх, щоб уникнути зависання гри.\n\nЄ Логістичні труби, які допомагають вам автоматизувати складніші проблеми, але ВОНИ НЕ автоматизують маршрутизацію.\n\nТак, автоматичної маршрутизації немає, але не бійтеся, система труб має все необхідне для власної автоматизації маршрутизації.\nТільки переконайтеся, що не перегрієте свій мозок.\n\nЯ не жартував.\n\nТакож для додаткової функціональності був доданий Конфігуратор труб, щоб надати більше контролю над речами.",

  "wiki.ic2.page.crops": "Культури",
  "wiki.ic2.page.crops.boni": "Ефекти навколишнього середовища на культури",
  "wiki.ic2.page.crops.breeding": "Селекція культур",
  "wiki.ic2.page.crops.boni.desc": "Тепер ви знаєте статистику і те, що вона робить, але як щодо бафів навколишнього середовища?\n\nВони наступні: Поживні речовини, Вологість, Якість навколишнього середовища.\n\nНа поживні речовини та вологість можуть впливати блоки під ним.\nБлок безпосередньо під ним - \"Сільськогосподарські угіддя\",\nа 3 блоки після них - \"Підґрунтя\".\nЗагалом, підґрунтя має менший вплив на блок, ніж сільськогосподарські угіддя. §<Поживні речовини:\r\nДеякі біоми можуть мати вплив на цей показник, який можна з'ясувати, застосувавши трохи здорового глузду.\nЦей показник можна вирівняти за допомогою добрив.\nЦей показник можна вирівняти за допомогою клітин зволоження.\nДля перезволожених культур цей показник автоматично збільшується до максимуму. І в більшості випадків не є важливим фактором.§<newPage>§lЯкість середовища перезволожена:§r\n\nКоли культура перезволожена, біом дає базове значення якості води на основі її ознак. \nЗа кожен стовпчик бульбашок або глини у сітці 3х3 ви отримуєте 1 очко.\nЗа кожну очищувальну культуру (морські водорості/водорості) у сітці 3х3 ви також отримуєте 1 очко.\nЗа кожен блок, який не є водою/мокрою губкою або повітрям, ви втрачаєте 1 очко. \nЦе варіюється від 0 до 10 очок якості навколишнього середовища.§<newPage>§lЯкість навколишнього середовища не заболокована:§r\n\nЗа кожні 15 блоків вище y-64 ви отримуєте 1 очко (обмеження на 5)\nЯкщо культура може бачити небо, ви отримуєте 2 очки.\nА за кожен повітряний/нетвердий блок, який не є культурою в сітці 3х3, ви отримуєте пів-очка.\nЦе варіюється від 0 до 10 очок якості навколишнього середовища.",

  "wiki.ic2.page.crops.breeding.desc": "Тепер, як працює селекція?\n\n Селекція - це важливий процес для створення нових і поліпшених культур. Для перехрещування вам потрібен порожній блок культури, оточений набором культур (до 4 штук). Покладіть ще один блок культури на порожній блок. Культура підключиться до всіх безпосередньо прилеглих культур і спробує перехрестити їх. \n\nПід час кожного тику, культура, що схрещується, запитує бажання схрещуватися з іншими культурами, і культури дещо випадковим чином або погоджуються, або не погоджуються на селекцію. Цей процесс можна прискорити або призупільнити за допомогою статистики культур.\nЗа кожен такт зростання перехрещувана культура запитує інші культури про бажання перехреститися, і вони випадково можуть погодитися або відмовити. \n\nЯкщо 2 або більше культур погоджуються перехреститися, в новому місці з’явиться нова культура. Ви не бачите, які саме культури беруть участь, у вас є лише 2 палички.\n\nРезультат обчислюється на основі напіввипадкового шансу. Враховуються статистика, атрибути та рівні культур. \n\nСпочатку оцінюються всі потенційні культури, які можуть рости на цій ділянці (за винятком бур'янів), і обчислюється значення балів для кожної культури.\n\nЦе обчислюється у кілька кроків.\n\nЯкщо культура з розсадника збігається з культурою зі списку, то вона отримує 500 балів. Більше ніяких обчислень.\n\nІнакше програма почне порівнювати культури.\n\nПерше, що вона порівнює - це статистику (Хімія, Витратні матеріали, Захист, Кольоровість, Бур'яни) культур: якщо порівнювані показники однакові, ви отримуєте 2 очки, якщо є різниця в 1 очко, ви отримуєте 1 очко, різниця в 2 очки ігнорується, а будь-яка більша різниця дає -1 очко\nПісля цього вона порівнює атрибути 2 культур. За кожний збіг атрибутів обох культур ви отримуєте 5 балів.\n\nДалі порівнюються яруси культур:\n\nЯкщо ярус селекційної культури менший за 1 бал, ви втрачаєте 2 бали різниці між ярусами.\n\nТакож якщо селекційна культура більша за 3 яруси, то можлива культура втрачає різницю між ярусами в балах.\n\nНасамкінець програма переконується, що ви не отримаєте менше 0 балів за культуру, і додає їх до балів за цю культуру. \nПісля того, як оцінювання завершено, програма об'єднує всі потенційні бали разом і бере випадкове число між 0 і всіма об'єднаними балами культури.\nТоді вона переглядає кожен дійсний результат і перевіряє, чи бали більші за випадково вибране значення.\nЯкщо так, то це ваш результат.\nЯкщо ні, то вона витрачає бали цього конкретного результату і перевіряє наступну культуру. Повторюємо і т.д.",

  "wiki.ic2.page.crops.desc": "IC2C додає дуже унікальну систему рослин до гри. Дехто полюбляє її, а дехто ненавидить.\n\nЯкщо хтось пам'ятає мод Forestry, то вам може бути цікаво дізнатися, що його механіка розведення бджіл була натхненною IC2C.§<newPage>§<header;Рослини;true>\nРослини надають багато різних ресурсів.\nВи можете вирощувати:\n- Дерево\n- Руди\n- Їжу\n- Фарбники\n- КАЛАМАРІВ!\n\nОбов'язково перегляньте §<redirect;true;Посібник;ic2:підсторінка.рослин>§<newPage>§<header;Посадження;true>\nДеякі рослини можна посадити безпосередньо, тоді як інші потребують розведення.\nХоча, якщо ви пожнете рослину, ви отримаєте сумку з насінням для її повторного посадеження. Хоча не завжди гарантовано.\nПовнорослі рослини мають найвищий шанс випадіння мішочек з насінням.\n\nЦей Вікі покаже вам, чи можна посадити рослину за допомогою предмета чи шляхом розведення.§<newPage>",

  "wiki.ic2.page.crops.helper": "Помічник у розведенні рослин",
  "wiki.ic2.page.crops.helper.desc": "Тепер, коли цей великий потік інформації закінчився, сподіваюся, що ваша голова ще не димиться.\n\nТепер ви можете обчислити вручну і сподіватися, що ваші розрахунки точні.\nАле, на щастя, вам не потрібно цього робити.\n\nАналізатор рослин має режим розведення рослин, який може симулювати весь процес і показати вам кожний шанс для кожної комбінації.\nВін не показує вам ідеальні рішення, але дозволяє експериментувати і знаходити найкращі результати для вашої поточної ситуації.\n\nВам не потрібно володіти жодною рослиною, щоб випробувати його. Він має творчий запас усіх рослин.\nНі, ви не можете витягти ці рослини з його інвентаря.\n\nІ охоплює розділ про рослини.",

  "wiki.ic2.page.crops.stats": "Статистика Рослин",
  "wiki.ic2.page.crops.stats.desc": "Отже, у рослин є характеристики, які мають свої переваги та недоліки.\nДіапазон кожної характеристики від 0 до 31.\n\nХоча вищі показники можуть призвести до серйозного підвищення, але є й недоліки, і вони стають величезними при значеннях 24 або вище.§<newPage>§lЗростання:§r\nЗбільшує швидкість росту на певну величину та підвищує шанси на селекція.\nПри значенні 24 або вище рослина перетворюється на бур'ян, що призводить до знищення навколишніх незахищених рослин.§<newPage>§lУрожайність:§r\nЗбільшує шанси на додатковий врожай на 10% (3% автоматично) і іноді може подвоїти врожай з дуже низьким шансом. \nПри значенні 24 кожен додатковий пункт зменшує шанс випадіння насіння на 5% (множення).§<newPage>§lСтійкість:§r\nЗбільшує шанс випадіння насіння та зменшує шанс загибелі рослини через вимоги або спроби поширення бур'яну на неї.\nПри рівні 28 або вище значно зменшує шанс селекція.",

  "wiki.ic2.page.fluids": "Рідини",
  "wiki.ic2.page.fluids.alcohol": "Алкоголь",
  "wiki.ic2.page.fluids.alcohol.desc": "Алкоголь - рідина високого рівня, але неавтоматизована.\n\nВін виробляє велику кількість енергії або може бути використаний для максимізації виводу вашого виробництва з руди в слиток.\n\nВиробляти його можна лише через пивоваріння в бочці.",
  "wiki.ic2.page.fluids.biofuel": "Біопаливо",
  "wiki.ic2.page.fluids.biofuel.desc": "Біопаливо - вдосконалена форма рослинної речовини або деревного газу.\n\nЗа прийнятний проміжок часу воно виробляє велику кількість енергії, яку можна використовувати в середньому та кінцевому етапах гри для підтримання вашої бази в робочому стані.\n\nЯкщо у вас є виробництво, яке може його підтримати.",
  "wiki.ic2.page.fluids.blazing_lava": "Вогняна Лава",
  "wiki.ic2.page.fluids.blazing_lava.desc": "Ця, ще гарячіша, рідина виробляється в рефінерії і є в 10 разів ефективнішою, ніж лава для геотермальних генераторів/термогенераторів. 1 одиниця вогняної лави вважається 10 одиницями звичайної лави і для її отримання потрібно лише трохи розмолотих паличок блейза.",
  "wiki.ic2.page.fluids.desc": "IC2C також надає декілька рідин, які використовуються для кількох цілей.\n\nГоловним чином для виробництва енергії або виробництва деяких корисних речовин.",
  "wiki.ic2.page.fluids.steam": "Пар",
  "wiki.ic2.page.fluids.steam.desc": "Пар можна виробляти багатьма способами, наприклад, у §<redirect;true;Паливному котлі;ic2:preview.fuel_boiler> або §<redirect;true;Паровому реакторі;ic2:preview.steam_reactor>, але в кінці гри він використовується переважно для виробництва енергії середнього та високого рівня у генераторах, таких як §<redirect;true;Паровий тунель;ic2:preview.steam_tunnel> або §<redirect;true;Парова турбіна;ic2:preview.steam_turbine>",
  "wiki.ic2.page.fluids.wood_gas": "Деревний Газ",
  "wiki.ic2.page.fluids.wood_gas.desc": "Деревний газ - біпродукт при виробництві деревного вугілля і може бути вироблений у §<redirect;true;Деревний газифікатор;ic2:preview.wood_gassifier>.\n\nЦе чудовий генератор енергії на початковому етапі гри, але пізніше може бути перероблений в більш потужну рідину.",
  "wiki.ic2.page.items.armors": "Обладунки",
  "wiki.ic2.page.items.armors.desc": "IC2C додає кілька типів броні до гри.\n\nЄ декілька видів броні для початкового етапу гри, електрична броня, утилітарна та інші типи.\n\nУтилітарні обладунки включають можливості заряджати ваші електричні інструменти або реактивні ранці.§<newPage>§<header;Броня;true>\nТакож електрична броня є модульною в цій версії і може бути налаштована за допомогою Конфігуратора броні.",
  "wiki.ic2.page.items.batteries": "Батареї",
  "wiki.ic2.page.items.batteries.desc": "Батареї - ваше портативне джерело енергії, яке ви можете використовувати в багатьох випадках.\n\nЦе може бути як зарядження інших предметів, так і тимчасовий запуск машин.\n\nТакож їх можна використовувати як джерело імпульсної енергії, яке справляється з великим споживанням енергії за короткий проміжок часу,\nз яким ваша енергетична мережа не може справитися.",
  "wiki.ic2.page.items.electric_tools": "Електричні Інструменти",
  "wiki.ic2.page.items.electric_tools.desc": "IC2C надає новий тип інструменту в грі:\n\nелектричний інструмент. Він має свої плюси та мінуси, але загалом велике поліпшення.§<newPage>§<header;Електричні інструменти;true>\n- Використовує електрику як міцність.\n- Вони не можуть ламатися.\n- Їх можна перезаряджати з безлічі джерел.\n- Їх можна чарувати лише за допомогою електричного чарівника.\n- Вони мають стильний колір міцності.\n\nВ цій категорії також є багато корисних інструментів, які вам можуть сподобатися.\nОтже, давайте перейдемо до розділу!",
  "wiki.ic2.page.items.info.cards": "Картки Для Моніторів",
  "wiki.ic2.page.items.info.cards.desc": "IC2C додає монітор до гри.\n\nЦей монітор може відображати багато інформації.\n\nЦі картки надають інформацію для монітора.",
  "wiki.ic2.page.items.misc": "Різноманітні Предмети",
  "wiki.ic2.page.items.misc.desc": "Це предмети, які не вписуються в жодну конкретну категорію.",
  "wiki.ic2.page.items.reactor.components": "Компоненти Реактора",
  "wiki.ic2.page.items.reactor.components.desc": "Компоненти реактора - необхідна частина будь-якого реактора.\n\nЦе, в суті, логіка реактора.\nІснує кілька типів компонентів\n\nтаких як Паливні стержні, Теплообмінники, Кулери, Конденсатори та інші.",
  "wiki.ic2.page.items.scanners": "Сканери",
  "wiki.ic2.page.items.scanners.desc": "Сканери - надзвичайно корисний інструмент для збору ресурсів.\n\nЇх можна використовувати в Видобувачы, щоб вказати, що він повинен видобути для вас.\n\nАле деякі з них можуть бути самостійно використані для відображення кількості руд, які фактично знаходяться під вами.\n\nДля додавання додаткових можливостей їх можна використовувати у комбінації з Буром для показу, чи щось, що ви шукаєте, знаходиться поблизу,\n\nхоча значно скорочений радіус дії.",
  "wiki.ic2.page.items.tools": "Інструменти",
  "wiki.ic2.page.items.tools.desc": "IC2C надає вам безліч інструментів, щоб допомогти вам в вашій меті розширення вашої фабрики.\n\nДеякі з цих інструментів є досить простими копальними інструментами,\n\nінші дають вам доступ до цінної інформації або просто дозволяють вам посилити/прикрасити свою базу.",
  "wiki.ic2.page.items.upgrades": "Покращення",
  "wiki.ic2.page.items.upgrades.category": "Ось категорії оновлень:\n- §<redirect;true;Оновлення машин;ic2:items.upgrades.machine>\n\n- §<redirect;true;Оновлення зарядних плат;ic2:items.upgrades.chargepad>\n\n- §<redirect;true;Оновлення інвентарю;ic2:items.upgrades.inventory>\n\n- §<redirect;true;Комплекти оновлень;ic2:items.upgrades.kits>",
  "wiki.ic2.page.items.upgrades.chargepad": "Оновлення для зарядних плат",
  "wiki.ic2.page.items.upgrades.chargepad.desc": "Зарядні плати круті, і ці оновлення дозволяють зробити їх більш корисними,\n\nособливо для сценаріїв PVP, для яких вони були спочатку створені їх автором.\n\nПроте залишаються кілька основних переваг, навіть для тих, хто не користується PVP.",
  "wiki.ic2.page.items.upgrades.desc": "IC2C додає безліч оновлень для багатьох різних машин.\n\nЦе можуть бути як прямі покращення, так і компроміси щодо того, що ви можете або не можете робити.",
  "wiki.ic2.page.items.upgrades.inventory": "Покращення Інвентаря",
  "wiki.ic2.page.items.upgrades.inventory.desc": "Оновлення інвентарю зазнали змін з останньої версії. Фактично, залишилося лише кілька з них,\n\nале те, що вони дозволяють, - строгий контроль над інвентарем.",
  "wiki.ic2.page.items.upgrades.kits": "Набори Покращення",
  "wiki.ic2.page.items.upgrades.kits.desc": "Набори оновлень - ваш інструмент для покращення частин вашої фабрики без необхідності розбирання всього і потім встановлення оновлених версій назад.\n\nЦе помічники, які вдосконалюють речі на місці.\n\nЗвісно, не завжди простий крок, але він спрощує багато речей.",
  "wiki.ic2.page.items.upgrades.machine": "Оновлення Для Машин",
  "wiki.ic2.page.items.upgrades.machine.desc": "Оновлення для машин - просто покращення лише для певних машин.\n\nЇх існує безліч варіантів, таких як: Транспортування, Зміна виводу, Керування червоним каменем і т. д.\n\nОднак кожна машина сама вирішує, які саме з цих оновлень можна використовувати.",
  "wiki.ic2.page.main.body": "Тепер, коли ми розібралися з цим, давайте перейдемо до деяких керувань.\nЗнизу праворуч/ліворуч є кнопки.\nВони будуть переміщати вас вперед/назад при натисканні.",
  "wiki.ic2.page.main.head": "Посібник з IC2Classic",
  "wiki.ic2.page.main.intro": "Ласкаво просимо до посібника з IC2Classic.\nМожливо, найважливіший предмет у цьому моді\nПереконайтеся, що, якщо ви викидаєте мене, ви повинні переконатися, що я дійсно корисний.\n\nЗагалом настійно рекомендується використовувати The One Probe, або Jade + IC2C Addon з цим модом, вони надають багато корисної інформації про Машини. Також EU-Метр(Необхідний для отримання інформації з Jade) ваш найкращий друг! Ви попереджені!",
  "wiki.ic2.page.main.wiki_head": "Докладніше",
  "wiki.ic2.page.table.desc": "Містить.\n\n- §<redirect;true;Хронопосібник;ic2:tutorials>\n- §<redirect;true;Розробники;ic2:credits>\n- §<redirect;true;Блоки;ic2:blocks.generators>\n  - §<redirect;true;Генератори;ic2:blocks.generators>\n  - §<redirect;true;Машини;ic2:blocks.machines>\n  - §<redirect;true;Кабелі;ic2:blocks.cables>\n  - §<redirect;true;Електричні Блоки;ic2:blocks.electric_blocks>\n  - §<redirect;true;Персональні Блоки;ic2:blocks.personal_blocks>\n  - §<redirect;true;Рідинні Блоки;ic2:blocks.fluid_blocks>\n  - §<redirect;true;Труби;ic2:blocks.tubes>\n  - §<redirect;true;Вибухівка;ic2:blocks.explosives>\n  - §<redirect;true;Різні Блоки;ic2:blocks.misc>\n\n\n- §<redirect;true;Речі;ic2:items.tools>\n  - §<redirect;true;Інструменти;ic2:items.tools>\n  - §<redirect;true;ЕлектричніІнструменти;ic2:items.electric_tools>\n  - §<redirect;true;Обладунки;ic2:items.armors>\n  - §<redirect;true;Батарейки;ic2:items.batteries>\n  - §<redirect;true;Сканери;ic2:items.scanners>\n  - §<redirect;true;Покращення;ic2:items.upgrades>\n  - §<redirect;true;Компоненти Реактору;ic2:items.reactor.components>\n  - §<redirect;true;Карта Моніторингу;ic2:items.info.cards>\n  - §<redirect;true;Різні речі;ic2:items.misc>\n- §<redirect;true;Рідини;ic2:fluids>\n- §<redirect;true;Культури;ic2:crops>",
  "wiki.ic2.page.table.head": "Зміст",
  "wiki.ic2.page.tutorials.desc": "Це розділ посібників у цій книзі.\nВін надає просте керівництво та пояснення того, як працюють певні функції.\n\nЦе повинно допомогти в прогресі, а також з більш складними можливостями.\n\nНа наступній сторінці є посилання на вже існуючі посібники.",
  "wiki.ic2.page.tutorials.head": "Посібник",
  "wiki.ic2.page.tutorials.head.path": "Посилання На Посібники",
  "wiki.ic2.page.tutorials.path": "Послідовність навчань:\n- §<redirect;true;Перший День;ic2:subpage.first_day>\n- §<redirect;true;Ранній Етап Гри;ic2:subpage.early_game>\n- §<redirect;true;Другий Рівень;ic2:subpage.second_tier>\n- §<redirect;true;Третій Рівень;ic2:subpage.third_tier>\n- §<redirect;true;Четвертий Рівень;ic2:subpage.fourth_tier>\n\nРізноманітні навчання:\n- §<redirect;true;Електроенергія;ic2:subpage.electricity>\n- §<redirect;true;Логістичний Транспорт;ic2:subpage.logistic_grid>\n- §<redirect;true;Варіння;ic2:subpage.brewing>\n- §<redirect;true;Реактори;ic2:subpage.nuclear_reactor>",
  "wiki.ic2.preview.accumulator": "Квантовий Накопичувач",
  "wiki.ic2.preview.accumulator.desc": "Накопичувач - сховище високої ємності на рівні енергії з низьким споживанням. Воно зберігає менше, але є більш гнучким.",
  "wiki.ic2.preview.activity_card.desc": "Карта активності вказує, чи працює машина чи ні.",
  "wiki.ic2.preview.adamantum.desc": "Адамантум - ваша культура для виробництва діамантів. Вона росте дуже повільно і вимагає наявності блоку або руди діаманта під нею.",
  "wiki.ic2.preview.adjustable_luminator.desc": "You need a specific light level? The Adjustable Luminator to the Rescue. It can be dimmed to any light level, while keeping all Luminator features!",
  "wiki.ic2.preview.advanced_chainsaw.desc": "The Advanced Chainsaw is your endgame tree-chopping tool. It eats trees alive! So be careful with that one. Not that it eats you too!",
  "wiki.ic2.preview.advanced_drill.desc": "The Advanced Drill is your endgame digger. It allows you to 3x3 mine as much as Speiger wanted to prevent it. Looks like he lost that battle!",
  "wiki.ic2.preview.advanced_hoe.desc": "The Advanced Hoe is the late-game mass-farming tool you want. It can till fields in a 5 block radius making life so much easier!",
  "wiki.ic2.preview.advanced_solar_helmet.desc": "The Advanced Solar Helmet is an upgraded Solar Helmet that produces 5EU/t charging your armor and tools.",
  "wiki.ic2.preview.advanced_tree_tap.desc": "The Advanced TreeTap is a monster. When used on a rubber tree it gets rid of the entire tree for a lot of Sticky Resin! What a monster!",
  "wiki.ic2.preview.air_refill_module.desc": "You are under water and you are running out of air? How about a Air Refill Module. It keeps you always with a fresh supply of Oxygen.",
  "wiki.ic2.preview.allium.desc": "Allium is magenta producing flower. Like all flowers it requires a bright area (12 or more). Not much else to say.",
  "wiki.ic2.preview.alloy_smelter.desc": "The Alloy Smelter is the gate to the next tier of progression. It uses 16EU/t and is used to create alloys or more complex materials.",
  "wiki.ic2.preview.alumen.desc": "Alumen is a Aluminium Producing Crop, it requires a Block/Ore of said or underneath it to fully grow.",
  "wiki.ic2.preview.aluminium_cable_item.desc": "The Aluminium Cable. It can deal with 8,192EU for a constant loss. Really good for endgame reactors.",
  "wiki.ic2.preview.argentum.desc": "Argentum is your Silver Producing Crops that needs a Block/Ore of said material underneath it to finish growing.",
  "wiki.ic2.preview.armor.bronze": "Bronze Armor",
  "wiki.ic2.preview.armor.bronze.desc": "Bronze Armor is slightly better then its iron counterpart in protection. Outside of that its basically a cheap iron variant.",
  "wiki.ic2.preview.armor.composite": "Composite Armor",
  "wiki.ic2.preview.armor.composite.desc": "Thanks to its dual layer armor and alloy plate shielding the Composite Armor is a really strong armor. Better then netherrite.",
  "wiki.ic2.preview.armor.hazmat": "Hazmat Suit",
  "wiki.ic2.preview.armor.hazmat.desc": "The Hazmat suit when fully equipped protects one from lava/fire and when having air cells makes sure you don't drown.",
  "wiki.ic2.preview.armor.jetpack.electric": "Electric Jetpack",
  "wiki.ic2.preview.armor.jetpack.electric.desc": "The Electric Jetpack is the electric variant of a jetpack. This makes it easier to keep fueled. The Compact Jetpack also has a Rocketmode!",
  "wiki.ic2.preview.armor.jetpack.nuclear": "Nuclear Jetpack",
  "wiki.ic2.preview.armor.jetpack.nuclear.desc": "Annoyed by the constant lack of fuel? The Nuclear Jetpack got you covered. Use §msafe§r Uran to keep it fueled.",
  "wiki.ic2.preview.armor.nano": "Nano Armor",
  "wiki.ic2.preview.armor.nano.desc": "The Nano Armor is your first electric armor in the game. It uses electricity to keep you safe and can be expanded on.",
  "wiki.ic2.preview.armor.quantum": "Quantum Armor",
  "wiki.ic2.preview.armor.quantum.desc": "Quantum Armor is the upgraded Nano Armor. It has a larger energy storages and more expansion capabilities.",
  "wiki.ic2.preview.armor_configurator.desc": "The Armor Configurator provides customizability to the Electric Armors with §lModules§r that enable specific functionality. Like Super Speed, Night Vision, Jetpacks, etc",
  "wiki.ic2.preview.armor_priority_pad_upgrade.desc": "The Armor Priority Upgrade changes the Chargepad to provide armor with power before the hotbar",
  "wiki.ic2.preview.aurelia.desc": "Aurelia is your gold producing crop that requires an ore/block of gold underneath it to finish growing. Some say it's too shiny!",
  "wiki.ic2.preview.auto_feeder_module.desc": "Ignore the arm that comes out of your head and shoves a food can into your mouth. It's only the Auto Feeder Module automatically feeding you food cans.",
  "wiki.ic2.preview.azure_bluet.desc": "The Azure Bluet is a flower that produces gray dye. Like all flowers it requires a light level of 12 or more.",
  "wiki.ic2.preview.bamboo.desc": "The Bamboo crop produces bamboo and grows rather quickly. Though it prefers a low (4 or less) humidity to grow.",
  "wiki.ic2.preview.base_module.desc": "The Base Module. A crafting component to create Electric armor upgrades that can be installed in the Armor Configurator.",
  "wiki.ic2.preview.base_teleporter.desc": "The Base Teleporter is your local home network of destinations where you can jump around as needed for 4000EU/teleport. It has a horizontal radius of 100 blocks",
  "wiki.ic2.preview.battery": "Batteries",
  "wiki.ic2.preview.battery.desc": "Batteries are your portable energy storage that can be used to power other machines even outside of your grid.",
  "wiki.ic2.preview.battery.pack": "Energy Pack",
  "wiki.ic2.preview.battery.pack.desc": "The Energy Pack is another portable form of power storage. Where equipped tools, etc can make use of its power.",
  "wiki.ic2.preview.battery_station": "Battery Station",
  "wiki.ic2.preview.battery_station.desc": "The Battery Station discharges electric items to then output them into the world. It creates 4 packet of its tier.",
  "wiki.ic2.preview.beetroot.desc": "The Beetroot crop produces red beets that can be either turned into food or red dye.\n\nCan optionally produce seeds when set into that mode.",
  "wiki.ic2.preview.blackthorn.desc": "The Blackthrorn is a rose that produces black dye. Some rumor that it used to produce ink sacks. Sadly that seemed to be a lie.",
  "wiki.ic2.preview.blast_induction_furnace.desc": "The Induction Blast Furnace is a specialized induction furnace for ores only. It uses 30EU/t for faster smelting",
  "wiki.ic2.preview.blue_orchid.desc": "The Blue Orchid is known in the wild only to grow in swamps. The high nutrients make it a suitable target. Though it is not required. It does require a bright area though (12 or more). It produces light blue dye.",
  "wiki.ic2.preview.blue_wheat.desc": "Blue Wheat is a weird crop. Someone could say they wanted to rip off people by painting wheat blue but no. It is a lapis producing crop that requires a lot of water. Due to such high water requirements it is known to grown underwater.",
  "wiki.ic2.preview.bone_flower.desc": "The Bone Flower has a bone to pick with you. I am not joking. It produces bonemeal. It also requires a bone block underneath it to actually grow.",
  "wiki.ic2.preview.brain_coral.desc": "The Brain Coral is an underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of brain corals. That is under the assumption it's alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.bronze_cable_item.desc": "The Bronze Cable: the cheap alternative to gold! It handles up to 128EU but can only be used 1 block before losses occurs.",
  "wiki.ic2.preview.brown_mushroom.desc": "The Brown Mushroom produces itself, like a lot of other crops. It requires a Humidity of 1 or more to grow. And it grows rather fast.",
  "wiki.ic2.preview.bubble_coral.desc": "The Bubble Coral is an underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of bubble corals. That is under the assumption it's alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.buffer_storage_expansion.desc": "The Buffer Storage Expansion provides the Industrial Worktable with 9 temporary output slots that it can store undesired items in.",
  "wiki.ic2.preview.cactus.desc": "Cactus stings when touched and changing from a full sized one to a smaller one doesn't change that. It just requires sun light. Also the hotter the biome is, the faster it grows",
  "wiki.ic2.preview.canner.desc": "The Canner is a packager that uses 1EU/t to package food into cans or refill tools/items with their fuels/needs or combine fuels to make them more effective.",
  "wiki.ic2.preview.capacity_pipe.desc": "The High Volume Pipe has a higher transferrate, 200mB/tick compared to the normal pipe, but the strength is same.",
  "wiki.ic2.preview.carrot.desc": "Carrots are a great food source for you and your pigs! The Crop grows itself and provides you with a steady supplies of carrots. It requires a bright area around itself. (9 or higher)",
  "wiki.ic2.preview.centrifugal_extractor.desc": "The Centrifugal Extractor is an upgraded extractor using high speed rotation to extract elements from each other. Using 16EU/t",
  "wiki.ic2.preview.centrifugal_rare_earth_extractor.desc": "The Centrifugal REE is an upgrade to its counterpart which uses the power of rotation to separate rare metals a lot faster! It uses 16EU/t.",
  "wiki.ic2.preview.cf_pack.desc": "The CFoam Pack allows you to carry a lot more Cfoam with you. This becomes really useful for bigger spraying missions.",
  "wiki.ic2.preview.cfoam.carpet": "CFoam Carpet",
  "wiki.ic2.preview.cfoam.carpet.desc": "CFoam Carpets are incombustible and explosion resistant carpets!",
  "wiki.ic2.preview.cfoam.desc": "The Construction Foam Block is a decorative explosion resistant. It's not perfect but TNT doesn't scratch it.",
  "wiki.ic2.preview.cfoam.panel": "CFoam Panel",
  "wiki.ic2.preview.cfoam.panel.desc": "CFoam Panel that can be used to create railings or fence like results. It's also explosion resistant.",
  "wiki.ic2.preview.cfoam.slabs": "CFoam Slabs",
  "wiki.ic2.preview.cfoam.slabs.desc": "CFoam Slabs are decorative slabs that are also explosion resistant.",
  "wiki.ic2.preview.cfoam.stairs": "CFoam Stairs",
  "wiki.ic2.preview.cfoam.stairs.desc": "CFoam Stairs are decorative stairs that are also explosion resistant.",
  "wiki.ic2.preview.cfoam.tiles": "CFoam Tiles",
  "wiki.ic2.preview.cfoam.tiles.desc": "CFoam Tiles are carpet like in their shape yet are stone like. Again For decoration but explosion resistant.",
  "wiki.ic2.preview.cfoam.wall": "CFoam Wall",
  "wiki.ic2.preview.cfoam.wall.desc": "Want a decorative wall that is explosion resistant? CFoam walls got you covered!",
  "wiki.ic2.preview.cfoam.wool": "CFoam Wool",
  "wiki.ic2.preview.cfoam.wool.desc": "Incombustible explosion resistant wool? CFoam wool got you covered!",
  "wiki.ic2.preview.chainsaw.desc": "The Chainsaw is your go-to multi-purpose tool/weapon! It's really good at chopping trees but can also shear sheep. Overall a really useful tool!",
  "wiki.ic2.preview.charged_electrolyzer.desc": "The Charged Electrolyzer is a upgraded electrolyzer that is able to make use of multiple energy storages to infuse items a lot faster!",
  "wiki.ic2.preview.chargepad": "Charge Pad",
  "wiki.ic2.preview.chargepad.desc": "The Chargepad is a stationary recharger that will take care of your electric items when you stand on it. Just don't fall on it!",
  "wiki.ic2.preview.charger_module.desc": "The Charger Module. It adds special circuitry to the electric armor to share power with other items if they need it in your inventory.",
  "wiki.ic2.preview.charging_bench": "Charging Bench",
  "wiki.ic2.preview.charging_bench.desc": "The Charging Bench is a mass charging tool that is able to charge up to 16 any tier of electric item. It comes with some useful tools.",
  "wiki.ic2.preview.chunkloader.desc": "The Chunkloader uses electricity to keep the world from collapsing by creating a space time chamber. How big that is depends on power provided. 5EU/t at minimum.",
  "wiki.ic2.preview.cocoa.desc": "The Cocoa Bean crop produces said beans. It requires a nutritional ground (3 or more) to grow.",
  "wiki.ic2.preview.coffee.desc": "Coffee is the polar opposite to tea and both groups dislike each other immensely. It produces coffee beans if the area is bright enough (9 or higher), that can be used to craft various coffee products that give various effects.",
  "wiki.ic2.preview.coin.desc": "The Industrial Coin is an uncraftable item. It's a currency so it shouldn't be creatable. It is given out by the Trade-O-Mats.",
  "wiki.ic2.preview.color_filter_tube.desc": "The Color Filter Tube simply sorts items based on their color. Allowing for a more simplified filter and more complex systems.",
  "wiki.ic2.preview.colossal_compressor.desc": "What can you do if you have a hyper speed Compressor? Make the largest compressor possible! That is the Colossal Compressor! 40EU/t",
  "wiki.ic2.preview.colossal_extractor.desc": "What can you do if you have a hyper speed Extractor? Make the largest extractor possible! That is the Colossal Extractor! 40EU/t",
  "wiki.ic2.preview.colossal_furnace.desc": "What can you do if you have a hyper speed Furnace? Make the largest furnace possible! That is the Colossal Furnace! 40EU/t",
  "wiki.ic2.preview.colossal_macerator.desc": "What can you do if you have a hyper speed Macerator? Make the largest macerator possible! That is the Colossal Macerator! 40EU/t",
  "wiki.ic2.preview.colossal_recycler.desc": "What can you do if you have a hyper speed Recycler? Make the largest reycler possible! That is the Colossal Reycler! 40EU/t. It also increases luck by 500%",
  "wiki.ic2.preview.compact_solar_panel": "Compact Solar Panel",
  "wiki.ic2.preview.compact_solar_panel.desc": "Compact Solar Panels are basically a bunch of Solar Panels thrown together to save space. SERIOUSLY?!?!?",
  "wiki.ic2.preview.compact_watermill": "Compact Watermill",
  "wiki.ic2.preview.compact_watermill.desc": "Compact Watermills are thrown together Watermills, to brute force more efficiency out of them...which somehow works o.O?!?",
  "wiki.ic2.preview.compacting_recycler.desc": "The Compacting Recycler is an upgraded Recycler that uses 16EU/t to insanely fast recycle all the junk you don't need anymore.",
  "wiki.ic2.preview.comparing_cable_item.desc": "The Comparing Cable: It outputs a redstone signal based on the desired power throughput range. It can deal with 2048EU and has a loss every 2 Blocks",
  "wiki.ic2.preview.compressor.desc": "The Compressor is one of the machines required to advance in the tech tree. It does what it says; squishing things together. At a cheap 2EU/t. Get it before its too late!",
  "wiki.ic2.preview.condensator.desc": "The Condensator is the resource solution to getting rid of heat. They store a lot of heat. Useful for unstable reactor designs.",
  "wiki.ic2.preview.construction_light.desc": "You want a more interesting light in your construction site? How about a construction light? It makes the feel that much more realistic! Also it works!",
  "wiki.ic2.preview.copper_cable_item.desc": "The Copper Cable. Your starter cable that can handle up to 32EU and can be used for 5 blocks before any loss occurs.",
  "wiki.ic2.preview.cornflower.desc": "The Cornflower is a flower you would expect to produce corn. Nope, it produces blue dye! How is that logical? Ask someone else. It requires like all flowers a bright area (12 or more) to grow.",
  "wiki.ic2.preview.crimson_fungus.desc": "Crimson Fungus is your nether sapling. It can be grown into logs that allow you to survive in the nether without having logs with you. This crop though produces mushrooms and it requires a completely dry environment. Just make sure it doesn't explode on you.",
  "wiki.ic2.preview.crop_analyzer.desc": "The Crop Analyzer is your tool to find out what crops you have at the moment. But also allows you to see what crops would make if you breed them.",
  "wiki.ic2.preview.crop_analyzer_block.desc": "The Crop Analyzer is a stationary crop analyzer that can automatically analyze crops for 10000EU a crop. Though not instant it does that at 1EU/t.",
  "wiki.ic2.preview.crop_harvester.desc": "The Crop Harvester is an automatic crop picking machine. It is not fast and gets less resources but it can be upgraded and does its job for 5EU/t",
  "wiki.ic2.preview.crop_library.desc": "The Crop Library is your Digital Crop Storage. It can store as many crops as you need. Though 1EU/t is required to access them and its contents are lost when broken!",
  "wiki.ic2.preview.cropmatron.desc": "The Cropmatron is the babysitter of your crops. You want to have loved crops? Invest into one of these. 1-31EU/t your crops get all the tending they need!",
  "wiki.ic2.preview.cutter.desc": "The Cutter is your tool to control your wires. It is capable of adding and removing insulation of Cables.",
  "wiki.ic2.preview.damage_conversion_pad_upgrade.desc": "The Damage Conversion Upgrade turns the Chargepad into a deadly trap. Instead of using power to charge players it damages them.",
  "wiki.ic2.preview.dandelion.desc": "The Dandelion is your typical yellow flower that requires a bright area (12 or more) to grow. Nothing special to it.",
  "wiki.ic2.preview.detector_cable_item.desc": "The Detector Cable. It detects if power flows through it and then emits a redstone signal. It can handle 2048EU and can go for 2 blocks before any loss.",
  "wiki.ic2.preview.detector_card.desc": "The Detector Card allows you to visualize who triggered Player Detectors, allowing to create something like an access log.",
  "wiki.ic2.preview.detector_pipe.desc": "The Detector Pipe is redstone emitting pipe whenever a fluid is sent through it.",
  "wiki.ic2.preview.diamond_drill.desc": "The Diamond Drill is a drill upgrade that gives it the ability to mine harder blocks like obsidian, but also it mines dirt insanely fast. Warranting a dirt mode!",
  "wiki.ic2.preview.directional_tube.desc": "The Directional Tube forces items in a desired direction. Output can be optional blocked so nothing tries to come in through the output.",
  "wiki.ic2.preview.drain_conversion_pad_upgrade.desc": "The Drain Conversion Upgrade is even meaner. Instead of charging your items, it discharges them using the power you have in the pad.",
  "wiki.ic2.preview.drill.desc": "The Mining Drill is one of the earliest electric tools you'll want. It is a pickaxe and shovel combined into one. And with Scanner can scan for ores nearby!",
  "wiki.ic2.preview.dropping_tube.desc": "The Dropping Tube is like a dropper but doesn't have random motions attached to it. Also no redstone required!",
  "wiki.ic2.preview.dyeing_tube.desc": "The Dyeing Tube colors items that flow through it in the desired color. Painters are used for color selection.",
  "wiki.ic2.preview.dynamite.desc": "Dynamite is your really controlled explosion. It can be placed or thrown. It creates a 3x3x3 explosion that destroys most blocks. Good for mining.",
  "wiki.ic2.preview.dynamite_remote.desc": "The Dynamite-O-Mote can link to placed dynamite and can trigger all linked ones at once.",
  "wiki.ic2.preview.electric_blast_furnace.desc": "The Electric Blast furnace is specialized to only smelt ores using electricity. It uses 5EU/t and is a ~40% faster Blast Furnace",
  "wiki.ic2.preview.electric_enchanter.desc": "The Electric Enchanter gives you the ability to enchant electric tools. This is the only way and it takes 500EU/t to do so.",
  "wiki.ic2.preview.electric_furnace.desc": "The Electric Furnace is a simple yet straight forward furnace that uses electricity to cook. It uses 3EU/t and is ~40% faster than a normal Furnace.",
  "wiki.ic2.preview.electric_hoe.desc": "The Electric Hoe is your unbreakable hoe that can also change the drops of crops from products to seeds and back!",
  "wiki.ic2.preview.electric_pipe_pump.desc": "The EPP is a pump that uses electricity to send fluids through a pipe network. It has a strength of 250 Blocks and transfers up to 500mB per tick.",
  "wiki.ic2.preview.electric_smoker.desc": "The Electric Smoker uses electricity to smoke food?!?!?! HOW? Magic? Magic! It uses 5EU/t and is ~40% faster than the normal Smoker",
  "wiki.ic2.preview.electric_sprayer.desc": "The Electric Sprayer is your more controlled sprayer. Uses EU to precisely control how much CFoam is released. Only refillable in a Canner.",
  "wiki.ic2.preview.electric_tree_tap.desc": "Treetaps are fragile so the electric TreeTap solves that by using EU instead. It can be later also upgraded to auto insert the sticky resin into your inventory!",
  "wiki.ic2.preview.electric_vent.desc": "The Electric Vents use EU production from your reactor to cool it down 2x effective compared to the normal ones.",
  "wiki.ic2.preview.electric_wood_gassifier.desc": "The Electric Wood Gasificator is a electrified Wood Gasificator that uses 1EU/t to do the same job. Sadly it produces slightly less wood gas",
  "wiki.ic2.preview.electric_wrench.desc": "The Electric Wrench is your upgrade to the wrench. It has a slightly higher drop rate, that can be upgraded, and it has 15 ensured lossless drops.",
  "wiki.ic2.preview.electrolyzer.desc": "The Electrolyzer is a machine that infuses items with electricity. It is required to directly touch a mostly full energy storage to do its work. The storage tier decides speed.",
  "wiki.ic2.preview.energy_hud_module.desc": "The HUD Module adds an info display to your view allowing you to see the power of each electric armor piece all the time. Its position isn't final.",
  "wiki.ic2.preview.energy_o_mat.desc": "The Energy-O-Mat is a block that allows energy to be traded for items or coins. It requires a personal energy storage to be connected. Allows automated Trading.",
  "wiki.ic2.preview.energy_storage": "Energy Storage",
  "wiki.ic2.preview.energy_storage.desc": "Energy Storages store excess energy in your power grid. The packet energy limit is the same as it outputs.",
  "wiki.ic2.preview.eu_card.desc": "The EU Card shows you how much power is inside a machine.",
  "wiki.ic2.preview.eu_reader.desc": "The EU Reader is your information tool. Be it GUI info, energy flow information or just general stats. It opens up the information you get massively!",
  "wiki.ic2.preview.extinguish_module.desc": "You are on fire? Do you wanna get rid of it? The Extinguish Module comes to the rescue! It removes the fire of you as soon as it appears. It does not protect from lava.",
  "wiki.ic2.preview.extraction_tube.desc": "The Extraction Tube is the tube that simply extracts from connected inventories at a steady paste. Optional Extra extraction faces can be added via TubeTool.",
  "wiki.ic2.preview.extractor.desc": "The Extractor is a resource refiner. Its main use is to refine sticky resin into rubber, tripling your output!. But it has a lot more uses. Justifying the 2EU/t.",
  "wiki.ic2.preview.ferru.desc": "The Ferru Crop is your Iron Crop. The most valueable out of all metal crops. It requires an iron block/ore to finish growing.",
  "wiki.ic2.preview.fertilizer.desc": "Fertilizer is used to boost the growth of crops. It's slowly consumed over time.",
  "wiki.ic2.preview.filter_tube.desc": "The Filter Tube allows sorting items into your desired directions.",
  "wiki.ic2.preview.filtered_extraction_tube.desc": "The Filtered Extraction Tube is a much more advanced Extraction Tube. It can be filtered but also upgraded to move more items at once.",
  "wiki.ic2.preview.filtered_scanner.desc": "The Filtered Scanner allows you to decide what exactly are you searching for. It is not limited to ores like the others.",
  "wiki.ic2.preview.fire_coral.desc": "The Fire Coral is an underwater crop that can be used to grow coral Blocks. It has a chance to produce all variants of fire corals that is under the assumption it's alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.fisher": "Electric Fisher",
  "wiki.ic2.preview.fisher.desc": "The Electric Fisher is your endgame solution to loot. It takes a lot of power but drains the oceans out of all its loot.",
  "wiki.ic2.preview.fluid_expansion.desc": "The Fluid Expansion allows the Industrial Workbench to use fluids directly in its recipes. It stores up to 4 different fluids with a capacity of 128 buckets.",
  "wiki.ic2.preview.fluid_o_mat.desc": "The Fluid-O-Mat is a Block that allows fluids to be traded for items or coins. It requires a Personal Tank to be connected. Allows automated Trading.",
  "wiki.ic2.preview.fluid_scanner.desc": "The Fluid Scanner only searches for fluids. Its main use is for the Ranged Pump or if you use the Miner with pumps",
  "wiki.ic2.preview.fluid_scanner_filtered.desc": "The Filtered Fluid Scanner allows you to search for specific fluids instead of any of them.",
  "wiki.ic2.preview.fluid_tube.desc": "The Fluid Tube, the unholy fusion between a tube and pipe. Basically allows crossing of 2 streams.",
  "wiki.ic2.preview.flux_generator": "Flux Generator",
  "wiki.ic2.preview.flux_generator.desc": "The Flux Generator creates RF out of EU. Allowing for FE/RF Power by means of EU and can act as an item charger!",
  "wiki.ic2.preview.foam_sprayer.desc": "The CFoam Sprayer uses pellets to spray wet CFoam. Scaffolds can be used as guidelines, and wires/tubes/pipes can be sprayed too.",
  "wiki.ic2.preview.food_storage_module.desc": "Don't want to carry food cans around in your inventory? No problem! The Food Storage Module adds 4 slots for useable foodcans.",
  "wiki.ic2.preview.forget_me_not.desc": "The Forget Me Not flower is a pretty looking cyan flower. It is usually forgotten since it is a compound flower that is not often needed. It requires like all flowers a bright area to grow (12 or more).",
  "wiki.ic2.preview.frequency_transmitter.desc": "The Frequency Transmitter is the tool to link 2 teleporters or teleport valves together.",
  "wiki.ic2.preview.fuel_boiler.desc": "The Fuel Boiler is a steam producing multiblock machine that can only be fed with fuel cans, albeit at a really high fuel efficiency. It produces 1024mB/t of Steam.",
  "wiki.ic2.preview.fuel_can.desc": "The Fuelcan is your modular fuel storage. It is refilled in the §lCanner§r and can be a really great fuel source. Depending on the canner it can be filled with 6-12 items.",
  "wiki.ic2.preview.fuel_jetpack.desc": "The Jetpack is your early game solution to flight. It is really good at vertical motion but sadly not so good at horizontal motion.",
  "wiki.ic2.preview.fusion_reactor.desc": "Out of lava? Want a constant supply? And don't want to pump the nether? The Thermo Reactor got you covered. It produces lava using uranium!",
  "wiki.ic2.preview.generator.desc": "The Generator is your most basic machine for EU generation, producing a whooping 10EU/t. It uses solid fuels, such as coal or wood, in a similar manner as a furnace.",
  "wiki.ic2.preview.geothermal_generator.desc": "The Geothermal is a powerful lava-using generator, Producing a whooping 20EU/t. Covering a lot of your early game needs easily.",
  "wiki.ic2.preview.glassfiber_cable_item.desc": "The Glassfiber Cable. Wait Glassfiber? How? Magic? Anyhow its a expensive but valuable cable that deals with 512EU and can go 40 blocks without loss",
  "wiki.ic2.preview.glow_berry.desc": "The Glow Berry is a mid-game(ish) food that can be used for baking!\n\nOtherwise there is not much about it.",
  "wiki.ic2.preview.glowshroom.desc": "The Glowshroom. Why does it exist? Because GLOWSHROOM! It produces glowstone dust but requires a glowstone block to touch it so it can finish growing.",
  "wiki.ic2.preview.gold_cable_item.desc": "The Gold Cable: your higher quality power transfer. Handling up to 128EU and can transfer 2 blocks without any loss.",
  "wiki.ic2.preview.golden_module.desc": "Piglins love GOLD. But they despise Electric Armors. So the Golden Module makes the Armor Bling! No more piglin problems!",
  "wiki.ic2.preview.heat_exchanger.desc": "The Heat Exchanger exchanges heat with nearby components and or the reactor itself, helping balance out the heat.",
  "wiki.ic2.preview.heat_pack.desc": "The Heatpack heats up the reactor to 1000x its size. Allowing to easily maintain a certain heat level. Can not be used in a Steam Reactor",
  "wiki.ic2.preview.heat_spreader.desc": "The Component heat vent cools down the nearby touching components slowly.",
  "wiki.ic2.preview.heat_storage": "Coolant Cell",
  "wiki.ic2.preview.heat_storage.desc": "The Heat Storage allows you to temporarily store heat in a heat cache. Allowing your components to last longer.",
  "wiki.ic2.preview.heat_vent.desc": "The Heat Vent slowly cools itself and/or the reactor.",
  "wiki.ic2.preview.hemp.desc": "Hemp is a IC2 exclusive crop. Yes, you cannot plant it without IC2 crop sticks. It produces said Hemp that can be used in a lot of manufacturing processes. It requires a bright area to grow (7 or more).",
  "wiki.ic2.preview.hops.desc": "Hops are your introduction into brewing. Beer can be sold to Селяни, used to produce power, or for higher yields from ores. It is a fully manual process that takes hours to finish but can be easily mass produced. It requires a bright area (9 or more) to grow.",
  "wiki.ic2.preview.horn_coral.desc": "The Horn Coral is an underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of horn corals. That is under the assumption its alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.hover_tube.desc": "The Hover Tube is a expensive piece of technology that allows items not to be affected by gravity or change speed at all.",
  "wiki.ic2.preview.hydration_cell.desc": "The Hydration Cell is your way to provide extra humidity to your crops. Some require a really high humidity to grow.",
  "wiki.ic2.preview.induction_furnace.desc": "The Induction Furnace is an upgraded electric furnace that can process items faster and up to 2 at once at the cost of staying powered and 16EU/t (1EU/t idle).",
  "wiki.ic2.preview.industrial_belt.desc": "The Industrial Belt allows you to carry some charge around your legs that tools can make use of when at a mining session.",
  "wiki.ic2.preview.industrial_worktable.desc": "The Industrial Worktable is the main tool that will make sure all your crafting needs are dealt with as efficiently as possible!",
  "wiki.ic2.preview.inkbergine.desc": "The Inkbergine is a squid planted underwater upside down into the ground. It slowly grows inksacks for you. But be careful not to touch it. It might ink at you.",
  "wiki.ic2.preview.input_pipe.desc": "The Input Pipe accepts fluids from external sources, causing them to be distributed through it. Only has a strength of 25 blocks.",
  "wiki.ic2.preview.insertion_tube.desc": "The Insertion Tube prioritizes inserting into inventories over into going to other tubes, plain and simple.",
  "wiki.ic2.preview.inv_card.desc": "The Inventory Card allows you to visualize an inventory with multiple modes of how it should be displayed. A good way to keep track of inventories!",
  "wiki.ic2.preview.iridium_stone.desc": "Need a personalized base? Iridium Stone is the perfect source for it. The block can only be destroyed by their owner and they are NUKE-SAFE!",
  "wiki.ic2.preview.iron_cable_item.desc": "The Refined Iron Cable. It is able to withstand 2048EU but with the price that it has 1EU loss at every block.",
  "wiki.ic2.preview.iron_furnace.desc": "The Iron Furnace is a better version of the normal furnace. Its main improvements are a faster cook time which also improves fuel efficiency.\nIron > Stone.",
  "wiki.ic2.preview.item_limiter.desc": "The Item Limiter Upgrade allows you to decide how many items of each type are allowed to stay in the specific inventory. Which can come handy really easily.",
  "wiki.ic2.preview.itnt.desc": "Industrial TNT is an upgraded form of TNT. It has a stronger explosion strength, but works exactly like TNT and drops all destroyed blocks! Perfect for mining!",
  "wiki.ic2.preview.jump_boost_module.desc": "The Jump Boost Module provides you with a stronger jump force to jump higher than normal.",
  "wiki.ic2.preview.kelp.desc": "Kelp is your underwater fuel source that you can actually grow on land now!. Mass production is usually desirable since it is a really solid fuel source. It also cleans the water around it.",
  "wiki.ic2.preview.lag_card.desc": "The Lag Card shows you how much lag is on the server. It is the global lag.",
  "wiki.ic2.preview.lava_module.desc": "Ever wanted a hot bath? How about a lava bath? The Lava Module allows you to swim in lava for a constant energy drain.",
  "wiki.ic2.preview.light_module.desc": "Do you hate placing torches in caves? The Light Module is a toggleable portable light. Note that this is a actual light not a renderer only thing.",
  "wiki.ic2.preview.lily_of_the_valley.desc": "The Lily of the Valley is your typical white dye flower. It requires a constant light source of 12 or more to fully grow.",
  "wiki.ic2.preview.limiter_tube.desc": "The Limiter Tube is your way of partially splitting a request grid, where some request colors are blocked, while others are let through. ",
  "wiki.ic2.preview.liquid_generator.desc": "The Liquid Fuel Generator uses liquid fuels to produce power. Production varies heavily based on the fuel.",
  "wiki.ic2.preview.lumilia.desc": "The Lumilia is a decorative Crop that requires moon light to grow. It only produces leaves, but it emits a light when it is fully grown.",
  "wiki.ic2.preview.luminator.desc": "The Luminator does what it says; it brightens up your day! For a little bit of energy of course. It can be also encapsulated in glass when clicked with said glass.",
  "wiki.ic2.preview.macerator.desc": "The Macerator is a really useful early game machine. Its purpose is pretty simple: smash ores to dust, doubling your ingots! It uses 2EU/t to do so.",
  "wiki.ic2.preview.machine_buffer.desc": "The Machine Buffer is a small item buffer that is capable of using transport upgrades to sort items around. Really useful for automation.",
  "wiki.ic2.preview.machine_tank.desc": "The Machine Tank is a small fluid buffer that is capable of using transport upgrades to transfer fluids around. Really useful for automation.",
  "wiki.ic2.preview.magnetizer.desc": "The Magnetizer is what a bubble column is to a ladder. It charges up Iron Fences that will swoosh you up into the sky or slowly let you down if you sneak while wearing metallic boots!",
  "wiki.ic2.preview.malachite.desc": "Malachite is your rusty copper crop. It requires a ore/block underneath it to finish growing.",
  "wiki.ic2.preview.mass_fabricator.desc": "Too much energy? No worries the Massfab has you covered!! It uses a lot of energy to create pink blobs called UU Matter that can be used to craft almost anything!",
  "wiki.ic2.preview.melon.desc": "The Melon is a chunky food source that produces melon slices though it has a small chance to produce full melon blocks too. It can be also set to produce seeds instead of slices.",
  "wiki.ic2.preview.memory_expansion.desc": "The Memory Expansion provides the Industrial Workbench up to 18 new recipe slots for your more complex recipes.",
  "wiki.ic2.preview.memory_stick.desc": "The Memory Stick is the recipe expansion to the Industrial Workbench and Bulk Crafter. It stores the recipes for later use.",
  "wiki.ic2.preview.miner.desc": "The Miner is a really efficient digger. It uses scanners, drills and mining pipes to dig directly towards the ores instead of quarrying. Using 16EU/t. Pumps interact with it.",
  "wiki.ic2.preview.miner_remote.desc": "The Miner Remote is a locator for the Ракетний гірник that allows it to come to its \"Home\" Location, to be refueled or emptied.",
  "wiki.ic2.preview.mining_laser.desc": "The Mining Laser is your advanced digging tool. It has various laser modes to get rid of Blocks. It can be used in a Miner and it has a powerful weapon mode too!",
  "wiki.ic2.preview.monitor.desc": "The Monitor. A really useful, fully modular, block that displays text and other things on it. It uses monitor cards to function.",
  "wiki.ic2.preview.monitor_card.desc": "The Monitor Card is the base for all information cards you need or in TLDR terms; its a crafting component. Monitor Cards can be customized via a gui.",
  "wiki.ic2.preview.mowing_tool.desc": "Ever get annoyed by leaves or grass? The Mowing Tool comes to the rescue! When enabled you look at something that annoys you and GONE it is! It avoids crops though.",
  "wiki.ic2.preview.nano_saber.desc": "The Nano Saber is your weapon of choice against electric armor. It deals a lot of extra damage on a molecular level. Making it a dangerous counter! ",
  "wiki.ic2.preview.netherwart.desc": "The Netherwart is the opposite of a Terrawart. It is used to produce potions among a few other things. If a soulsand block is underneath it it grows 50% faster and Terrawarts turn into Netherwarts.",
  "wiki.ic2.preview.nightvision_goggles.desc": "Night Vision Goggles let you see in the dark. But unlike the experimental counterpart it does not make you blind when in bright spots.",
  "wiki.ic2.preview.nuclear_reactor.desc": "The Nuclear Reactor is your \"§lUltimate§r §lPower§r §lSource!§r\". It is fully customizable §mand safe§r! It's able to fulfill all your power needs. At the risk of losing everything.",
  "wiki.ic2.preview.nuke": "Nuke",
  "wiki.ic2.preview.nuke.desc": "The Nuke is a very strong explosion. It is roughly 75x stronger than normal TNT. Expect a very large crater with very little items dropped. Can be defused by Wrench.",
  "wiki.ic2.preview.obscurator.desc": "Ever wanted to build a solid 9x9 house of diamond but didnt't want to mine for it? The Obscurator does the job! It can copy and rotate textures and paste it on to CFoam!",
  "wiki.ic2.preview.ocean_generator.desc": "The Ocean Generator is a powerhouse of a producer. It requires a lot of water to function and coral blocks to keep it clean. It produces up to a whopping 100EU/t.",
  "wiki.ic2.preview.orange_tulip.desc": "The Orange Tulip is part of the tulip flower family. It produces orange dye and requires a light level of 12 or higher.",
  "wiki.ic2.preview.ore_scanner.desc": "The Ore Scanner makes use of scanners and 40EU/block to show you exactly what/how much and where your desired resources are! Really underappreciated!",
  "wiki.ic2.preview.overclocked_pump.desc": "The Overclocked Pump is a faster pump that does the exact same thing with an added power cost attached to it. Just a lot faster.",
  "wiki.ic2.preview.overgrowth_fertilizer.desc": "This special fertilizer is your nuclear fuel for crops. With it the growth speed increases by 256x for 5 mins. This can go horribly wrong.",
  "wiki.ic2.preview.oxeye_daisy.desc": "The Oxeye Daisy is a daisy flower that produces light gray dye. Like all flowers it needs a bright light level.",
  "wiki.ic2.preview.painter.desc": "The Painter colors stuff. Shocking I know... On top of that it makes dyes more efficient and can mass-paint blocks too.",
  "wiki.ic2.preview.parachute_module.desc": "You are falling from really high and you know you are going to die. You should have added a Parachute Module that could have prevented that. Too bad!",
  "wiki.ic2.preview.personal_chest.desc": "Do you like your items safe? Even if someone Nukes your base? The Personal Chest has got you covered. It provides access control and can not be destroyed!",
  "wiki.ic2.preview.personal_tank.desc": "You want your own Personalized Tank? That nobody can nag from? The Personal Tank got you covered. It allows even customized Access!",
  "wiki.ic2.preview.pickup_tube.desc": "The Pickup tube inserts any item that it touches into itself, with a configurable radius using the §<redirect;true;Tube Tool;ic2:preview.tube_tool>. The lines it throws must be that good. Good for cacti farms.",
  "wiki.ic2.preview.pink_tulip.desc": "Ok you must be getting bored of this self repeating text. The Pink Tulip is a pink flower that requires a light level of 12 or more and produces pink dye.",
  "wiki.ic2.preview.pipe.desc": "The Fluid Pipe is your tool to transport fluids around. It has some output filters and optional extraction abilities. Can send 20mB/t with a strength of 25.",
  "wiki.ic2.preview.pixelfoam": "Pixel Foam",
  "wiki.ic2.preview.pixelfoam.desc": "Pixelfoam is a very decorative block with unique texturing. Some might have special abilities!",
  "wiki.ic2.preview.plasma_cable_item.desc": "The Plasma Cable: the ULTIMATE cable! It can deal with 32kEU though for a loss every block. At this point? Who cares about loss?",
  "wiki.ic2.preview.plasmafier.desc": "The Plasmafier is the last gate to LuV Tier. It creates plasma with 10000EU/t and UU-Matter which can be stored in empty cells that are used unlock all the endgame items!",
  "wiki.ic2.preview.plating.desc": "Reactor Plating allows you to expand the heat limit of the reactor before it blows up.",
  "wiki.ic2.preview.poppy.desc": "The Poppy, also known as a rose, is your basic red flower. Same rules like all flowers apply.",
  "wiki.ic2.preview.portable_teleporter.desc": "The Portable Teleporter is at the §labsolute§r §lendgame§r. You can link it to a teleporter, and on a click, you are there! Uses a lot of power!",
  "wiki.ic2.preview.potato.desc": "The Potato crop. This one is a bit unique. While requiring a light level of 9 or greater it produces potatoes. But also it has a very small chance to produce poisonous potatoes. Which is actually the more valuable product.",
  "wiki.ic2.preview.precision_wrench.desc": "The Precision Wrench is the final wrench upgrade. It doubles all wrench chances, making it effectively lossless.",
  "wiki.ic2.preview.pressure_alloy_furnace.desc": "The Pressure Alloy Furnace is a multiblock upgrade to its counterpart. It requires to heat-up to process resources faster at 16EU/t.",
  "wiki.ic2.preview.pressure_pipe.desc": "The High Pressure Pipe is your long distance pipe if 20 strength isn't enough. It increases it to 100 Strength.",
  "wiki.ic2.preview.progress_card.desc": "The Progress Card shows the current progress of a machines operation.",
  "wiki.ic2.preview.protective_module.desc": "Poisons are annoying. Luckily the Protective Module gets rid of them pretty quickly, though at a cost.",
  "wiki.ic2.preview.provider_tube.desc": "The Logistic Provider Tube that provides items as they are requested by the Logistic Grid. Loads of settings. Priority direction can be set using TubeTool.",
  "wiki.ic2.preview.proximity_booster_pad_upgrade.desc": "The Proximity Booster Upgrade allows to charge not only the item you have in your hand but also the slots directly touching it.",
  "wiki.ic2.preview.pump.desc": "The Pump is a machine that uses EU to suck up the fluids directly below it to transfer them into a fluid container. It uses 1EU/t and has a lot of special interactions.",
  "wiki.ic2.preview.pumpkin.desc": "The Pumpkin crop: it produces pumpkins. Nothing special about it.",
  "wiki.ic2.preview.purple_tulip.desc": "The Purple Tulip produces Purple dye and requires a light level of 12 or more.",
  "wiki.ic2.preview.quarry_scanner.desc": "The Quarry Scanner turns the Miner into a quarry that digs up everything. Not caring about what it actually is that it is digging up.",
  "wiki.ic2.preview.rainbow_flower.desc": "The Rainbow Flower is a very unique flower. It produces all dye types but which one it drops is fully random. Rumors says that it also was able to produce lapis at a very low chance. Though these are just rumors. Also flower rules apply.",
  "wiki.ic2.preview.ranged_pump.desc": "The Ranged Pump is another pump upgrade that allows to pump fluids from a lot further away, thanks to the miners ability. It can not mine. It uses 8EU/t",
  "wiki.ic2.preview.rare_earth_extractor.desc": "Mother's Cubic Shaped Earth hides a lot of rare resources from us, like Aluminium! The Rare Earth Extractor slowly unlocks these for us. At 1EU/t.",
  "wiki.ic2.preview.reactor_card.desc": "The Reactor Card provides you a lot of information about the reactor. From production to time thats left to run the uranium and more",
  "wiki.ic2.preview.reactor_fuel_cell.desc": "The Reactor Fuel Cell is a fuel that has to be charged up by touching the Uranium rod. It absorbs Isotopes created by it.",
  "wiki.ic2.preview.reactor_planner.desc": "The Reactor Planner is a simulator that allows you to safely test your reactor setups without getting nuked. It uses 100EU/t to simulate the reactor design.",
  "wiki.ic2.preview.recycler.desc": "The Recycler is used to eliminate all the unwanted items lying around a base. While slower than a lava pool, it can produce scrap which can be used later. At 1EU/t.",
  "wiki.ic2.preview.red_mushroom.desc": "The Red Mushroom is the prettier one of the two. But don't say that to the brown mushroom. It produces red mushrooms and requires any humidity to grow.",
  "wiki.ic2.preview.red_tulip.desc": "Red tulip is basically a poppy clone. That sums it up.",
  "wiki.ic2.preview.red_wheat.desc": "Redwheat is just a shy wheat. It doesn't like brightness (between 5 and 12). Its product is redstone dust so its really valuable. It can also produce seeds if it is set to the mode.",
  "wiki.ic2.preview.redirector_master.desc": "The Redirector Master is a really unique block. It can split power up to its slaves based on a percentage. Allowing to take power distribution into your own hands.",
  "wiki.ic2.preview.redirector_slave.desc": "The Redirector Slave accepts power from its Master and attempts to distribute it. If it can not do that then the future packets will be temporary split over other slaves.",
  "wiki.ic2.preview.redstone_tube.desc": "The Redstone Tube emits a redstone signal every time a item flows through it, and once it has no longer items in it the signal goes away.",
  "wiki.ic2.preview.refinery.desc": "The Refinery lets you process resources into better quality resources. Mixing items and fluids together as needed. Increasing ore yields or producing high quality fuel.",
  "wiki.ic2.preview.reflector.desc": "The Neutron Reflector makes uranium more efficient while causing more heat by reflecting neutrons back into the source.",
  "wiki.ic2.preview.reinforced.glass": "Reinforced Glass",
  "wiki.ic2.preview.reinforced.glass.desc": "The Reinforced Glass is extra stable glass that can resist explosions. It is slightly weaker then it's stone counterpart.",
  "wiki.ic2.preview.reinforced.stone": "Reinforced Stone",
  "wiki.ic2.preview.reinforced.stone.desc": "The Reinforced Stone is stronger than obsidian and with multiple layers it can hold a nuke explosion in!",
  "wiki.ic2.preview.reinforced_door.desc": "The Reinforced Door is an extremely protective against explosions. So in short it's a safe door!",
  "wiki.ic2.preview.request_tube.desc": "The Requester Tube allows items to be requested from connected Provider Tubes. It has loads of settings, for example color coding, that can be looked into.",
  "wiki.ic2.preview.restoring_fertilizer.desc": "This fertilizer repairs the crop from its nuclear counterpart since its dead afterwards. Neither can be used twice.",
  "wiki.ic2.preview.rock_cutter_drill.desc": "The Jack-Hammer is a specialized drill that Greg invented. It was optimized against stones and obsidian and nothing else. Mining a stack of Obsidian was never so satisfying!",
  "wiki.ic2.preview.rocket_miner.desc": "The Ракетний гірник is a flying miner that searches for new locations to dig for. On top of that you can give it a refuel station and a way to get rid of garbage.",
  "wiki.ic2.preview.rotary_macerator.desc": "The Rotary Macerator is an upgraded Macerator and can smash rocks a lot quicker for 16EU/t, though it requires a constant signal to stay at this fast speed.",
  "wiki.ic2.preview.rotor": "Windmill Rotors",
  "wiki.ic2.preview.rotor.desc": "The Rotors are what you throw into a §<redirect;true;Windmill;ic2:preview.windmill> to make it spin. They only have different durabilities.",
  "wiki.ic2.preview.round_robin_tube.desc": "The Round Robin tube redistributes items to other sides in the desired quantities; stacksize is completely ignored.",
  "wiki.ic2.preview.sapling_acacia.desc": "The Bonsai Acacia Tree is your Acacia log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_birch.desc": "The Bonsai Birch Tree is your Birch log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_dark_oak.desc": "The Bonsai Dark Oak Tree is your Dark Oak log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_jungle.desc": "The Bonsai Jungle Tree is your Jungle log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_oak.desc": "The Bonsai Oak Tree is your Oak log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sapling_spruce.desc": "The Bonsai Spruce Tree is your Spruce log/sapling producer. It is one of the most lag efficient tree farms you can make. It requires a light level of 9 and thats it.",
  "wiki.ic2.preview.sawmill.desc": "The Sawmill is a simple machine. It furiously cuts logs into planks for 2EU/t with the ability to get more efficient than the player using §<redirect;true;Sawblade upgrades;ic2:preview.upgrade_efficient_sawblade>. Watch your fingertips!",
  "wiki.ic2.preview.scanner.od": "Ore Density Scanner",
  "wiki.ic2.preview.scanner.od.desc": "The Ore Density Scanner shows you how dense the ores are below you using binary evaluation.",
  "wiki.ic2.preview.scanner.ov": "Ore Value Scanner",
  "wiki.ic2.preview.scanner.ov.desc": "The Ore Value Scanner shows you the total value of the ores below you, evaluating it based on the value of the ores.",
  "wiki.ic2.preview.scrapbox.desc": "The Scrapbox is the unofficial Lootbox of the game. It has a lot of random and rare drops. Just make sure not to mass-produce them...",
  "wiki.ic2.preview.sea_grass.desc": "Sea Grass is your underwater weed that destroys your crops. Since weed can not grow underwater this will spread instead.",
  "wiki.ic2.preview.sea_pickle.desc": "The Sea seems to be in a pickle, well it grows pickles. Sea Pickles are a source of green dye and also emits light underwater. Its a cool light source. It requires a bright area (10 or more) to grow.",
  "wiki.ic2.preview.shields": "Shields",
  "wiki.ic2.preview.shields.desc": "IC2 adds some custom shields to the game that just add variety. The electric one uses electricity instead of durability.",
  "wiki.ic2.preview.simple_crop_library.desc": "The Simple Crop Library is your early access to a more dense crop Storage. It can store up to 20 different crops with 20 mutations and doesn't need power.",
  "wiki.ic2.preview.simple_pipe_pump.desc": "The Simple Pipe Pump is a pump that sends fluids through a pipe grid. It has a strength of 100 blocks and transfers 20mB per tick.",
  "wiki.ic2.preview.simple_tube.desc": "Your basic tube that moves items around. Not much to add. Cheap and does the job.",
  "wiki.ic2.preview.singularity_compressor.desc": "The Singularity Compressor is an upgraded Compressor that uses the power, 16EU/t, to build enough pressure for a singularity.",
  "wiki.ic2.preview.slag_generator.desc": "The Slag Generator is an advanced Generator, increasing its output to a whooping 60EU/t. On top of that, it randomly outputs scrap as a side product.",
  "wiki.ic2.preview.slow_grinder.desc": "The Slow Grinder is a highly efficient Recycler that has a 100% efficiency or less if faster speeds are desired. For 10EU/t.",
  "wiki.ic2.preview.smoker_induction_furnace.desc": "The Induction Smoker is a specialized Induction Furnace that can only smoke foods a lot quicker for 30EU/t. How? Magic! How else?!?!",
  "wiki.ic2.preview.solar_helmet.desc": "The Solar Helmet is your passively portable power source that charges your armor and tools. Will not help underground!",
  "wiki.ic2.preview.solar_panel.desc": "The Solar Panel is a §lFREE POWER§r generator. Granting you 1EU/t during the day. Making use of the seemingly infinite power of the sun. Just make sure to have a backup.",
  "wiki.ic2.preview.solar_panel_compressed.desc": "\"What if I threw my Solar Panel into a Compressor?\". Yeah that's how bad ideas come to life...",
  "wiki.ic2.preview.solar_turbine.desc": "The Solar Turbine is an upgraded solar panel. While provided with water it will produce up to 32EU/t. It will continue to produce as it cools off, maximize it's power.",
  "wiki.ic2.preview.sonar_module.desc": "The Sonar Module is a short/long range scanner that highlights all entities within a range. Might become useful if you search for something. Cool effect included.",
  "wiki.ic2.preview.sound_beacon.desc": "The Sound Beacon is your way to control IC2 sounds. Since they are special, this allows you to create micro pockets of noise reducers/amplifiers. Uses upgrades.",
  "wiki.ic2.preview.speed_boost_module.desc": "The Speed Boost Module makes you go around at the speed of sound. Just don't run into walls.",
  "wiki.ic2.preview.speed_tube.desc": "The Speed Tube makes sure that your items are flowing around fast in your world.",
  "wiki.ic2.preview.splitter_cable_item.desc": "The Splitter Cable. It can be used to be your shut off for a connection via redstone. It deals with 2048EU and has a loss every 2 blocks.",
  "wiki.ic2.preview.splitter_pipe.desc": "The Splitter Pipe is a utility pipe that cuts all connections when it is powered, but reconnects them the moment the redstone signal is gone.",
  "wiki.ic2.preview.stacking_tube.desc": "The Stacking Tube. A directional Tube that consumes all items and stacks them to the desired size. Then outputs them to the desired side.",
  "wiki.ic2.preview.stannum.desc": "Stannum is your flexible tin ore crop. Tin is used practically everywhere. It requires a ore/block of said metal below it to grow, slick and simple.",
  "wiki.ic2.preview.static_boots.desc": "Static Boots are what kids always do when kids find out that carpets can be used to cause shocks. You get a slight EU production for every few blocks you walked.",
  "wiki.ic2.preview.steam_reactor.desc": "The Steam Reactor is the §lUltimate§r §lUpgrade§r to a Reactor. It adds risk, for a lot of reward. Energy Production is a lot higher, at the cost of no room for failure.",
  "wiki.ic2.preview.steam_tunnel.desc": "The Steam Tunnel is a multiblock power source producing a whooping 2048EU/t in packets of 512EU for up to 4096mB of Steam. Giving back the water.",
  "wiki.ic2.preview.steam_turbine.desc": "The Steam Turbine is your way to produce EU from steam. It produces 32EU/t from 64mB of steam, without giving water back. Using a §<redirect;true;Fuel Boiler;ic2:preview.fuel_boiler> as source adds 8EU/t.",
  "wiki.ic2.preview.steam_vent.desc": "The Steam Vent uses water from the reactor to create steam. The hotter they are the more efficient they get.",
  "wiki.ic2.preview.step_assist_module.desc": "Everyone loves step assist. Here is the module for it. Though there is a small cost attached to it.",
  "wiki.ic2.preview.stickreed.desc": "Sticky Reeds are the most valuable crop out of all the crops as it produces sticky resin en masse. If you're always out of rubber; this solves all your issues. It is just pretty hard to obtain but no special needs.",
  "wiki.ic2.preview.sticky_dynamite.desc": "Sticky Dynamite is your throw only dynamite that sticks to the first block it touches. Otherwise it works exactly like normal dynamite.",
  "wiki.ic2.preview.sticky_tube.desc": "The Sticky Tube is a real cool tube, it sticks everywhere! Jokes aside it allows you to extract from treetap and buckets on your rubber wood trees! No more flying resin woot!!",
  "wiki.ic2.preview.stone_canner.desc": "The Stone Canner is a food processor, that increases the value of food for using tin cans. These give one food per can but also heal.",
  "wiki.ic2.preview.stone_macerator.desc": "The Stone Macerator is a very primitive Macerator that runs on coal. It is terribly fuel inefficient but allows for early ore doubling.",
  "wiki.ic2.preview.storage_expansion.desc": "The Storage Expansion adds another 18 slots to the Industrial Worktable, plain and simple.",
  "wiki.ic2.preview.su_battery.desc": "The Single Use Battery is a small but useful tool that provides 1000 EU for a bit of redstone and coal. Allowing to quickly get into energy without building generators.",
  "wiki.ic2.preview.sugarcane.desc": "Sugarcane, a very fast growing crop. It produces sugarcane and is the breeding material for sticky reed. Rumors say it grows faster on sand than on dirt. Other rumors say the opposite. Nobody knows which one is true.",
  "wiki.ic2.preview.super_cable_item.desc": "Ahh the Super Cable. Through the power of beer you are able to transfer 8192EU through a 1000 Blocks before any loss occurs. Some may say its still too cheap!",
  "wiki.ic2.preview.sweet_berry_bush.desc": "The Berry Bush is an early game food source that sting you if you are not careful. Outside of that, they do not have any requirements.",
  "wiki.ic2.preview.switch_tube.desc": "The Simple Switch Tube. Does what it says. If it receives a redstone signal, it will simple close all connections until the signal goes away.",
  "wiki.ic2.preview.tank.desc": "The Tank is a modular fluid container that can be built out of a lot of blocks. It can be up to 50x200x50 Blocks. It uses valves to be interacted with.",







  "wiki.ic2.preview.tank_storage_module.desc": "How about we turn your armor into a portable tank? That's what the Tank Storage Module is doing. Nothing fancy.",
  "wiki.ic2.preview.tea.desc": "Tea is for the people who want to chill out. It produces tea leaves which can make various types of tea. Most tea lovers dislike coffee. It requires a light level of 7 or greater to grow.",
  "wiki.ic2.preview.teleport_tube.desc": "The Teleport Tube. It sends/receives items to/from other desired Teleport Tubes. Logistic requests won't be sent through. Works across dimensions.",
  "wiki.ic2.preview.teleporter.desc": "The Teleporter is your long distance teleportation tool that requires a crazy amount of power. That's why it needs to stay next to power storages.",
  "wiki.ic2.preview.teleporter_hub.desc": "What if you combined a Teleporter and a Base Teleporter? Yes you get the Teleporter Hub! This is basically a \"pick your target\" Teleporter. Uses a lot of power!",
  "wiki.ic2.preview.terraformer.desc": "The world isn't how you want it? You want to change it? The Terraformer comes to the rescue. It has the ability to change the world. For thousands of EU/t.",
  "wiki.ic2.preview.terrawart.desc": "Terrawart is a really useful item. It can be easily obtained by putting a snow block below a netherwart. The snow block also boosts the growth by 50%. An eaten Terrawart removes all the bad potion effects from you.",
  "wiki.ic2.preview.tesla_coil.desc": "The Tesla Coil is a shocker! Literally. It builds up a charge and when any living thing is nearby it releases the charge to shock it to death. Useful for mob grinders.",
  "wiki.ic2.preview.text_card.desc": "The Text Card shows some text you can type in here. Also Tab is supported. (Will be converted into spaces).",
  "wiki.ic2.preview.tfbp.desc": "The Terraformer Blueprint decides how the terraformer works. It is an environment changing blueprint. These are really expensive.",
  "wiki.ic2.preview.tfbp_biome.desc": "The Terraformer Biome Blueprint decides how the terraformer works. It changes the biome you are in. These are also really expensive.",
  "wiki.ic2.preview.tfbp_biome_chilling.desc": "The Chilling Biome TFBP changes the biome to a Snowy Tundra biome.",
  "wiki.ic2.preview.tfbp_biome_cultivation.desc": "The Cultivation Biome TFBP changes the biome to a Plains biome.",
  "wiki.ic2.preview.tfbp_biome_desertification.desc": "The Desertification Biome TFBP changes the biome to a Desert biome.",
  "wiki.ic2.preview.tfbp_biome_forestification.desc": "The Forestification Biome TFBP changes the biome to a Forest biome",
  "wiki.ic2.preview.tfbp_biome_irrigation.desc": "The Irrigation Biome TFBP changes the biome to a Swamp biome",
  "wiki.ic2.preview.tfbp_biome_mushroom.desc": "The Mushroom Biome TFBP changes the biome to a Mushroom Fields biome",
  "wiki.ic2.preview.tfbp_biome_undergrowth.desc": "The Undergrowth Biome TFBP changes the biome to a Jungle biome",
  "wiki.ic2.preview.tfbp_chilling.desc": "The Chilling TFBP creates a winter wonder land.",
  "wiki.ic2.preview.tfbp_cultivation.desc": "The Cultivating TFBP turns your area into a plains field with crops and flowers growing.",
  "wiki.ic2.preview.tfbp_desertification.desc": "The Desertification TFBP turns the area into a desert.",
  "wiki.ic2.preview.tfbp_flatification.desc": "The Flatification TFBP flattens the area around itself to the terraformers y level. By either filling missing blocks in or removing blocks.",
  "wiki.ic2.preview.tfbp_irrigation.desc": "The Irrigation TFBP turns your area into a rain forest.",
  "wiki.ic2.preview.tfbp_mushroom.desc": "The Mushroom TFBP turns your area into a mushroom island. Including stacking mushrooms!",
  "wiki.ic2.preview.thermal_generator.desc": "The Thermal Generator is an upgraded Geothermal Generator. Producing 90EU/t, fuel lasts 50% longer. It also produces passive power based on the area's temperature.",
  "wiki.ic2.preview.thermometer.desc": "The Thermometer is your tool for reactors. It allows you to see how hot a reactor is at that moment. Which can be vital information.",
  "wiki.ic2.preview.time_card.desc": "The Time Card. It shows the Game time, Server time, your time and the Galaxy time... Wait not that one. But it shows time.",
  "wiki.ic2.preview.tin_cable_item.desc": "The Tin Cable. It is a really cheap but weak energy conductor. It can handle only 5EU but you are lossless for 40 Blocks. Ideal for solar farms or water mills!",
  "wiki.ic2.preview.tool_box.desc": "Toolboxes are your portable inventory for the tools/food that you don't use so often but still need. It comes in various sizes.",
  "wiki.ic2.preview.tools.aluminium": "Aluminium Tools",
  "wiki.ic2.preview.tools.aluminium.desc": "Aluminium Tools are right between Diamond and Iron. Less durability but faster, but deals less damage.",
  "wiki.ic2.preview.tools.bronze": "Bronze Tools",
  "wiki.ic2.preview.tools.bronze.desc": "Bronze Tools are slightly more durable then their iron counterpart. It is just another set of useful early game tools.",
  "wiki.ic2.preview.trade_o_mat.desc": "The Trade-O-Mat allows items to be traded for other items or coins. It requires a Personal Chest to be connected. Allows automated Trading.",
  "wiki.ic2.preview.transformer": "Transformer",
  "wiki.ic2.preview.transformer.desc": "The Transformer allows you to control packet energy that flows through the grid. 1 big packet turn into 4 smaller packets.",
  "wiki.ic2.preview.transformer_adjustable.desc": "The Adjustable Transformer is a fully customizable transformer. It can not be inverted but can produce up to 32 of any sized packets.",
  "wiki.ic2.preview.transport_tube.desc": "The Transport Tube only connects to other tubes. Inventories will be ignored.",
  "wiki.ic2.preview.tree_tap.desc": "The Treetap is your tool to extract sticky resin from rubbertrees. Just be careful not to overtap the trees.",
  "wiki.ic2.preview.treetap_and_bucket.desc": "The Treetap & Bucket is a very useful utility block that you can attach to rubbertrees in order to auto harvest them. They store 5 resin and speed up resin growth.",
  "wiki.ic2.preview.tube_coral.desc": "The Tube Coral is an underwater crop that can be used to grow coral blocks. It has a chance to produce all variants of tube corals. That is under the assumption its alive. It requires clean water (3 or more) to grow.",
  "wiki.ic2.preview.tube_tool.desc": "The TubeTool is your configurator of some tube features. These features expand the control over tube actions massively",
  "wiki.ic2.preview.upgrade.kit.pad": "Charge Pad Upgrade Kits",
  "wiki.ic2.preview.upgrade.kit.pad.desc": "Charge Pad Upgrade Kits allows to upgrade chargepads without replacing them.",
  "wiki.ic2.preview.upgrade.kit.storage": "Energy Storage Upgrade Kits",
  "wiki.ic2.preview.upgrade.kit.storage.desc": "Storage Upgrade Kits allow you to upgrade your previous energy storage to the new tier you desire.",
  "wiki.ic2.preview.upgrade_basic_fluid_export.desc": "The Simple Fluid Export Upgrade basically pushes out 100mB per tick out of a machine. Can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_basic_fluid_import.desc": "The Simple Fluid Import Upgrade basically pulls in 100mB per tick from a fluid tank. Can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_cobble_generator.desc": "The Cobblegen Upgrade produces cobblestone into the machine's input at 1 item per second. It is stackable.",
  "wiki.ic2.preview.upgrade_container.desc": "The Upgrade Container is basically an upgrade expansion. It has 3 upgrade slots that a machine can make use of. Though invalid upgrades are disabled.",
  "wiki.ic2.preview.upgrade_crafting.desc": "The Crafting Upgrade crafts items together and exports them into a connected inventory. Crafting speed is dynamic based on how fast the inventory provides the items.",
  "wiki.ic2.preview.upgrade_creative.desc": "Creative Upgrade is for Creative-use only. Provides Power/Tier/Speed Upgrade.",
  "wiki.ic2.preview.upgrade_durable_sawblade.desc": "The Durable Sawblade is a sawmill only upgrade. The machine gets +400% speed and outputs are increased by 2 items for the cost of +2EU/t",
  "wiki.ic2.preview.upgrade_efficiency.desc": "The Efficiency Upgrade makes machines much more efficient. Energy consumption is reduced by 5%. Multiple stacks are accepted in every machine.",
  "wiki.ic2.preview.upgrade_efficient_sawblade.desc": "The Efficient Sawblade is a sawmill-only upgrade. The machine gets a +200% speed and outputs are increased by 4 items for the cost of +1EU/t",
  "wiki.ic2.preview.upgrade_energy_storage.desc": "The Energy Storage Upgrade expands the internal buffer by +10000EU.",
  "wiki.ic2.preview.upgrade_energy_storage_multiplier.desc": "§The Energy Storage Multiplier upgrade doubles the current internal energy buffer.",
  "wiki.ic2.preview.upgrade_exp_collector.desc": "The Experience Collector Upgrade collects extra EXP out of machines. It has a cap of 5000XP storage and has a efficiency of 50% collecting it.",
  "wiki.ic2.preview.upgrade_export.desc": "The Export Upgrade is an advanced IO upgrade. It can be filtered and it uses EU to push out a lot more items at once",
  "wiki.ic2.preview.upgrade_field_upgrade": "Field Expansion Upgrade",
  "wiki.ic2.preview.upgrade_field_upgrade.desc": "The Field Expansion Upgrade enlarges the charging range of the chargepad.",
  "wiki.ic2.preview.upgrade_fluid_export.desc": "The Fluid Export Upgrade is an advanced IO upgrade. It can be filtered and uses EU to push out the 10x of its simpler variant.",
  "wiki.ic2.preview.upgrade_fluid_import.desc": "The Fluid Import Upgrade is an advanced IO upgrade. It can be filtered and uses EU to push out the 10x of its simpler variant.",
  "wiki.ic2.preview.upgrade_import.desc": "The Import Upgrade is an advanced IO upgrade. It can be filtered and it uses EU to pull in a lot more items at once",
  "wiki.ic2.preview.upgrade_loudness.desc": "The Loudness Upgrade makes a machine louder. If it is at max audio strength then it will be heard further away.",
  "wiki.ic2.preview.upgrade_muffler.desc": "The Muffler Upgrade makes a machine quieter. That way it can still be heard but less annoying.",
  "wiki.ic2.preview.upgrade_mute.desc": "The Mute Upgrade straight out disables the audio of a machine.",
  "wiki.ic2.preview.upgrade_overclocker.desc": "The Overclocker Upgrade makes a machine much faster than before. It provides a 30% speed boost for 60% more energy usage.",
  "wiki.ic2.preview.upgrade_quantum_overclocker.desc": "The Quantum Overclocker Upgrade is an endgame upgrade. It makes the machine 60% faster for 30% power usage increase.",
  "wiki.ic2.preview.upgrade_redstone_inverter.desc": "The Redstone Inverter Upgrade inverts the redstone requirements. If a strong signal is required then a low is now required.",
  "wiki.ic2.preview.upgrade_redstone_sensitivity.desc": "The redstone Sensitivity Upgrade toggles if the machine has any redstone requirements. Providing a lot more control.",
  "wiki.ic2.preview.upgrade_simple_export.desc": "Simple Export Upgrade pushes items slowly out of the machine. 1 Item per second/operation. This can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_simple_import.desc": "Simple Import Upgrade pulls items slowly into the machine. 1 Item per second/operation. This can be stacked up to 9 items.",
  "wiki.ic2.preview.upgrade_slowness.desc": "The Slowness upgrade is really underused upgrade. It halves the production speed of a machine and reduces power requirements by 40%",
  "wiki.ic2.preview.upgrade_transformer.desc": "The Transformer Upgrade levels up the machines maximum power tier it can accept.",
  "wiki.ic2.preview.uranium_enricher.desc": "The Uranium Enricher is a machine that combines Uran with exotic materials and 250EU/t to create very weird variants of Uran. These make life more interesting.",
  "wiki.ic2.preview.uranium_rod_blaze_single.desc": "The Blaze Uranium Rod. It produces an abnormal amount of heat. Useful for steam reactors.",
  "wiki.ic2.preview.uranium_rod_charcoal_single.desc": "Charcoal Uranium Rod. The long lasting but slow producing fuel. Really good for long lasting setups.",
  "wiki.ic2.preview.uranium_rod_ender_pearl_single.desc": "Ender Uranium Rod. It has a further reach on areas it can affect.",
  "wiki.ic2.preview.uranium_rod_isotopic.desc": "Isotopic Rods are rods that are ready to be re-enriched in the reactor.",
  "wiki.ic2.preview.uranium_rod_near_depleted.desc": "Near Depleted cells are a waste product of uranium rods. Can be relit to full uranium.",
  "wiki.ic2.preview.uranium_rod_nether_star_single.desc": "NetherStar Rod. Produce a ton of power and heat. Hard to master!",
  "wiki.ic2.preview.uranium_rod_re_enriched.desc": "Reenriched Uranium Rods are breed uranium that can be used used in the reactor.",
  "wiki.ic2.preview.uranium_rod_redstone_single.desc": "The Redstone Uranium Rod is very pulsing. Produces 2x the amount of isotopes. Runs slightly hotter.",
  "wiki.ic2.preview.uranium_rod_single.desc": "The very basic Uranium Rod. Produce the default amount of power. Nothing special.",
  "wiki.ic2.preview.uu_crop_library.desc": "The UU-Crop Library is an upgraded Crop Library that has the ability to create already known crop mutations from UU-Matter and energy. It is not cheap!",
  "wiki.ic2.preview.uu_expansion.desc": "The Matter Expansion allows you to make use of UU Matter more efficiently. It also provides resources that may not be craftable otherwise. 9 can be chosen from.",
  "wiki.ic2.preview.vacuum_canner.desc": "The Vacuum Canner is a high speed canner that creates a vacuum to package more resources and package them faster. It uses 16EU/t.",
  "wiki.ic2.preview.valve.desc": "A simple multipurpose valve that allows external interaction with the multiblocks tanks. Can be used with the Obscurator.",
  "wiki.ic2.preview.valve_animated.desc": "The Animated Valve is a small visual upgrade to the Valve. It shows the flow into a Tank and what flows in.",
  "wiki.ic2.preview.valve_pushing.desc": "The Pushing Valve is an upgrade to the normal valve where it automatically pumps out fluids. It can also work with the pipe grid.",
  "wiki.ic2.preview.valve_teleporting.desc": "The Teleporting Valve is a valve that links from 1 tank to another using a §<redirect;true;Link;ic2:preview.frequency_transmitter>. A wrench can set it to emit mode. Emitting 100mB/t of its content to another tank!",
  "wiki.ic2.preview.venomilia.desc": "The Venomilia is a tricky purple flower. If you harvest it too late, it turns poisonous and stings you when you walk through it or harvest it without crouching but it is a great source of Grin Powder. It is only poisonous and Grin Powder producing when almost fully grown.",
  "wiki.ic2.preview.villager_o_mat.desc": "The Villager-O-Mat is an Auto Trader that uses identity theft to trade as you! Sounds bad but its actually really good! It can bulk trade for you as you!",
  "wiki.ic2.preview.void_tube.desc": "The Void Tube. Void.... Void.... Void.... Yeah don't say \"that\" word too often. Anyhow. It deletes the incoming items by throwing them into the void. Void... Void... Void... Darnit!",
  "wiki.ic2.preview.warped_fungus.desc": "The Warped Fungus is your other nether wood producing mushroom. The crop produces the mushrooms and is required to be completely dry to grow.",
  "wiki.ic2.preview.water_mill.desc": "The Watermill is a passive/fuel generator. Producing a whooping 0.25EU/t (passive) or 1EU/t (active). It needs to be submerged under water to produce.",
  "wiki.ic2.preview.water_walker_module.desc": "The Water Walking Module lets you walk on water. Using electromagnetic fields to stabilize the fluid underneath you. I think at least...",
  "wiki.ic2.preview.wave_generator.desc": "The Wave Generator is a powerhouse of a Generator. Producing a fluctuating 16.5EU/t. But it requires 50 water blocks in a line.",
  "wiki.ic2.preview.weedex.desc": "Weed-ex is your safeguard against weeds. As long as crop has weed-ex, weeds cannot spawn. Though if it's applied more than once, chance is that stats will go down.",
  "wiki.ic2.preview.wet_cfoam.desc": "Wet Cfoam. Your entry drug into the CFoam Empire! It can be used to copy Textures, hide cable/tube/pipe blocks and be decorative! Dries over time or instant using Sand.",
  "wiki.ic2.preview.wheat.desc": "Wheat is your standard wheat that requires a light level of 9 or greater to grow. It also can produce seeds.",
  "wiki.ic2.preview.white_tulip.desc": "The White Tulip is part of the flower family. So flower conditions apply. It does not produce white dye but light gray dye instead.",
  "wiki.ic2.preview.wide_band_booster_pad_upgrade.desc": "The Wideband Upgrade makes the chargepad charge your entire hotbar instead of only the held item.",
  "wiki.ic2.preview.wind_turbine.desc": "The Wind Turbine is your atmospheric power producer. Creating up to 16EU/t, depending on air movement. It needs free space but doesn't care about height.",
  "wiki.ic2.preview.windmill.desc": "The Windmill is an advanced Wind Turbine. It requires rotors to run and produces up to 256EU/t. Though this depends on wind speed in the area.",
  "wiki.ic2.preview.wood_gassifier.desc": "The Wood Gassificator is a machine that burns fuel and logs into charcoal and woodgas for extra energy production in the Liquid Fuel Generator.",
  "wiki.ic2.preview.wrench.desc": "The Wrench is your tool to get rid of machines without losing them. But it is not perfect so it might still lose machines. Everyone loves that feature! Right?",
  "wiki.ic2.subpage.addons.body": "This page displays IC2Classic addons!\n\nThese were made by people who wanted to expand the IC2Classic mod",
  "wiki.ic2.subpage.addons.head": "IC2Classic Addons",
  "wiki.ic2.subpage.brewing.body": "So you have seen the brewing products and wonder how brewing works.\n\nBrewing is fairly simple, but it takes a lot of time.\nWhich is the whole point of this block. To eat time.\nWhich while boring allows you to do other projects in the meantime.§<newPage>§<header;Overview;true>\nTo create a barrel you simply craft one and place it on a wooden scaffold.\nAnd when your brew is done you just open it with a §<redirect;true;TreeTap;ic2:preview.tree_tap>.\nIt's that simple.\n\nThere are 4 brewing Modes:\n- Rum Brewing\n- Beer Brewing\n- Whisky Brewing\n- Potion Brewing§<newPage>§<header;Rum Brewing;true>\nBrewing Rum is one of the easiest one.\nJust throw in Sugar Cane and wait for it to finish and its ready to drink!\n\nIt's rather quick too, a few mins at max, compared to the other options.§<newPage>§<header;Beer Brewing;true>\nBrewing beer is rather simple,\nYou throw in Hops, Wheat and Water and wait a bunch.\nWhich you can throw 32 each of in.\n\n- The ratio between Hops and Wheat decide how strong the alcohol level is going to be,\n\n- While the ratio between Wheat and Water decides how Solid the drink is.\n- And water decides the yield.\n\nThe alcohol level decides the effects you get,\nwhile the duration is decided by the solid ratio,\nand the strength is decided by the brewing quality.\n\nThe best brew quality takes 8 hours.\nWhile after 10 days the brew turns bad.§<newPage>§<header;Whisky Brewing;true>\nWhisky is almost as easy as Rum Brewing.\nYou throw in Whisky Grist and Water and wait....\nFor a long time!\nEvery IRL day is worth 1.4 Years. So a week is worth 10 years.\nWhen taping the barrel the year count gets rounded down to the closest brew step.\nSo this one can not turn bad.§<newPage>§<header;Shaky Effect;true>\nDrinking Whisky causes you to get drunk.\nAnd what does that usually entail? \nWalking straight becomes impossible.\n\nThis is where the Shaky Effect comes into play.§<newPage>§<header;Shaky Effects;true>\nWhile it doesn't affect your movement, it instead affects your ability to be hit by projectil's.\nBasically shaking your body so much that \"Drunk Foo\" becomes a viable option.§<newPage>§<header;Potion Brewing;true>\nPotion Brewing is rather simple too.\n\nIt works like a normal potion stand, but instead of brewing 1 step at a time.\nYou use the ingredients to setup what you want to make and then let it bulk process all steps at once.\n\n\n\n\nSo for example for a Fire Resistance Potion you throw in:\nNetherwart, Magma Cream and Water\nThe water then starts the brewing.\n\nBeforehand you can throw in up to 20 redstone or glowstone.\n- §lRedstone§r: Increasing the duration of the potion. Up to 30 minutes.\n\n\n- §lGlowstone§r: Increasing the potency of the potion. Up to level 3.\n \nThough keep in mind potency cuts per extra level the duration in half. \n\nThe Quality of the brew decides how much of the duration/potency actually gets applied.§<newPage>§<header;Potion Brew Yields;true>\nThe best quality brew takes roughly 4 hours.\n\nThe biggest batch you can brew at once is 12 potions at once, or 120 tipped arrows.\n\nWhich will last long enough until the next brew is done.§<newPage>§<header;Potion Overbrewing;true>\nNote that after 20 hours of total brew time the potion turns bad and instead turns into a instant damage 4 cloud when you open the barrel.\nSo don't leave it unattended for to long.\n\nBut that covers Potions!",
  "wiki.ic2.subpage.brewing.head": "Brewing",
  "wiki.ic2.subpage.chunkloader.body": "The Chunkloader is simple to use, but requires power to run.\n\nIt comes with 4 different range Setting of:\n\n§l0§r:Local Chunk:5EU/t\n§l1§r:Local Chunk + 1 Chunk Radius:15EU/t\n§l2§r:Local Chunk + 2 Chunks Radius:60EU/t\n§l3§r:Local Chunk + 3 Chunks Radius:300EU/t",
  "wiki.ic2.subpage.chunkloader.body2": "The Chunkloader keeps all entities and tile-entities loaded within the area.\n\nThere is then the option to enable 'Chunk Ticks'.\n\nWhich will enable the random ticks within the chunks, so things like crops can grow.\nHowever the EU/t costs are doubled.",
  "wiki.ic2.subpage.chunkloader.head": "Chunkloader",
  "wiki.ic2.subpage.colossal_machine.body": "The Colossal Machine is a dynamic machine that can be build either as 2x2x2 or 3x3x3 or 4x4x4 structure.\n\nWith the master block being at the top left based on the face.\n\nEach upgrade doubles the capacity of slots of the previous one. It consumes 25mB of water per operation and produces steam as a waste product.",
  "wiki.ic2.subpage.colossal_machine.compressor": "Colossal Compressor",
  "wiki.ic2.subpage.colossal_machine.extractor": "Colossal Extractor",
  "wiki.ic2.subpage.colossal_machine.furnace": "Colossal Furnace",
  "wiki.ic2.subpage.colossal_machine.macerator": "Colossal Macerator",
  "wiki.ic2.subpage.colossal_machine.recycler": "Colossal Recycler",
  "wiki.ic2.subpage.crop.body": "IC2Classic comes with a crop system.\nYou can grow, crossbreed, and harvest crops as you wish.\n\nUnlike its vanilla part, IC2 crops do not rely on the random tick system of minecraft.\nBut they have a consistent tickrate.§<newPage>§<header;Crop Stat;true>\nCrops grow every 256 ticks (12.8s).\nBy how much is determined by a lot of factors and a tiny bit of randomness.\n\nIC2 Crops can also be placed underwater.\nThough some crops may or may not survive the underwater treatment.\nWhile others do not like the fresh air.§<newPage>§<header;Crop Stats;true>\nSo what stats do crops actually have? §<image;ic2:textures/wiki/crops/stats.png;33;20;78>\n§<padding;2>\n- §lGrowth§r: Increases Grow Rate\n- §lGain§r: Extra Yields\n- §lResistance§r: Increases Protection\n\nAll these 3 stats can go between 0-31, the higher the stats the more care the crops need.§<newPage>§<header;Stat Warning;true>\nYour main goal is to get stats higher, but keeping them below 24.\nIf you go above 24 to each stat there is a major downside that could ruin your crop field.\nAlso if the stats are to high and the care isn't enough crops could also die from starvation.\nSo if you breed higher stats watch out if the crop actually can grow without extra care.§<newPage>§<header;Growth Stat;true>\nThe §lGrowth Stat§r increases growth rate of the crop.\nMeaning that each crop tick the growth increases a lot more then without having this stat high.\n\nWhen the stat reaches level 24 the crop turns \"Weed Like\".\nWhile it will not self-destruct it will attack other crops that are not \"Weed Like\".§<newPage>§<header;Gain Stat;true>\nThe §lGain Stat§r increases Harvest Yields.\nThis can be massive when manual harvested where a few crops can give stacks of drops.\nAutomated Harvest will not gain such a massive yield increase but still increase yields substantially.\n\nWhen the stat reaches 24 or higher it will reduce the chance of extra seed bags.§<newPage>§<header;Resistance Stat;true>\nThe §lResistance Stat§r increases the strength against weed.\nAt level 31 it can no longer be taken over by weed.\n\nBut when the stat goes above 28 it reduces the chance of it partaking in crossbreeding.§<newPage>§<header;Crop Boosters;true>\nCrops are affected by the Environment §<image;ic2:textures/wiki/crops/environment.png;33;20;78>\n§<padding;2>\nThese 3 stats boost the crop growth rate massively and ensure it doesn't starve.\nEach biome provides a few boni/downsides depending from where you are.§<newPage>§<header;Crop Boosters;true>\nFor example the nether is horrible for Humidity, while the oceans do wonders for it.\n\nThe rule of thumb is the higher the better.§<newPage>§<header;Nutrients / Humidity;true>\nNutrients and Humidity are both affected by the Farmland / SubSoil below it.\nAnd can be each boosted with based on which biome they are in or with Fertilizer or Hydration.§<newPage>§<header;Environment;true>\nCrops also need a healthy Environment to grow faster.\nThere is 3 factors to increase Environment Quality.\n- §lSkylight Access§r\n- §lSpace§r: Having no solid blocks or Crops around itself.\n- §lHeight§r: Up to a certain point higher Altitudes help with the quality of the Environment.§<newPage>§<header;Underwater Environment;true>\nUnderwater crops also need a good Environment.\nWhich is a bit trickier to create.\nThere is a few ways to increase it.\n- §lClay§r: Having clay in the surrounding soil increases it slightly.\n- §lPurifying Crops§r: Some crops clean the water around itself.\n- §lBubble Columns§r: Provides a nice Environment.§<newPage>§<header;Crop Breeding;true>\nCropBreeding is the Heart of the Crop System.\n\nAnd it can be rather straight forward.\nPut 2-4 crops around the crop stick you want to breed on and place another set of cropsticks on it.\nYou can not guarantee that more then 2 crops are used in the breeding process but 2 are used at the very least.§<newPage>§<header;Crop Breeding;true>",
  "wiki.ic2.subpage.crop.breeding": "So how does breeding work? It is rather simple! Almost every combo can result into anything§<newPage>§<header;Crop Breeding;true>\nBut how is the result decided?\n\nIt is based on a point system.\nPoints are generated based on how many traits Crops share or how close the traits are in relation to each other.\nThe sum of these points is calculated together with all parent crops and then one is randomly picked from.\nWith 1 override though. If the parent crop is equal to the crop that could be picked it gets a flat 500 point buff.\nMaking it much more likely.\n\nThe §<redirect;true;Crop Analyzer;ic2:preview.crop_analyzer> can simulate examples and show potential results.\n\nOutside of that its random luck what is picked.§<newPage>§<header;Stat Breeding;true>\nNow whenever you bred a crop it will also change the stats.\nHow that is done also rather simple.\n\nIt takes the sum of the parent stats, each stat individually, and divides it by the parent count.\nThats your average stat.§<newPage>§<header;Stat Breeding;true>\nThen some fluctuation is added where randomly 2 stat points in either direction are applied, per parent present.\nSo you can lose or gain stats via crop breeding.§<newPage>§<header;Crop Copying;true>\nNow getting large amount of seeds is really difficult and annoying.\nSo you can copy crops rather simple too.\n\nBasically if the breeding stick has only 1 possible parent to breed with it will instead clone the parent crop.\nNo stat changes no crop changes a straight out clone.§<newPage>§<header;Weed Ex;true>\n§<redirect;true;Weed Ex;ic2:preview.weed_ex> is protecting your crops from getting destroyed by weed.\nBut with everything nice, over usage can hurt the crops. The stats specifically.\nSo rule of thumb is, only use it once or when the weedex is almost empty.§<newPage>§<header;Crop Analyzer;true>\nYou can scan crops by Sneak Clicking it with a §<redirect;true;Crop Analyzer;ic2:preview.crop_analyzer>\n\nIn General when having a Crop Analyzer in your hotbar a lot more information is shown in the One Probe for you!§<newPage>§<header;Farmland / Subsoil!;true>",
  "wiki.ic2.subpage.crop.head": "Crops",
  "wiki.ic2.subpage.crop.subsoil": "So what are farmland and Subsoils?§<newPage>§<header;Farmland / SubSoil;true>\nThe Farmland block is the block directly underneath the crop,\nwhile the SubSoil block is the 3 blocks directly underneath the Farmland.\nYou can search Via JEI after \"Farmland\" or \"SubSoil\" and find all the blocks that are considered as such.\n\nSome crops require special blocks.\nThese are 1 block below the SubSoil.",
  "wiki.ic2.subpage.crop_analyzer.body": "The Crop Analyzer is your mobile tool to analyze your crops.\n\nYou can either sneak click on a crop to scan it while it is planted or you can throw the item into its internal inventory to scan it.\nEach full scan takes 10.000 EU. This is done through multiple steps that unveil some of the data each.\n\nOn top of that the Crop Analyzer can be toggled into breeding mode which allows you to simulate crop breeding.\n\n\nAt the top of the GUI you select the crops you want to use and then click the Breed button.\nThe results of what potentially can come out will show up.\nSmall Caviat to add: Only 2 crops are fully accurate because you have no real control how many crops are included in a breeding result.\nSince it is random which crop is willing to breed.",
  "wiki.ic2.subpage.crop_analyzer.head": "Crop Analyzer",
  "wiki.ic2.subpage.crop_harvester.body": "The Crop Harvester is your way of automatically harvesting your IC2 crops.\n\nIt automatically picks crops when they are fully grown. Note that it will result into less products vs manual harvests.\nIts range can be between from 3x3x3 to 11x11x11 using Field Expansion upgrades. The machine is in the center of this cubic box.\n\nIt can be also upgraded using Overclockers to let it harvest crops a lot quicker.",
  "wiki.ic2.subpage.crop_harvester.head": "Crop Harvest",
  "wiki.ic2.subpage.crop_library.body": "The Crop Library is a significant upgrade to its simple counterpart.\n\nIt has a unlimited crop type and mutation storage but it requires EU to be accessed and modified.\nIt takes roughly 1EU passive drain to be able to see the crops and 5 EU to insert a anysize crop.\nLike the counterparts it only accepts fully analyzed seeds.\nThough its real downside is that all crops are lost if you break the library. So make sure to empty it before moving it.\n\nThat is the price for a unlimited storage",
  "wiki.ic2.subpage.crop_library.head": "Crop Library",
  "wiki.ic2.subpage.cropmatron.body": "The Cropmatron is the tool you want with your IC2 Crops.\n\nIt automates the applying hydration/fertilization/weed-exing of your crops.\nThough not as efficient in how much you get out of these items over time it is overall worth it.\nIts full coverage is 9x5x9 which it has to be in the center of.\n\nWater can be pumped into the Cropmatron to give 2 real upsides to the machine.\nFirst the Cropmatron becomes waterlogged and makes sure farmland stays wet for 1mB Water a tick.\nSecond is that Hydration cells are automatically refilled by it using the water in the Cropmatrons tank.",
  "wiki.ic2.subpage.cropmatron.head": "Cropmatron",
  "wiki.ic2.subpage.early_game.body": "So you finished your resource gathering trips, maybe even died like +10 times on the way,\nand feel ready to dive into the IC2 Mod.\n\nMaybe you even already crafted the stone machines to process your ores more efficiently.§<newPage>§<header;How to start?;true>\nA Typical dive into IC2Classic starts with the following things:\n- §<redirect;true;Generator;ic2:preview.generator> \n- §<redirect;true;Extractor;ic2:preview.extractor> \n- §<redirect;true;Macerator;ic2:preview.macerator> \n- §<redirect;true;Electric Furnace;ic2:preview.electric_furnace> \n- §<redirect;true;Cables;ic2:preview.copper_cable_item> \nA Ideal Setup could look like this:§<image;ic2:textures/wiki/early_setup.png;60;5;108>§<newPage>§<header;Ideal Setup;true>\nWhile that is the ideal setup, it isn't perfect.\nSince the generator doesn't preserve fuel efficiently,\na §<redirect;true;Batbox;ic2:preview.batbox> might be a good addition.\nAllowing for better fuel efficiency.§<image;ic2:textures/wiki/early_setup_storage.png;60;5;108>§<newPage>§<header;Ideal Setup;true>\nWith a Small Setup you can process your resources more efficiently.\nThe Macerator/Extractor cause more yield out of resources,\nwhile the Generator/Electric Furnace make the fuel more efficient.\n\nOn the next page you find a list of Shiny things you might be interested in.§<newPage>§<header;Shiny Targets!;true>",
  "wiki.ic2.subpage.early_game.head": "Early Game",
  "wiki.ic2.subpage.early_game.list": "This list contains targets where you could go to.§<newPage>§<header;Shiny Tools!;true>\n- The §<redirect;true;Wrench;ic2:preview.wrench> allows you to pick up machines without destorying them, most of the time.\n- The §<redirect;true;Mining Drill;ic2:preview.drill> gives you access to a infinite pickaxe, as long as you feed it power.\n- The §<redirect;true;Chainsaw;ic2:preview.chainsaw> is your weapon of choice?!!!!!\n- The §<redirect;true;Mowing Tool;ic2:preview.mowing_tool> gets rid of all these PESKY LEAVES!\n- And the §<redirect;true;Toolbox;ic2:preview.tool_box> is storing all your tools.",
  "wiki.ic2.subpage.electric_enchanter.body": "The Electric Enchanter is a fusion of the enchantment table, anvil, disenchanter, and the Power of EU!\n\nIt is the only way you can enchant the electric tools of EU.\nBut it is in general also a really powerful enchanter.\n\nThe Enchanter has a few modes.§<newPage>§<header;Enchanting Mode;true>\nThe Enchanting Mode is basically your normal enchantment table\nbut instead of randomly rolling, it shows you exactly what you would get\nand it uses EU to reduce the XP cost required.\n\nEnchanted tools can be rerolled with it too at a higher cost than normal enchanting.\nThe book slots at the top decide how many enchantments you get and how potent these enchantments are.\nIf there is enchanted books inside of these slots they will be prioritized and the rest will be applied afterwards.\nYou get 2 Enchantments per book slot. If there is enough enchantments to choose from.\nLapis is ofc also required.§<newPage>§<header;Anvil Mode;true>\nAnvil Mode is your classic anvil, just with a reduced XP cost and the ability to enchant Electric items.\nItems like the §<redirect;true;Mining Laser;ic2:preview.mining_laser> can be really useful since the enchants will work in the §<redirect;true;Miner;ic2:preview.miner> too.\nThough the mining laser itself won't work directly with enchants.§<newPage>§<header;Disenchant Mode;true>\nThe Disenchant Mode is really simple too.\nPut item to disenchant in the center slot.\nProvide books & XP\nWIN!\n\nand it takes the top enchantment of said item and move it into a dedicated book.",
  "wiki.ic2.subpage.electric_enchanter.head": "Electric Enchanter",
  "wiki.ic2.subpage.electricity.body": "IC2Classic has a form of electricity named EU. (Energy Units)\n\nEU is created in generators and moved over cables to machines you want to run. It's what powers the entire mod.\n\nEU is a very simple form of power, but it doesn't allow you to let your guard down.\nLets start with the generators.§<newPage>§<header;Generators;true>\nGenerators are fairly simple.\nThey use fuel and produce power.\nA normal generator for example produces 10EU/tick.\nThat power then gets automatically emitted as an energy packet.\n\nWhat is an energy packet?\nThat gets explained later.§<newPage>§<header;Electric Machines;true>\nElectric machines are things that use EU to do things.\nFor example the Macerator (Machine) uses energy to turn cobblestone into sand.\n\nA machine can accept energy depending on its tier.\nWith our Macerator example, it can accept 32EU per packet.§<newPage>§<header;Electric Machines;true>\nWhat happens if you put 40EU per packet into the Macerator?\nIt will §lEXPLODE§r.\n\nSo when working with machines, make sure how much power they can accept per packet.§<newPage>§<header;Energy Packets?;true>\n§<reset_header>\nOk so what is actually a energy packet?\nIt's fairly simple.\nIt is a box filled with power that you send using mail. Takes a while but it comes there eventually.\n\nOk jokes aside.\nYes you can think that an energy packet is a box, and the power itself determines how big said box is.\n\nSo machines can accept only boxes up to a certain size, but an infinite amount of boxes until it is full.\n\nNo the machine doesn't explode if it is full and you try to shove in more boxes of power.§<image;ic2:textures/wiki/packet.png;80>§<newPage>§<header;Cables;true>\nCables are your transport of these imaginary boxes of power.\nLike machines, they have a limit how much power they can transfer.\n\nCopper Cables for example have a transfer limit of 32EU/packet.\nBut they can transfer infinite amount of packets.\n\nThough since you are trying to push energy through metal, there is some loss for doing so.\nTo use our Copper example. It loses 0.2EU per block you try to push power through.\n\nTo make the game easier, the loss is rounded down. Meaning until you reach 1.0 you will not lose any power.\nMeaning you want to keep distances short, or account for it.\nNote that loss applies for each packet individually.\n\nAlso make sure you keep cables insulated, otherwise you might get a shocking experience if you go near them.§<newPage>§<header;Transformers;true>\nNow there is a blatant problem here.\nWhat if my power source is to high for my machine?\nDo I need to build a new one?\n\nThis is where transformers come into play.\nThey can take higher tier packets in and convert them into lower tier packets.§<newPage>§<header;Transformers;true>\n§<image;ic2:textures/wiki/transformer.png;50>\n§<padding;3>\nThis image shows 1x 128EU going in to the transformer and coming out as 4x 32EU packets.\nAllowing to downstep packets and securing the grid of weaker machines.§<newPage>§<header;Inverted Transformers;true>\n§<image;ic2:textures/wiki/inverse_transformer.png;50>\n§<padding;3>\nTransformers can also be inverted using a redstone Signal.\nDoing that inverts the \"inputs\" and \"outputs\".\nThis allows to compress energy packets and help to reduce Energy loss.§<newPage>§<header;EU-Reader;true>\nNow all this information is useful, but that information is all hidden and not visible.\n\nNow the §<redirect;true;EU-Reader;ic2:preview.eu_reader> changes that.\nHaving an EU-Reader in your hotbar enables tooltips on items that allow you to see the exact stats of said generators/cables/machines.§<newPage>§<header;Directional Power;true>\nMost of the power sources emit their power into all 6 directions.\nBut there are a few that are directional in their nature.§<image;ic2:textures/wiki/directional.png;45>§<newPage>§<header;Directional Power;true>\nThe rule of thumb is\n- A single point is an §lOutput§r\n- while no or 3 points are an §lInput§r\n\nSmall side note:\nThe colors on the dots indicate what the power would be on their side, based on the respective cables§<newPage>§<header;Grid Splitting;true>\nNow there is one more problem that you may or may not have run into.\nBut what happens if you need to pass by cables really closely to each other and do no want them to connect?\n\nYou have 2 solutions to that problem:\n- 1: Give up.\n- 2: Build bigger§<newPage>§<header;Painters;true>\nJokes aside. Option 1 is §<redirect;true;Painters;ic2:preview.painter> §<image;ic2:textures/wiki/color_blocking.png;45>\n§<padding;5>\nCables that are painted will not connect to other cables if they are differently colored.§<newPage>§<header;Mining Pipes;true>\nYour second option is mining pipes: §<image;ic2:textures/wiki/mining_blocking.png;45>\n§<padding;5>\nMining pipes can be placed on cables and act like anchors / plugs so cables won't connect to each other.\n\nExtra to that holding mining pipes show this sick overlay.",
  "wiki.ic2.subpage.electricity.head": "Electricity",
  "wiki.ic2.subpage.electrolyzer.body": "The Electroylzer is a machine that directly draws energy from power storages.\n\nWhile it needs to touch the power storage it doesn't need to connect to the output to function.\n\nIt consumes 1/4 of the energy storages output rate.§<newPage>§<header;Recipes;true>\nThe Electrolyzer has 2 recipe modes:\n- §lCharging§r: When the storage is 70% or more full.\n- §lDischarging§r: When the storage is 30% or less full.\n\nRecipes themselves can decide which modes do work on them.\nWhen a Recipe says \"Dual\" it means it works with both.",
  "wiki.ic2.subpage.electrolyzer.head": "Electrolyzer",
  "wiki.ic2.subpage.first_day.body": "IC2 Classic -  оновлена версія попередньої експериментальної версії IndustrialCraft 2 для Minecraft 1.4.7.  \nВона розширена додатковими покращеними машинами, паровим варіантом ядерного реактора, розширеними варіантами OD та OV Scanner, відведеними батарейними блоками та ядерним реактивним ранцем. IC2 Classic також сумісний з більшістю доповнень до IC2 Experimental. Збір ресурсів: Почніть, як і в будь-якій іншій грі, зі збору ресурсів.§<newPage>§<header;Руди;true>\n Вирушайте на гірничий похід і збирайте такі руди: Вугілля, Залізо, Мідь, Олово, Редстоун.§<newPage>§<header;Дослідження;true>\nВаша мета - знайти ці дерева: §<image;ic2:textures/wiki/rubber_tree.png;130>\nВони називаютсья §lГевеєю.§r\nВони можуть бути знайдені у: \n- Лісах\n- Болотах\n- Джунглях.\nSwamps are the source of them. \nBut like always, kindly get out of their swamp.\n\nOnce found, you want to collect their resin, and collect saplings for your home.§<newPage>§<header;Resin Collection;true>\nOnce you have some rubber trees you want to collect their resin with a Treetap.\n\nRubber trees have these resin spots that you can tap for resin.\nOnce tapped, by right clicking them with a Treetap, they will slowly re-grow.\nJust make sure not to overtap them otherwise the resin spot ceases to exist.§<newPage>§<header;Helpful items;true>",
  "wiki.ic2.subpage.first_day.head": "First Day",
  "wiki.ic2.subpage.first_day.list": "This item list shows you a few things you should go for,\nWhat things you can turn into and etc.",
  "wiki.ic2.subpage.fisher.body": "The Electric Fisher is your end game solution to getting loot,\n\nIt takes a lot of energy to keep it running, but the loot you get is a lot.\nIt is faster then 64 players would be combined with best loot.\n\nThe structure is fairly simple, just a small platform and chain downwards.\nThe length of the Chain decides how much extra luck you get.\n\nThe chain has to be at a minimum length of 5 blocks and a max range of 10.\n\nThe platform can be made out of any plank/log and the container above the fisher needs at least 20 slots to be valid.",
  "wiki.ic2.subpage.fisher.head": "Electric Fisher",
  "wiki.ic2.subpage.fourth_tier.body": "For the fourth tier you need Iridium\n\nIridium is created using UU-Matter, which is produced by a §<redirect;true;Massfabricator;ic2:preview.mass_fabricator>.\nTurning energy and optional other resources into UU.\n\nThe optional resources being \"Scrap\", which makes the process 7x less energy intensive.§<newPage>§<header;Shiny Dog Treat!;true>\nAnyhow at this point there is not much more you need.\nHere is your shiny list!\n\nPlease Go away!!!!",
  "wiki.ic2.subpage.fourth_tier.head": "Fourth Tier",
  "wiki.ic2.subpage.fuel_boiler.body": "The Fuel Boiler is one of the endgame generation producers.\nIt is a 2x2 multiblock build of this and its structure blocks.\n\nIt uses Fuelcans to boil water into steam. It produces 1024mB steam per tick.\nThis is done in a very efficient manner. It is 2x efficient as a normal generator with its fuel.\n\nThough this is only the case once it is heat up. The heatup phase takes 10x the fuel compared to when it is fully heat up.\nThis fuel efficiency can be massively improved on by effectively making use of the Fuel can which is a modular fuel source that can be pretty terrible or insanely good.\n\nThe top 4 blocks of this multiblock automatically output steam to directly connected tanks.\n\nUnlike its other mod counterparts, this one does not explode if you run out of water and refill it with that.",
  "wiki.ic2.subpage.fuel_boiler.head": "Fuel Boiler",
  "wiki.ic2.subpage.fusion_reactor.body": "Thermonuclear Reactor is a cubic 5x5x5 structure where the blocks are all reinforced variants. \n\nIt is also the answer to that burning question of...how much lava is enough lava?\n\nThe answer? There's no such thing as enough!§<newPage>§<header;The Structure;true>\nThe frame and the floor is made out of any reinforced stone,\nwhile the rest is made from any reinforced glass.\n\nValves can be inserted at an point in the structure.§<newPage>§<header;How to get it running;true>\nHow does the thermonuclear reactor work?\nThrow in up to 6 Uranium rods into it and a meltable block.\nDifferent Uranium types have their own production rates.\n\nBe warned the heatup cost is expensive, but once heated up it makes the fuel rather efficient.",
  "wiki.ic2.subpage.fusion_reactor.head": "Thermonuclear Reactor",
  "wiki.ic2.subpage.gui.body": "IC2Classic has a varied set of GUI Features that are ment to aid you in your playthrough.\n\nLets start with the 3 most common buttons.§<image;ic2:textures/wiki/gui/buttons.png;30;42;34.56>\n§<padding;5>\n- §lI§r: Inventory Settings\n- §lC§r: Comparator Settings\n- §lS§r: Slot Info\n\nThese settings are accessible to you in every machine that has a GUI.\nIt is the replacement for the \"Machine Tool\" that was present in previous iterations of the mod.\n\nAnd yes I am just padding out the text so the next info can be on a double page!\n\nYou will understand why I am doing that when you flip over!§<newPage>§<header;Inventory Settings;true>\n§<image;ic2:textures/wiki/gui/machine.png;74>\n§<padding;5>\nMachine access control allows you to set inventory settings for the entire machine / Slots\nBy default the machine settings are selected.§<newPage>§<header;The Controls;true>\n- §lBlue§r: The letters DUNSWE stands for each side you want to configure.\n- §lRed§r: These toggle buttons allow you to enable/disable if the side is accessible.\n- §lCyan§r: The 4 state buttons are allowing you to decide if a side is Both, Insert only, Export only or Disabled.\n- §lReset§r: Just resets to the default settings for the entire machine.\n- §lGreen§r: The 2 buttons are machine only settings that only some machines have a use for.\n   - §lLeft button§r: Allows only 1 item per type to be inserted into the visible inventory (for that specific side)\n   - §lRight button§r: Allows only 1 stack in size to be inserted into the visible inventory (for that specific side)\n  \n- §lInventory Slots§r: Allows to inventory upgrades to be inserted into, so you can filter what and how many items are allowed and what not.§<image;ic2:textures/wiki/gui/machine_selected.png;60;10;98>\n§<padding;5>\nAlso you can click on slots and make slot specific settings!§<newPage>§<header;Comparator Controls;true>\n§<image;ic2:textures/wiki/gui/comparator.png;74>\n§<padding;5>\nThe Comparator Settings allow you to modular design your Comparator output.§<newPage>§<header;Comparator Controls;true>\n- The §lBlue§r Section allows you to select which comparator out put you modify.\nV => Vanilla Comparator,\nwhile the rest is specific sides for the Advanced Comparator\n- The §lGreen§r section is the sources for the output you can select.\nShowing live what output they would provide.\n\n- The §lRed§r section is where your comparator output is being calculated.\nThe §lLeft Number§r is the value provided while the right number is what is going to be the actual output.\nThis is due to the 3 buttons, which are processed left to right.\n§lTorches§r invert the signal.§<newPage>§<header;Comparator Controls;true>\nwhile the §lRepeater§r signs it to either 0 or 15, when enabled.\nThe final output then is calculated based on what the \"Selector\" button says.\nBy default it will do §l\"Min\"§r but §l\"Max\"§r and §l\"Average\"§r are options. It will take all provided sources into account.\n\nSimply Click on sources to add/remove them.§<newPage>§<header;What goes into that slot?;true>\nOften you ask yourself, what goes into that machines slot?§<image;ic2:textures/wiki/gui/inventory_selected.png;74>\n§<padding;5>\nThe Slot Filter Info basically does exactly that!\nShows you what goes into each slot.\nSimply click on the §l\"S\"§r Button and click on any slot of the inventory you click on.\nAnd it shows you exactly what goes into it.\n\nIf the list is a bit long there is also a search bar!\nThank you for Daenara for suggesting that idea! §<newPage>§<header;Slot Filter Selector;true>\nThe Slot Filter Info also has other utilities.\nYou know how you have to have a item to set a filter?\nEven if that doesn't get consumed?\n\nI know exactly what you are thinking!\nAnd yes you are right!§<newPage>§<header;Slot Filter Selector;true>\n§<image;ic2:textures/wiki/gui/item_selector.png;74>\n§<padding;5>\nWhen a slot is a filter. You can simply click on that slot to select your filter.\nIt even checks what item is a valid input. So no guessing!§<newPage>§<header;Item Tooltips;true>\n§<image;ic2:textures/wiki/gui/tooltip.png;18>\n§<padding;5>\nItems have Keybinding tooltips that exactly tell you what to do.\nSometimes a Keybinding says only \"m\" like in this example.\nMost of the time that \"Key\" is combined with a \"Right Click action\", unless it is reasonable to understand that the right-click combo is impossible.\nLike with jetpacks.§<newPage>§<header;Item Inventories;true>\nOne last feature that people won't expect is.\nYou can open item inventories even from the inside of another block.\nAnd interact with it, without having to take out the item and use the right-click funtionality.\n\nThis was already done with some other mods, but it only worked with player inventories.§<newPage>§<header;Friends Gui;true>\nIC2Classic has a few personalized blocks.\nbut sometimes you are playing in a group.\nThat's where the Friends GUI comes into play.\n\nIt is opened with pressing:\n§<key;key.ic2.hud> + §<key;key.ic2.toggle> \n\nThen you can enable who is your friend and then select them and specify specific permissions as desired.",
  "wiki.ic2.subpage.gui.head": "Gui Essentials",
  "wiki.ic2.subpage.industrial_worktable.body": "The Industrial Worktable is a really powerful crafting bench,\ncombined with a solid storage solution; it outclasses other options out there.\n\nBut what the Industrial workbench isn't is an \"Automation Tool\".\nIt is designed to reduce crafting, by assisting you, not by automating it away.§<newPage>§<header;Industrial Worktable;true>\n§<image;ic2:textures/wiki/industrial_worktable.png;120>§<newPage>§<header;Recipe Memory;true>\nThe §lGreen§r is your recipe storage where the recipes are stored.\nBy default you gain 9 recipes but this can be expanded with §<redirect;true;Memory Sticks;ic2:preview.memory_stick>.§<newPage>§<header;Recipe Memory;true>\nRecipes can be added when you have a recipe stored in the crafting grid and hit the save button. Just click on the slot you want to save in.\nWhen you click on a recipe it will automatically load it into the recipe grid.\nMiddle-mouse clicking on a recipe will delete it.§<newPage>§<header;Memory Expansions;true>\nThe §lYellow§r section stores the memory sticks that expand the recipes.\nNote that recipes are stored in the memory sticks themselves, meaning they can be replaced as needed.§<newPage>§<header;Main Storage;true>\nThe §lRed§r area is your main storage where you store your items in. The restock button (hopper) will refill your items in after every craft. (It will remember the layout)§<newPage>§<header;Trash Storage;true>\nThe §lBlue§r are your trash slots where ingredients that come up during crafts and are not used are landed in. This area is ignored by the restock feature and is also prioritized by the crafting grid.§<newPage>§<header;NBT Setting;true>\nThe \"Paper\" Button is a \"per recipe\" button that indicates if a recipe has to search for exact NBT Data instead of any item that you are searching for.\nThis is to help recipes that have to have specific data to be provided to work, by default it is off due to most recipes not checking NBTData itself.§<newPage>§<header;Recursion Crafting;true>\nThe Workbench button enables recursive crafting. This is the setting that makes this worktable so powerful.\nIf you want to craft something but only you have its base components and not all ingredients required,\nthen this button allows you, when enabled, to automatically craft all sub ingredients for you.\nProvided it knows the recipes. (Recipe slots)\nThat means you can have very grindy recipes turn into a single click since it automatically finds out what to craft and does it for you\nand if it can not craft then it will automatically tell you where it was stuck.§<newPage>§<header;Recursion Crafting Limitations;true>\nOfcourse there is limitations with this system. Mainly due to performance reasons but also to make it not to overpowered.\n- You can only have 512 SubCrafts at once. Meaning if your recipe exceeds requires more then 512 crafts to make its ingredients it will say no.\n- You can only go up to 6 layers deep. \n\n(Workbench -> Planks -> Logs is 1 layer deep) Meaning you can only have so many ingredients to be created before it blocks you.\n- The resulting unused items have to fit into the trashslots. So make sure to keep them clean or to keep track of them.\n- All Ingredients or subrecipes have to be provided by the user.\nWhile these sound rather small these make sure that the table can stay reasonable with their performance and assist you with reducing crafting.§<newPage>§<header;Restock;true>\nThe Restock Button, The Hopper, enables that after every craft it will automatically refill the main storage with all the items it misses.\nWhile keeping the before craft layout and trying to preserve it.\nThis also works with expansions, where it automatically refills them if they want/need to be refilled.§<newPage>§<header;Request Network;true>\nSince tubes have a request system the Industrial Worktable has a request system too.\n2 in fact.\nThe hopper minecart button that simulates a craft and if that one is valid it will request all the missing items from the request grid.\nThe request tube button opens a subsection where the user can make his own requests.\nNote that the \"Request selector\" isn't aware what items are in the grid, so you can request anything and stuff that can be fulfilled will be.\n\nThis is due to mod engine limitations, and networking data reduction.§<newPage>§<header;Expansions;true>\nThe Industrial Workbench can have expansions, by default it can be 6, but this can be either 0-20 in the configs.\nThese expand the functionality of the workbench.\nAs long as an expansion is directly or indirectly connected to a workbench it can be added.\nAlso expansions can be shared between multiple worktables.",
  "wiki.ic2.subpage.industrial_worktable.head": "Industrial Worktable",
  "wiki.ic2.subpage.item_energy.body": "IC2Classic has a lot of electric tools and portable energy storages.\nAlso called batteries.\n\nThere are a few things to know about portable energy in general that is essential for a smooth play-through.§<newPage>§<header;Tools;true>\nHow would I recharge tools without going back to my generator block?\n\nThere are 2 ways:\n- §lArmor/Curio§r: Have a portable energy storage in either your armor or Curio (if installed) slots.\n   Tools will auto attempt to recharge the moment you use them.§<newPage>§<header;Tools;true>\n- §lItem§r: Right click a battery in your main hand.\n   The moment you right click a battery in your hand it will recharge everything in your hotbar with its own power.§<newPage>§<header;Energy Tiers;true>\nItems also have their own power tier. §<image;ic2:textures/wiki/energy_tier.png;40>\n§<padding;5>\nWhen you try to charge/discharge a battery/tool of any type, the charger/discharger must be equal or greater in its energy tier.\n\n\nFor example a §<redirect;true;Batbox;ic2:preview.batbox> can't charge a §<redirect;true;Energy Crystal;ic2:preview.energy_crystal>.\nBecause the Energy Crystal is tier 2 and the Batbox is Tier 1.§<newPage>§<header;Charing Benches;true>\n§<redirect;true;Charging Benches;ic2:preview.charging_bench_lv> and §<redirect;true;Battery Stations;ic2:preview.battery_station_lv> can override this.\nSince they are specialized blocks to deal with that sorta thing.",
  "wiki.ic2.subpage.item_energy.head": "Portable Energy",
  "wiki.ic2.subpage.liquid_generator.body": "The Liquid Generator mainly accepts 3 different Liquids.\n\n§lWoodgas§r\n4mb : 1 tick : 10EU/t \n\n§lBio-Fuel§r\n1mb : 2 ticks : 128EU/t \n\n§lAlcohol§r\n1mb : 24 ticks : 50EU/t \n\nWoodgas can be produced by a §<redirect;true;Wood Gasifier;ic2:preview.wood_gassifier>",
  "wiki.ic2.subpage.liquid_generator.head": "Liquid Fuel Generator Liquids",
  
  "wiki.ic2.subpage.miner.head": "Гірник",
  "wiki.ic2.subpage.miner.body": "Гірник - ваша ворота до напівавтоматичного видобутку.§<newPage>§<header;Гірник;true>\nВам закінчуються ресурси. Гірник - один з найефективніших способів збору ресурсів, який не потребує сил рабів у ваших шахтах!\n\nЧому він напівавтоматичний?\nГоловним чином тому, що він працює лише один раз і потребує ручного переміщення.§<newPage>§<header;Сканери для Гірника;true>\nГірнику потрібен §<redirect;true;Сканер;ic2:items.scanners>, щоб працювати.\nСканер визначає, як і на якій відстані працює Гірник, без нього він лише копатиме вниз.\n\nЗвичайний сканер просто спрямовується на потрібні руди та пропускає всі непотрібні речі, якщо вони не прямо на шляху.\nКар'єрний сканер спрямований на кожен окремий блок для великої ями.§<newPage>§<header;Бури;true>\nБур визначає, наскільки швидко і ефективно копає Гірник, а також який блок він може копати.\nФактично бур, навіть якщо §<redirect;true;Буріння лазером;ic2:preview.mining_laser> здається дивним.\nЯкщо бур відсутній, бурильна труба буде витягнута назад.\nТакож Фортуна/Шовковий Доторк використовуються, коли вони є на бурильній головці.§<newPage>§<header;Бурильні Труби;true>\nГірник потребує бурильних труб для прокладання шляху вниз у землю.\nФактично вони визначають, наскільки глибоко може проникнути Гірник.\nВи завжди можете поповнити запас бурильних труб, оскільки вони використовуються.\nТакож, коли бурильні труби витягуються назад, ви можете замінити їх іншим блоком, і вони будуть встановлені на його місце.§<newPage>§<header;Спеціальні Взаємодії;true>\nГірник може використовувати насос, якщо він підключений, щоб відкачати рідини, які в іншому випадку застрягли б Гірнику.\n\nГірник за замовчуванням виводить лише на боки, а не вгору/вниз.\nЦе можна налаштувати за допомогою управління доступом до інвентаря, воно перевіряє, чи є сторона експортною.§<newPage>§<header;Робоча Група;true>\nГірник сам по собі працює не так швидко. Розміщення кількох близько один до одного має недолік в тому, що вони будуть конкурувати між собою, що робити\nі фактично сповільнювати один одного.§<newPage>§<header;Як працює Робоча Група;true>\nТут на сцену виходить кнопка \"Робоча Група\".\nПісля того, як ви розмістили всі свої гірники, ви можете натиснути цю кнопку, щоб створити Робочу Групу.\nЦя Робоча Група шукає в радіусі 5 блоків всі гірники, які не знаходяться в Робочій Групі, і додає їх до списку.\nРоблячи той, в якому ви почали, Майстром Гірника.§<newPage>§<header;Що робить Робоча Група;true>\nКоли Гірник - помічник у Робочій Групі, він більше не потребує сканера,\nоскільки Майстер вирішує, які блоки копаються.\nКожен окремий Гірник має своє завдання, яке Робоча Група переконується, що немає конфліктів.\nЯкщо завдань недостатньо або гірники конфліктують між собою під час роботи, замість боротьби за блоки гірники допомагають один одному.\nЗбільшуючи Швидкість Копання цього конкретного блоку.\n\nХоча можуть виникнути неефективності. Це значно підвищує ефективність.§<newPage>§<header;Додаткові Знання про Робочі Групи;true>\nКожен Гірник все ще потребує Буру, Бурильних Труб та енергії.\nТакож Гірник, який нарешті руйнує блок, фактично створює Падіння, тому вам потрібно охопити всіх гірників відправленням предметів.\nНасоси також повинні бути налаштовані окремо, хоча тільки Майстер потребує його для відкачування рідин, кожен додатковий насос лише допомагає впоратися з рідинами.",
  "wiki.ic2.subpage.ocean_generator.body": "Океанський генератор перевіряє §lRadius§r §llof§r §l5§r §lBlocks§r в усіх напрямках.\n\nВін потребує щонайменше 26 сусідніх коралових блоків, щоб почати генерувати EU.\n\nКожен корал (понад 25) збільшує ефективність на 4%, а 10 Water мають виробництво 1EU/t",
  "wiki.ic2.subpage.ocean_generator.head": "Океанський Генератор",
  "wiki.ic2.subpage.overgrowth_fertilizer.head": "Добриво Переросту",
  "wiki.ic2.subpage.overgrowth_fertilizer.body": "Добриво переросту є небезпечним інструментом.\n\nВін надає високу винагороду при певному ризику.\nЗбільшує швидкість тиків врожаю у 256 разів протягом 5 хвилин.\nЦе має перевагу у тому, що культури ростуть у 256 разів швидше, але також Добриво, Ґербіциди та Гдратаційні елементи використовуються у 256 разів швидше.§<newPage>§<header;Обмеження;true>\nПісля закінчення 5 хвилин культура практично вмирає. Вона більше не відраховується.\nТак що, якщо у вас частково виросте врожай, бажаю вдачі, щоб витягти його.§<newPage>§<header;Відновлення;true>\nДобриво відновлення може бути використане для відновлення його до попередньої поведінки, але обидва можуть бути використані лише один раз на культурному стеблі.\nЯкщо ви хочете повторно застосувати його, вам потрібно розібрати і замінити культурні стебла.§<newPage>§<header;Попередження;true>\nОдним дійсно жорстоким недоліком цього є те, що якщо бур'ян коли-небудь вирішить розповсюдитися на інший культурний стеблина,\nвін також буде розповсюджувати переріст, що означає, що ви випускаєте пекло на свої ферми з культурами.§<newPage>§<header;Чому?;true>\nЧому б ви коли-небудь використовували це?\n\nУ контрольованому просторі може бути дуже корисним інструментом.\nселекція культур може займати години, щоб отримати одну культуру.\nЦе прискорює процес на ризик втрати того, що ви щойно отримали, або втрати культур, які ви використовуєте для селекція.§<newPage>§<header;Коментарі;true>\nТакож може бути використано для масового виробництва певних продуктів, які вам потрібні лише один раз і які ви не хочете довго чекати.\n\nТак що будьте попереджені, небезпечний інструмент.",
  "wiki.ic2.subpage.pressure_alloy_furnace.body": "Сплавна піч великого тиску - мультиблок, який використовує сплавну піч великого тиску та блоки її структури для утворення. Це структура розміром 2x2x2 з майстер-блоком у верхньому лівому куті згідно з його орієнтацією.",
  "wiki.ic2.subpage.pressure_alloy_furnace.head": "Сплавна піч великого тиску",
  "wiki.ic2.subpage.pump.body": "Помпа:\nЦе дійсно корисний блок, якщо вам потрібен стабільний джерело води, яке не випадково видаляється через надмірне використання. Помпа здатна перекачувати рідину лише безпосередньо під собою.\n\nДля масового очищення: будь ласка, перевірте ваш місцевий §<redirect;true;Дистанційна помпа;ic2:preview.ranged_pump>.§<newPage>§<header;Спеціальні Взаємодії з Помпою;true>",
  "wiki.ic2.subpage.pump.compressor": "Помпу можна використовувати безпосередньо з §<redirect;true;компресором;ic2:preview.compressor>.§<newPage>§<header;Компресор;true>\nВін бере воду з помп і перетворює її безпосередньо на сніжки!§<newPage>§<header;Гірник;true>\nЄ також особливі взаємодії з §<redirect;true;Гірником;ic2:preview.miner>,\nде вона допомагає Гірнику взаємодіяти з рідинами, коли вони з ними контактують.",
  "wiki.ic2.subpage.pump.head": "Помпи",
  "wiki.ic2.subpage.pump.interactions": "Взаємодія з помпою",
  "wiki.ic2.subpage.reactor.body": "Ядерний реактор - високотехнологічний та модульний генератор, який використовує компоненти реактора для вироблення електроенергії. Реактори є порожньою оболонкою, які потребують різних компонентів для правильної роботи.§<newPage>§<header;Фізика Реактору;true>\nРеактор оновлюється зліва направо, зверху вниз. Він також може вибухнути, якщо тепло перевищить максимально допустимий рівень після оновлення всіх компонентів.§<newPage>§<header;Компоненти;true>\nІснує кілька типів компонентів, таких як уранові стрижні, теплові вентилі, теплообмінники, покриття реактора, відбивачі, ізотопні стрижні, конденсатори. Компоненти можуть пошкодитися, якщо перегріваються.§<newPage>§<header;Uranium Rods;true>\nУранові стрижні генерують потужність, але також можуть викликати вибухи. Уран отримує бонус до ефективності, якщо торкається іншого уранового стрижня.§<newPage>§<header;Тепловідводи;true>\nТепловідводи охолоджують реактор, дозволяючи йому продовжувати роботу. Є різні варіанти, такі як тепловідводи, Stream Vents та електричні вентилятори.§<newPage>§<header;Теплообмінники;true>\nТеплообмінники регулюють тепловий баланс між компонентами реактора. Вони допомагають збалансувати тепло, щоб уникнути вибухів.§<newPage>§<header;Теплові балансири;true>\nТеплові балансири схожі на теплообмінники, але вони працюють як переливний балансир, регулюючи потік тепла.§<newPage>§<header;Охолоджувальна Капсула;true>\nОхолоджувальна капсула - буфер теплозберігання, яке можна заповнити або витягти тепло з нього.§<newPage>§<header;Plating;true>\nПокриття реактора збільшує максимальну тепловіддачу та зменшує його вибухонебезпечність.§<newPage>§<header;Ізотопні комірки;true>\nІзотопні комірки використовують тепло реактора та іони уранових стрижнів для самовідновлення, покращуючи ефективність реактора.§<newPage>§<header;Конденсатори;true>\nКонденсатори - метод грубої сили для охолодження реактора, використовуючи ресурси, такі як лазурит чи червоний камінь.§<newPage>§<header;Reactor Planner;true>\nЩоб уникнути вибухів, можна використовувати Reactor Planner для моделювання реакторів та перевірки їх безпеки перед будівництвом. Він надає додаткову статистику та забезпечує безпечний спосіб проектування реакторів.§<newPage>§<header;ПОПЕРЕДЖЕННЯ;true>\nВажливо враховувати, що реактор може вибухнути з будь-якої причини. Забезпечте велику кількість заходів безпеки та ретельно вивчайте попередження, перш ніж приступити до будівництва реактора.",
  "wiki.ic2.subpage.reactor.head": "Ядерний реактор",
  "wiki.ic2.subpage.rocket_miner.body": "Ракетний гірник є дуже універсальним інструментом, що дозволяє повністю автоматизувати збір ресурсів, але вимагає значної кількості налаштувань для його безперебійної роботи.\n\nУ графічному інтерфейсі є кілька слотів, які дозволяють включати різні оновлення/модулі. До них належать:\n- §<newPage>§<header;Компоненти;true>\n- §<redirect;true;Завантажувач чанків;ic2:preview. chunkloader>, що дозволяє працювати, навіть якщо гірник знаходиться за тисячі блоків від місця заправки, \n- §lГірнична труба§r §lсховище§r для дуже глибоких руд, \n- §lКапсули§r для роботи з рідинами, які інакше могли б зупинити гірник\n- §l: Генерація каміння§r §lпокращення§r для заповнення частини його безладу назад. §<newPage>§<header;Переробка;true>\nПотенційно, ви можете включити переробник для утилізації непотрібних блоків.\nЦе вирішує сканер. Це означає, що бруківка і бруд, наприклад, перетворюються на брухт/коробки.\nЦе робиться для того, щоб збільшити обсяг сховища для потрібних вам речей і зменшити кількість сміття.§<newPage>§<header;Накопичувачі енергії;true>\nЩе важливішим є Накопичувач енергії та слот для Дистанційного гірника. Перший дозволяє заряджати високовольтну батарею енергії і використовувати її під час роботи гірника.\nДругий §<redirect;true;Дистанційний гірник;ic2:preview.miner_remote> дозволяє гірнику знайти шлях додому, щоб дозаправитися. §<newPage>§<header;Refueling;true>\nПідзарядка є критично важливою частиною роботи Ракетний гірник, оскільки його енергетичного буфера вистачить лише на деякий час, після чого або внутрішній накопичувач заповниться і він більше не зможе ефективно працювати.\nКоли гірник або \n- §lA§r.) досягне певного порогу залишкової енергії, він полетить додому для підзарядки\n\n- §lB§r.) коли внутрішній накопичувач заповниться, він полетить додому, щоб віддати свої предмети. \nПовернувшись додому, він чекатиме на сигнал червоного каменя, щоб полетіти на роботу. Будьте обережні, ви ж не хочете, щоб він полетів назад до того, як буде готовий, тому намагайтеся уникати постійних сигналів червоного каменю на точці заправки.",
  "wiki.ic2.subpage.rocket_miner.head": "Ракетний гірник",
  "wiki.ic2.subpage.second_tier.body": "Ви досягли моменту, коли хочете перейти на наступний рівень.\n\nЩо вам насправді потрібно:\n\n- Енергетична система, яка може виробляти принаймні 50-80EU/т\n\n- Багато бруду/глини/теракоти§<newPage>§<header;Aluminium;true>\nВаша мета - виробляти алюміній (Alu) для просунутих механізмів. \n \nАлюмінієвий пил можна отримати за допомогою §<redirect;true;Рідкоземельного екстрактор;ic2:preview.rare_earth_extractor>. \nВикористовуючи Бруд/Глину/Теракоту,\n- §lБруд§r - найповільніший спосіб, але найлегший для отримання.\n- §lГлина/Теракота§r - найкращий спосіб, якщо можливо.§<newPage>§<header;Nether Aluminium;true>\nВи також можете знайти алюміній у Нідерландах, але він дуже добре захований,\nале якщо ви знайдете 1-2 штуки, то ви готові до середини гри. \nОтримавши алюмінієвий пил, ви переробляєте його у §<redirect;true;Alloy Smelter;ic2:preview.alloy_smelter> з піском.\n\nОсь де вам знадобиться енергія. Це енергоємна машина.\n\nПереконайтеся, що вона не висмокче вашу електромережу насухо!\n\n§<newPage>§<header;Machine List;true>",
  "wiki.ic2.subpage.second_tier.head": "Другий рівень",
  "wiki.ic2.subpage.second_tier.list": "Це машини/матеріали, які вам потрібні.\nТак, трохи сухувато, але розважайтеся, знаходячи блискучі речі самостійно!",
  "wiki.ic2.subpage.simple_crop_library.body": "Проста бібліотека культур - об'ємне рішення для зберігання насіння культур.\n\nХоча найобмеженіше рішення, воно не потребує живлення і скидає весь вміст при розбитті.\n\nВона зберігає 20 типів культур і кожен тип може мати 20 мутацій з 128 збереженими елементами.\n\nЩо призводить до загального обсягу зберігання 51,200 насінин культур, які вона потенційно може зберігати.\n\nЦе задовольнить вашу потребу у зберіганні насіння культур на початкових етапах гри. Це набагато краще, ніж подвійна скриня, і надає набагато більше інформації.\n\nЄдиним реальним недоліком є те, що насіння культур має бути проаналізоване для зберігання у бібліотеці.",
  "wiki.ic2.subpage.simple_crop_library.head": "Проста бібліотека культур",
  "wiki.ic2.subpage.steam_reactor.body": "Паровий реактор є покращенням ядерного реактора.\n\nХоча і за досить високу ціну.\nУ паровому реакторі змінюється кілька правил, які роблять його більш ризикованим, але й набагато цікавішим.§<newPage>§<header;Яка різниця?;true>\nПерш за все, тепло, яке виробляє уран, тепер є вашим виробничим потенціалом, а не електричною енергією.\nТепло має проходити через парові вентилятори, які використовують внутрішній резервуар реактора для перетворення тепла на пару. §<newPage>§<header;Парові вентилятори;true>\nПарові вентилятори тим ефективніше перетворюють тепло на пару, чим гарячіші вони є. Якщо вони не мають води або не можуть випускати пару, то вони миттєво припиняють охолодження. §<newPage>§<header;The Reward;true>\nІ остання, але масивна зміна - тактова частота реактора у 20 разів вища за звичайний реактор.\n\nЦе означає, що у вас дуже мало часу на виправлення помилок.\n\nВинагородою буде вища потенційна потужність.\n\nЯкщо ви зможете впоратися з теплом! На відміну від якогось Довахкіна0_0",
  "wiki.ic2.subpage.steam_reactor.head": "Паровий реактор",
  "wiki.ic2.subpage.steam_tunnel.body": "Паровий тунель - мультиблок, який виробляє EU з пари і здатний переробляти пару назад у воду.\n\nВін споживає до 4096mB за тик для виробництва 2048EU/т, у пакетах по 512EU. §<newPage>§<header;Structure;true>\nСтруктура є порожнистою 5x3x3 і §<redirect;true;Клапан;ic2:preview.valve> може використовуватися для заповнення/зливу пари/води.\nВін використовує блоки машинної структури і блок парового тунелю в центрі леза.",
  "wiki.ic2.subpage.steam_tunnel.head": "Паровий тунель",
  "wiki.ic2.subpage.tank.body": "Бак - повністю динамічний мультиблок, який можна побудувати від 3x3x3 до 50x200x50.\n\nВін може бути побудований з великою варіацією блоків.\n\nКожен повітряний блок коштує 16 відер.\n\n§<redirect;true;Клапан;ic2:preview.valve> може бути використаний у будь-якому не каркасному блоці для взаємодії з танком.\n\nСкляні блоки не допускаються у каркасі.\n\nОсь список допустимих блоків: ",
  "wiki.ic2.subpage.tank.head": "Бак",
  "wiki.ic2.subpage.teleporter.body": "Для зв'язування телепортів вам потрібен §<redirect;true;Передавач частоти;ic2:preview.frequency_transmitter> і використовуйте його на відповідних телепортах для зв'язування.",
  "wiki.ic2.subpage.teleporter.body2": "Телепортер здатний телепортувати багато речей, включно з сутностями, рідинами, предметами та ЄС.\n\nВін телепортує все, що знайде перед собою, якщо воно збігається з іншим телепортом.\n\nЯкщо перед ним є контейнер для зберігання (наприклад, скриня), він телепортує предмети до контейнера для зберігання іншого телепортатора. \nТе саме стосується рідин та ЄС з відповідним контейнером для рідини (бак) та контейнером для ЄС (наприклад, MFSU).\n\nЩо стосується об'єктів, то він телепортує будь-який об'єкт, який знаходиться перед ним, якщо на іншій стороні є місце.\n\nМайте на увазі, що затрати дуже високі, але робиться масово.",
  "wiki.ic2.subpage.teleporter.head": "Телепортер",
  "wiki.ic2.subpage.tesla_coil.body": "Як вже було сказано, Котушка Тесла дуже корисна для ферм мобів.\n\nКотушка Тесла має радіус 4 блоки і завдає однакової шкоди всім ушкоджуваним об'єктам в радіусі дії.\n\nВона розряджається кожні 32 тики(1. 6 секунд) і завдає 1 пошкодження за кожні 400 розряджених EU.\n\nВважається фальшивим гравцем, тому буде давати дроп \"Тільки для гравця\".\n\nЕлектрична броня захищає від смертельної дії високої напруги СМЕРТІ і може перетворити її в безкоштовну зарядку!",
  "wiki.ic2.subpage.tesla_coil.head": "Котушка Тесли",
  "wiki.ic2.subpage.thermal_gen.body": "Теплогенератор - більш ефективний геотермальний генератор.\n\nВін збільшує час роботи палива на 50% і виробляє на 50% більше енергії, а також має пасивне виробництво енергії.\nЦе залежить від блоків навколо нього, яке також може бути підсилене / ослаблене біомом, в якому він знаходиться.§<newPage>§<header;Теплогенератор;true>\nОсь приблизний список:\n- §lСхожий на лаву§r: 0.005EU/блок\n- §lВогонь / Розливаючася лава§r: 0.0015EU/блок\n- §lБлок магми§r: 0.0035EU/блок\n- §lОбсидіан§r: 0.0025EU/блок\n- §lКамінь / Металеві блоки§r: 0.001EU/блок\n- §lСхожий на воду§r: -0.0015EU/блок\n- §lБлоки снігу§r: -0.0025EU/блок\n- §lБлоки льоду§r: -0.005EU/блок\nУ найкращому випадку, всі блоки лави, призведе приблизно до 16EU пасивного виробництва.\nХоча в середньому ваша пасивна продукція становитиме близько 5EU в горах або близько 10EU в пеклі...",
  "wiki.ic2.subpage.thermal_gen.head": "Термогенератор",
  "wiki.ic2.subpage.third_tier.body": "Хей, нарешті ти дійшов до моменту, коли думаєш, що настав час перейти на наступний рівень.\n\nАле ти не впевнений, з чого почати.\nНе хвилюйся, ми підготували для тебе докладний план!\n\nОсь деякі вимоги, які ти повинен перевірити, перш ніж починати:§<newPage>§<header;ВИМОГИ!;true>\n- §lПотужність§r: Маєш щонайменше 300-500EU продукції енергії, стабільно. \nХоча не є обов'язковим, воно значно полегшує життя, оскільки зараз ми переходимо до етапу, коли дуже потрібна енергія.\n- §lРесурси§r: Переконайся, що у тебе є декілька стеків кварцу та рідкоземельних металів. Хоча їх не важко отримати, вони є необхідними.§<newPage>§<header;Як продовжити!;true>\nТепер, коли ти §mне§r переконався, що у тебе є все необхідне.\nОсь що тобі потрібно зробити:\n\n- Використовуй кварц і червоний камінь у §<redirect;true;Сплавний піч;ic2:preview.alloy_smleter>, щоб виробити Пульсуючий кварц§<newPage>§<header;Як продовжити!;true>\n- А рідкоземельні метали перетвори на магніти за допомогою §<redirect;true;Електролізер;ic2:preview.electrolyzer>\n\n\nЦі два ресурси дозволять тобі виробляти машини наступного рівня, які ти так прагнеш, щоб увійти в наступний рівень прогресу...\nДобре, я перестану вживати ці великі слова... перейдемо до БЛИСКУЧИХ речей!§<newPage>§<header;Блискучі речі!;true>",
  "wiki.ic2.subpage.third_tier.head": "Третій рівень",
  "wiki.ic2.subpage.third_tier.list": "На цей момент ви справді повинні знати, чого ви хочете.\nЩе дійсно необхідний посібник?!?!?!?!\nТАК ЗВИЧАЙНО! Правда?",
  "wiki.ic2.subpage.tube_tool.body": "Конфігуратор Труб - велике розширення системи труб.\n\nВін дозволяє реалізувати можливості, недоступні без нього, активуючи функції, які за замовчуванням вимкнені.\n\nОскільки функцій так багато, наведено список того, що воно може робити.",
  "wiki.ic2.subpage.tube_tool.head": "Конфігуратор Труб",
  "wiki.ic2.subpage.tubes.body": "Система Труб - досить проста, але ефективна система в IC2.\nАле на відміну від повністю автоматичних варіантів, які більше в дусі Minecraft.\n\nЄ купа варіантів, кожен з яких виконує свою специфічну функцію, і ваше завдання - використовувати їх так, щоб вони відповідали вашим потребам.§<newPage>§<header;Трубна сітка;true>\nЦе може бути легким завданням, якщо невелика система, але також може стати дуже складним, якщо ви намагаєтеся зробити щось велике/складне одразу.\nТак що пам'ятайте про це, коли ви використовуєте їх.\n\nЗагалом, система труб надає вам все необхідне для створення прийнятної системи автоматизації.§<newPage>§<header;Інструмент для труб;true>\nТакож переконайтеся, що ви перевірили §<redirect;true;Інструмент для труб;ic2:preview.tube_tool>.\nВін містить деякі додаткові функції для труб, які можуть бути включені за бажанням.\nТакі як керування червоним каменем, розширена з'єднуваність та кілька інших речей.§<newPage>§<header;Логістична сітка;true>\nСистема труб також поставляється з приєднаною логістичною системою для більш масштабного рішення автоматизації.\nАле на відміну від інших варіантів, вони не вирішують \"Маршрутизацію\", все, що вони роблять - надсилають та виконують запити, ви відповідальні за управління маршрутизацією!§<newPage>§<header;Базовий запит;true>\n§<image;ic2:textures/wiki/logistic_grid.png;45>\n§<padding;5>\nОсь найпростіший приклад того, як може виглядати логістична сітка!\nМає простий §<redirect;true;Запитова труба;ic2:preview.request_tube> справа та §<redirect;true;Постачальна труба;ic2:preview.provider_tube> зліва.§<newPage>§<header;Базовий запит;true>\nЗапитова труба автоматично надсилає запити через підключені труби до всіх постачальних труб.\nЯкщо є наявний запас, він буде відправлений!§<newPage>§<header;Маршрутизація;true>\n§<image;ic2:textures/wiki/logistic_crossing.png;75>\n§<padding;5>\nАле як ви вирішуєте перехрестя в такому сценарії.\nЗазвичай труби просто рандомізують, куди йдуть речі.\nТак що ця поточна установка просто не буде працювати.\nРішення?\nЄ 2 рішення для цього:\n- §<redirect;true;Труба з фільтром;ic2:preview.filter_tube>, що дозволяє фільтрувати напрямки на основі предметів.\n- §<redirect;true;Труба з кольоровим фільтром;ic2:preview.color_filter_tube>, яка дозволяє фільтрувати напрямки за кольорами.\n\nТак, запитники можуть бути встановлені з \"кольором запиту\", тому вам не потрібно налаштовувати фільтр для кожного потенційного предмета.§<newPage>§<header;Розподіл сітки;true>\n§<image;ic2:textures/wiki/logistic_splitting.png;75>\n§<padding;5>\nЯк ви вирішуєте сценарій, де ви хочете, щоб сітка ділилася, але запити були лише частково спільними для 2 сіток.\nУ цьому випадку ви хочете, щоб зелене/синє було доступним на іншій сітці, тоді як червоне залишалося розділеним.\nОскільки ви не можете фільтрувати червоний, щоб він йшов на праву сторону, оскільки запит надає лише колір, але не те, в яке місвін повинен потрапити.\n\nІ запити не цікавляться, чи може елемент пливти кудись, чи ні.§<newPage>§<header;Розподіл сітки;true>\nРішення насправді досить просте.\n§<redirect;true;Труба обмеження запитів;preview.limiter_tube> в основному блокує будь-які запити від проходження через нього.\nІ вам потрібно специфічно активувати колір, який ви хочете пропустити.\n\nЦе означає, що ви можете просто встановити його, щоб пропускати запити зеленого/синього, тоді як всі червоні запити залишаються в своїй місцевій сітці.§<newPage>§<header;Порівняння з BuildCraft;true>\nВеликий слон в кімнаті полягає в тому, що сильно натхнене BuildCraft.\n\nОсь деякі ключові відмінності:\n- §lВибух§r: Труби ніколи не вибухають, якщо ви кидаєте занадто багато предметів.\nАле як спосіб зменшення витрат на продуктивність/затримку, вони не обробляють більше 100 окремих стеків одночасно, що означає, що вони застрягають, поки не залишиться місце. Це значно економить сервери!\n\n\n- §lПродуктивність§r: Труби мають справу з оптимізацією. Хоча вони можуть спричиняти затримки на сервері, ви можете розмістити десятки тисяч їх і майже не відчути затримки від них.\n\n\n- §lГравітація§r: Гравітація існує. Це означає, що предмети, що рухаються вниз, розганяються, тоді як предмети, що рухаються вгору, сповільнюються швидше, ніж рухаються горизонтально. Існує мінімальна швидкість, однак.\n\n- §lТрубні проводи§r: Не існують.",
  "wiki.ic2.subpage.tubes.head": "Труби та Логістичні труби",
  "wiki.ic2.subpage.uu_crop_library.body": "Бібліотека культур UU(УП)-матерію кількість одиниць у стопці змінено на 1.\nІ зберігання такого насіння коштує 512 EU.\nМожливість бібліотеки культур UU(УП)-матерію полягає в клонуванні насіння. Використовуючи UU(УП)-матерію та EU.\nКлонування культури коштує кількість статистики, яку вона має, помножену на 10000 EU та 1 одиницю UU(УП)-матерію за кожен клонований предмет.\nВона може зберігати до 512 UU(УП)-матерію.",
  "wiki.ic2.subpage.uu_crop_library.head": "Бібліотека культур UU(УП)",
  "wiki.ic2.subpage.villager.body": "IC2C також додає деяких Селян у гру.\nЦих можна розблокувати за допомогою різних блоків професій.§<newPage>§<header;Електротехнік;true>\n§lБлок:§r §lЗалізна піч§r\nЦей електрифікований Селян - ваш постачальник компонентів, він продає схеми та кілька інших речей.\nМоже бути корисним, якщо у вас мало заліза!\nХоча я б уникав його, оскільки декілька Селян повідомили, що удари зробили його сум'ятим...§<newPage>§<header;Ядерний інженер;true>\n§lБлок:§r §lЯдерний реактор§r\nЦей якось зелено світяться Селян - ваш постачальник реакторів, який продає компоненти реактора та уран...\nЦе пояснює світіння... Я думаю.\nАле один зі способів отримати багато урану.§<newPage>§<header;Фермер культур;true>\n§lБлок:§r §lПроста бібліотека культур§r\nФальшивий фермер - ваш місцевий любитель культур. Нічого підозрілого в ньому.\nВін продає культури з поганими або прийнятними статистиками, або деякі предмети, пов'язані з культурами.§<newPage>§<header;Ви;true>\n§lБлок:§r §lДинаміт§r\nЦей вкритий пилом Селян - ваш інженер-вибухівник.\nПотрібно щось підривати? Він ваш чоловік!\nПродає всі види вибухових речовин та пошкодженого металу!\nТільки переконайтеся, що ніколи не залишаєте його самого з вибуховими речовинами у вашій базі!§<newPage>§<header;Майстер пивоваріння;true>\n§lБлок:§r §lБочка§r\nЦей п'яний Селян - ваш експерт з пивоваріння!\nПродає всі види пива та віскі.\nДуже приємна людина для розмови!§<newPage>§<header;Грег;true>\n§lБлок:§r §lПіксельна піна GregTech§r\nГрег - це... Грег. Він був настільки божевільним, що ми змусили його стати Селянином!\nВін також затвердив це... Ну, він лише сказав \"хммммммммммм\", але повинно бути згода...\nПравда! Правда???\nВін продає CFoam, інструменти та кілька інших речей.\nПросто будьте обережні. Деякі угоди занадто хороші, щоб бути правдою!§<newPage>§<header;Рецепти;true>",
  "wiki.ic2.subpage.villager.head": "Селяни",
  "wiki.ic2.subpage.villager.recipes": "Тут ви знайдете всі рецепти для створення необхідних блоків!",
  "wiki.ic2.subpage.villager_o_mat.body": "Селян-О-Мат - автоматичний торговець, який використовує крадіжку ідентичності, щоб торгувати від вашого імені!\n\nХоча на початку може звучати марно, але насправді він дуже корисний.\nОскільки ви зберігаєте всі корисні знижки, які торговець зробить з часом для вас.\nАбо, якщо ви їх збережете, знижки рятівника.§<newPage>§<header;Механіка для всієї родини!;true>\nДавайте ігнорувати той факт, що вас стимулювали створювати ситуації, коли Селян потрібно було рятувати!\n\n§lкхе§r §lкхе§r Де/Зомбіфікація для отримання знижок §lкхе§r §lкхе§r§<newPage>§<header;Інтерфейс користувача;true>\n§<image;ic2:textures/wiki/villager_o_mat.png;85>\n§<padding;2>\nІнтерфейс здається складним, але насправді він досить простий.\nСмуга у верхній частині - збережені очки досвіду, які автоматично збираються при здійсненні торгівлі.§<newPage>§<header;Інтерфейс користувача;true>\nСелектор Селяна відстежує всіх Селянів, яких він може знайти\nі дозволяє вам вибрати їх всіх.\nПри цьому відображаються смуги досвіду.\n\nСеляни, у яких немає смуг досвіду, - «Категорії» Селян, які дозволяють вам масово вибирати їх, щоб зменшити рутинну роботу.§<newPage>§<header;Вибір торгівлі;true>\nОсновний елемент - власне ваш вибір торгівлі.\nВи просто клікаєте на Торгівлю, щоб вимкнути/увімкнути її.\n\nРозділ Введення/Виведення в основному показує вам, звідки імпортуються предмети для торгівлі і куди експортуються результати торгівлі.\nНа вихід підтримує Труби, але не вхід.§<newPage>§<header;Як працює?;true>\nСелян-О-Мат - досить повільний пристрій.\nВін намагається здійснювати торгівлю лише раз на хвилину. Проте він спробує обробити кожну вибрану торгівлю одночасно.\nЯкщо була здійснена хоча б одна торгівля, він стягне з вас 6000EU за кожну вибрану торгівлю, ігноруючи, чи було здійснено торгівлю, чи ні.§<newPage>§<header;Як працює?;true>\nЦе звучить дуже дорого, але якщо у вас обрано 20 торгівель, що означає 6000EU, становить 100EU/т, що насправді споживається.\nЦе не так дорого.\nІ навіть не враховує того, що Селян може торгувати лише двічі на день.",
  "wiki.ic2.subpage.villager_o_mat.head": "Селян-О-Мат",
  "wiki.ic2.subpage.wrench.body": "§<redirect;true;Гайковерт;ic2:preview.wrench> є досить суперечливою механікою у IC2C.\n\nЦе ваш єдиний інструмент для зняття машин.\nУ старих версіях не було чітко окреслно, що він робить.\nУ цій версії було змінено на 3-х кольорове накладання на блок, що мають свої властивості. §<newPage>§<header;Синя;true>\n§<image;ic2:textures/wiki/wrench_blue.png;90>\n§<padding;5>\nСинє накладання призначене для зміни напрямку блоку.\nНапрямок встановлюється залежно від того, на яку частину блоку ви клацнете.\n- §lУ центрі§r: Встановлює напрямок до сторони, з якої ви клацнули. (Протилежний, при зажатому Shift)\n- §lЛівуроч§r: Задає напрямок ліворуч від натиснутого напрямку.\n- §lПраворуч§r: Задає напрямок праворуч від натиснутого напрямку.\n- §lНиз/Верх§r: Задає напрямок вниз/вгору від натиснутого напрямку: Встановлює напрямок вниз/вгору.\n\n\nОтже, якщо ви не натискаєте на центр, ви встановлюєте напрямок, виходячи з того, в який бік ви диветесь.§<newPage>§<header;Жовта;true>\n§<image;ic2:textures/wiki/wrench_yellow.png;90>\n§<padding;5>\nЖовте накладання призначене для спеціальних дій.\nНаприклад, видалення Гірничних труб з інших труб.§<newPage>§<header;Червоний;true>\n§<image;ic2:textures/wiki/wrench_red.png;110>\n§<padding;5>\nЧервоне накладання призначене для зняття машини. При знятті, сама сторона не має значення.§<newPage>§<header;Зняття;true>\n§<image;ic2:textures/wiki/wrench_loss.png;70>\n§<padding;5>\nПри знятті машини немає гарантії, що ви зможете її зняти не зламав. §<newPage>§<header;Якщо все таки зламали;true>\nЯкщо вам не пощастило, ви отримаєте Машинний блок відповідного рівня замість машини.\n\nОдин зі способів зменшити верогідність втрати - зачарувати свій ключ на Фортуну. Це дає 10% множник на кожен рівень.\n\nАле грубі рішення можуть завести вас лише до цього рівня!\n\nІнший спосіб - зробити §<redirect;true;Електричний Гайковерт;ic2:preview.electric_wrench>,\nякий має невтратний режим.\nЦей режим заднім числом гарантує, що машина не буде зламана, ціною її дуже обмеженого використання.\nТрохи пояснення: Ви перевантажуєте схему, щоб досягти ідеального результату, але ваша система може впоратися лише з таким навантаженням.\nПізніше ви можете оновитися, що дасть вам 100% верогідність не втратити машину. §<newPage>§<header;Суперечності;true>\nМеханіка втрат машин викликала суперечки, \nдеяким людям ця функція дуже не подобається. Настільки, що вони проходять повз 1.19.2 . \nЯ вніс кілька змін до цієї функції, оскільки вона мені подобається, щоб зробити її доступнішою.\n\nАле деяким людям все одно байдуже, і вони воліли б видалення цієї функції.\n\nЦитуючи TFS Android 16:\n§l\nВаша згода не є показником\n§r\n\nТому, якщо вам вона не подобаєьтся, тоді цей мод не для вас.",
  "wiki.ic2.subpage.wrench.head": "Гайковерт",
  "wiki.ic2.translated": "IsPlayer(PgmTags), Factor-OVF(Factoriador)",
  "wiki.ic2.translated_by": "Перекладено українською: "
}