{
  "wiki.ic2.category.addons": "IC2C Аддони",
  "wiki.ic2.category.armors": "Обладунки",
  "wiki.ic2.category.batteries": "Акумулятори",
  "wiki.ic2.category.block_misc": "Різні блоки",
  "wiki.ic2.category.blocks": "Блоки",
  "wiki.ic2.category.brewing": "Броварення",
  "wiki.ic2.category.cables": "Кабелі",
  "wiki.ic2.category.cfoam": "Будівельна Піна",
  "wiki.ic2.category.credits": "Розробники",
  "wiki.ic2.page.credits.head": "Розробники",
  "wiki.ic2.category.crops": "Культури",
  "wiki.ic2.category.early_game": "Початкова гра",
  "wiki.ic2.category.electric_blocks": "Електричні Блоки",
  "wiki.ic2.category.electric_tools": "Електроприлади",
  "wiki.ic2.category.electricity": "Електрика",
  "wiki.ic2.category.essentials": "Основне",
  "wiki.ic2.category.explosives": "Вибухівка",
  "wiki.ic2.category.first_day": "Що у перший День?",
  "wiki.ic2.category.fluid_blocks": "Рідинні Блоки",
  "wiki.ic2.category.fluids": "Рідини",
  "wiki.ic2.category.fourth_tier": "Четвертий Рівень",
  "wiki.ic2.category.second_tier": "Другий Рівень",
  "wiki.ic2.category.third_tier": "Третій Рівень",
  "wiki.ic2.category.general": "Загальне",
  "wiki.ic2.category.generators": "Генератори",
  "wiki.ic2.category.gui": "Інтерфейс",
  "wiki.ic2.category.item_energy": "Портативна енергія",
  "wiki.ic2.category.item_misc": "Різні Речі",
  "wiki.ic2.category.items": "Речі",
  "wiki.ic2.category.logistic": "Транспортна логістика",
  "wiki.ic2.category.machines": "Машини",
  "wiki.ic2.category.misc": "Різне",
  "wiki.ic2.category.misc_tutorials": "Різне",
  "wiki.ic2.category.monitor_cards": "Картки Моніторингу",
  "wiki.ic2.category.personal_blocks": "Персональні Блоки",
  "wiki.ic2.category.progression": "Прогресія",
  "wiki.ic2.category.reactor": "Компоненти Реактора",
  "wiki.ic2.category.reactors": "Реактори",
  "wiki.ic2.category.scanners": "Сканери",
  "wiki.ic2.category.tools": "Інструменти",
  "wiki.ic2.category.tubes": "Труби",
  "wiki.ic2.category.tutorials": "Підручники\n§l§4Інструкції для початківців!§r",
  "wiki.ic2.category.upgrades": "Покращення",
  "wiki.ic2.category.villager": "Селяни",
  "wiki.ic2.category.wrenches": "Гайковерти",
  "wiki.ic2.page.blocks.cables": "Кабелі",
  "wiki.ic2.page.blocks.cables.desc": "Кабелі - єдиний спосіб транспортування електроенергії на будь-які відстані.\n\nВони мають різні обмеження щодо того, скільки енергії вони можуть переносити та які втрати можуть мати.\nОбов'язково ізолюйте їх, інакше вони можуть вас вбити...§<newPage>§<header;Рекомендація;true>\nПереконайтеся, що ви переглянули §<redirect;true;Посібник з електроенергії;ic2:subpage.electricity>\nщоб розуміти, як працює!",
  "wiki.ic2.page.blocks.cfoam": "Будівельна піна",
  "wiki.ic2.page.blocks.cfoam.desc": "Будівельна піна - вхідний матеріал у світ будівництва.\n\nРекомендується бути обережним тут!\nБудьте обережні, бо не всі повертаються...§<newPage>§<header;Що таке?;true>\nВін може бути використаний для:\n- §lДекорування§r \n- Копіювання §lТекстури§r за допомогою §<redirect;true;Обскуратора;ic2:preview.obscurator> \n- §lПриховування§r блоків, таких як Труби/Кабелі/Трубки\n- §lСтворення§r §<redirect;true;Армованого каменя;ic2:preview.reinforced_stone>§<newPage>§<header;Як цим користуватися?;true>\nЗа замовчуванням ви виготовляєте §<redirect;true;Волога будівельна піна;ic2:preview.wet_cfoam> і кладете його. \nВін висохне самостійно, якщо достатньо світло, або може бути висушений за допомогою піску/бетонного порошку, якщо ви не хочете чекати.\nВикористання бетону автоматично дозволяє розфарбувати його. Хоча також можна зробити після факту за допомогою §<redirect;true;Валику;ic2:preview.painter>§<newPage>§<header;Піна у стисненому вигляді;true>\nЯкщо ви стискаєте його у Пеллет, ви отримуєте 13х піни, і потім її можна помістити у §<redirect;true;Розбризкувачі;ic2:preview.foam_sprayer>.\nБазовий варіант розпилює у напрямку погляду. \nМожна використовувати §<redirect;true;Електричний розбризкувач;ic2:preview.electric_sprayer>, щоб контролювати кількість розпиленого.\nХоча для цього потрібна Машина для Консервування для його заповнення. §<newPage>§<header;Затемнення;true>\nЯк тільки піна висохне, його можна Затемнити за допомогою §<redirect;true;Обскуратор;ic2:preview.obscurator>.\nСам Обскуратор може копіювати текстури, що означає, що ви можете використовувати його, щоб накладати майже будь-яку текстуру на піна, як ви бажаєте.\n\nХочете будинок з Блоків Діаманта, але не хочете марнувати діаманти?\nПоставте блок, затемніть його і розкладіть навколо безліч піни!\nХочете пожартувати з друзями, що RF працює з IC2?\nСкопіюйте Блоки RF Mods і вставте їх на Кабель IC2, а поруч поставте кабель!\nВони, повірте, злякуються. (Перевірено кілька разів)§<newPage>§<header;Примітки;true>\nЗверніть увагу, що Затемнення працює лише з наступними типами піни:\n- Повні блоки\n- Підлоги\n- Сходи\n- Стіни\n\nЧому? Тому що процес їх зроблення сумісними є дуже складним.\nОсобливо з їхнім функціоналом в них.",

  "wiki.ic2.page.blocks.electric_blocks": "Електричні Блоки", 
  "wiki.ic2.page.blocks.electric_blocks.desc": "Електричні блоки - ваші інструменти для забезпечення стабільності та складності вашої електричної мережі.\n\nЕлектричні сховища, трансформатори, зарядні пристрої, станції, ліхтарі - все, що ви можете побажати.\n\nЗвичайно вони поділені на рівні.",
  
  "wiki.ic2.page.blocks.explosives": "Вибухівка",
  "wiki.ic2.page.blocks.explosives.desc": "Вибухівка є частиною індустріалізації.\n\nТому IC2Cдодає кілька блоків, що стосуються цього.\nКрім того, IC2C зменшує опір кількох блоків вибуху, щоб зробити руйнування менш контрольованим.\nЦе не змінює ванільний грунт ні в якій формі, оскільки опір було зменшено лише для того, щоб зробити більш потужні вибухи насправді потужнішими.\n\nНаприклад: 6 блоків обсидіану було достатньо міцними, щоб утримати 1 ядерний вибух без будь-яких пошкоджень.\nТепер вам потрібно набагато більше.\nОбсидіан був зменшений з міцності 1200 до 60. (Ванільна версія робить 4)",
  
  "wiki.ic2.page.blocks.fluid_blocks": "Блоки Рідини",
  "wiki.ic2.page.blocks.fluid_blocks.desc": "У IC2C є багато блоків, які використовують або працюють з рідинами.\n\nодже виходить так що транспортування рідин - обов'язкова частина гри.\nПредставляємо вам систему труб для рідин.\n\nБільшість устаткування для активного видобутку рідин автоматично сумісна з цією системою.§<newPage>§<header;Труби;true>\nДля всього іншого у труб є графічний інтерфейс, де їх можна налаштовувати для самостійного видобутку рідини.\nТруби також мають «Систему пріоритетів», яка базується на принципі: менше число => вищий пріоритет.\nЗазначений графічний інтерфейс можна отримати, якщо є резервуар, і в руці немає жодного предмета.§<newPage>§<header;Фізика;true>\nТруби мають опір при покиданні рідин через них.\nЗалежно від сили джерела, ви можете йти лише до певної міри.\nРух по горизонталі споживає 1 силу, рух вниз нічого не потребує, а рух вгору споживає 2 сили.\nТакож мережа намагається розподілити рідину рівномірно, і тільки якщо є залишок рідини, вона буде робити речі з меншим пріоритетом.",

  "wiki.ic2.page.blocks.generator": "Генератори",
  "wiki.ic2.page.blocks.generator.category": "Наступні рівні генераторів, доступні вам в залежності від вашого прогресу\n- §<redirect;true;Генератори низької напруги (НН);ic2:blocks.generators.lv> \n- §<redirect;true;Генератори середньої напруги (СН);ic2:blocks.generators.mv> \n- §<redirect;true;Генератори високої напруги (ВН);ic2:blocks.generators.hv> \n- §<redirect;true;Компактні генератори;ic2:blocks.generators.compact> ",

  "wiki.ic2.page.blocks.generator.compact": "Компактні Генератори",
  "wiki.ic2.page.blocks.generator.compact.desc": "Компактні генератори - дивний концепт, створений за конкретною потребою\nу зменшенні затримок у світі, оскільки вони дійсно не оптимізовані.\n\nВ наши дні вже не є необхідним, оскільки ці генератори гіпероптимізовані,\nале вони все ще існують для збереження місця і просто для приколу.\n\nЩоб зробити менш ефективним, вам доводиться витрачати додаткові ресурси для досягнення звільнення пространства.",

  "wiki.ic2.page.blocks.generator.desc": "Вам потрібна енергія?\nУ нас буде енергія!\n\nНижче наведено рішення з генерації електроенергії в IC2C для всіх ваших потреб, від Низької напруги (НН) до Високої напруги (ВН).\nФормат енергії - 'EU/t', або Electrical Units/t. Якщо ви ще не переглядали навчальні матеріали, то вам варто зробити.\nБільше про EU пояснюється саме там.",
  "wiki.ic2.page.blocks.generator.hv": "Генератори Високої Напруги (ВН)",
  "wiki.ic2.page.blocks.generator.hv.desc": "ВН Генератори - ваши кінцеві виробники електроенергії.\n\nЦе вдосконалені форми існуючих джерел енергії, які роблять їх значно кращими,\n\nщоб компенсувати підвищені вимоги до електроенергії, які на вас надходитимуть на цьому етапі.\nКрім того, ці генератори не легко автоматизувати.\n\n\nВони або небезпечні, або мають спеціальні вимоги, такі як постійні втрати.",
  "wiki.ic2.page.blocks.generator.lv": "Генератори Низької Напруги (НН)",
  "wiki.ic2.page.blocks.generator.lv.desc": "НН Генератори - ваш доступ до електроенергії на ранньому етапі гри.\n\nЦі рішення є невеликими пасивними виробниками електроенергії, або споживачами ресурсів для виробництва електроенергії.\n\n\nЦе повинно допомогти вам на ранніх етапах гри, поки ви не перейдете до виробництва енергії на пізніших етапах гри.",
  "wiki.ic2.page.blocks.generator.mv": "Генератори Середньої Напруги (СН)",
  "wiki.ic2.page.blocks.generator.mv.desc": "СН Генератори - крок до надійного виробництва електроенергії.\n\nЦі генератори ефективніше використовують паливо та/або вимагають використання більш дорогого палива.\n\n\nВони повинні значно збільшити виробництво електроенергії.",

  "wiki.ic2.page.blocks.machines": "Машини",
  "wiki.ic2.page.blocks.machines.category": "Наступні рівні машин доступні вам в залежності від того, як ви прогресуєте в грі.\n\n- §<redirect;true;ПН Машини;ic2:blocks.machines.nv> \n- §<redirect;true;НН Машини;ic2:blocks.machines.lv> \n- §<redirect;true;СН Машини;ic2:blocks.machines.mv> \n- §<redirect;true;ВН Машини;ic2:blocks.machines.hv> \n- §<redirect;true;ЕН Машини;ic2:blocks.machines.ev> \n- §<redirect;true;АН Машини;ic2:blocks.machines.luv> \n- §<redirect;true;Промисловий верстак;ic2:blocks.machines.worktable> ",
  "wiki.ic2.page.blocks.machines.desc": "IC2C - мод, який додає механізмами.\nМайже усі блоки - механізми, розділені на шість рівнів за споживаною енергією EU/t.\nМашини ПН не потребують енергії, а лише палива.",

  "wiki.ic2.page.blocks.machines.ev": "Машини Екстремальної Напруги (ЕН)",
  "wiki.ic2.page.blocks.machines.ev.desc": "Машини екстремальної напруги - ваш шлях до кінцевої гри. Вони надають вам доступ до останнього рівня інструментів та машин, які вимагають великої потужності.\n\nДеякі можуть стверджувати, що не варто зусиль. АЛЕ всі знають, що груба сила - краща сила!\n\nЦей рівень приймає до екстремальної напруги (2048EU) і забезпечує останній набір універсальних машин.\nЦе Колосальні Машини.\n\nКолосальні Машини - динамічні багатоблочні структури, які обробляють кілька предметів одночасно, але вимагають більше простору та енергії\nпроте ефективніше за своїх аналогів.",
  "wiki.ic2.page.blocks.machines.hv": "Машини Високої Напруги (ВН)",
  "wiki.ic2.page.blocks.machines.hv.desc": "Машини високої напруги - ваш крок до фінального етапу гри.\n\nМашини стають більш вдосконаленими і більше вимагають енергії.\n\nЯкщо на цей момент ваша енергетична інфраструктура вже ледь вистачає, щоб встигнути з споживанням,\nто зараз саме час розширити її. Більшість машин на цьому етапі приймають Високу Напругу (512EU) та мають менше ймовірності випадіння при звичайному гаечному ключі.\n\nХоча невелика ціна за доступ до вдосконалених інструментів.",
  "wiki.ic2.page.blocks.machines.luv": "Машини Абсурдної Напруги (АН)",
  "wiki.ic2.page.blocks.machines.luv.desc": "Машини абсурдної напруги - завершення гри.\n\nНемає більше, що можна розблокувати після цього рівня прогресу!\nЦі машини працюють при абсурдній напрузі (32765 EU).\n\nЙмовірність випадіння за допомогою гаечного ключа становить 55%. Цього не достатньо для випадіння АН,тому рекомендується зробити абсолютно невтратний прецезійний гайковерт",
  "wiki.ic2.page.blocks.machines.lv": "Машини Низької Напруги (НН)",
  "wiki.ic2.page.blocks.machines.lv.desc": "Машини низької напруги - початковий етап електричної обробки ресурсів.\n\nЦі машини приймають до 32 EU.\nЯкщо машину видаляють без гайкового ключа, вона втрачається назавжди.\n\nЗа замовчуванням ймовірність не втратити машину із гайковим ключем становить 80%.\nЦе може змінюватися в залежності від самого гайкового ключа.\n\nПрактично кожна машина НН приймає модифікації.",
  "wiki.ic2.page.blocks.machines.mv": "Машини Середньої Напруги (СН)",
  "wiki.ic2.page.blocks.machines.mv.desc": "Машини середньої напруги - початок середньої гри в IC2C.\n\nВони надають вам багато нових корисних інструментів та машин, з якими ви тепер можете грати.\n\nБагато цих машин працюють при середній напрузі (128EU) і, загалом, працюють швидше, ніж їхні аналоги НН.\nЦе коштує менше можливостей модифікацій і, звісно ж, трошки більше витрат ресурсів/енергії,\nабо потребує активного живлення машин в режимі очікування.\n\nРежим очікування - пасивна витрата, яка споживає 1EU/t і потребує сигналу червоного каменю для підтримання повної швидкості.",
  "wiki.ic2.page.blocks.machines.nv": "Примитивні Машини (ПН)",
  "wiki.ic2.page.blocks.machines.nv.desc": "Примітивні машини, які не використовують електрику, є дуже ранніми машинами, до яких ви маєте доступ у грі.\n\nВони використовують спалювальні палива, такі як дерево та вугілля, для своєї роботи.\n\nХоча вони надто неефективні за витратами палива, вони надають багато бонусів і можуть легко використовуватися на льоту.",
  "wiki.ic2.page.blocks.machines.worktable": "Промисловий верстат",
  "wiki.ic2.page.blocks.machines.worktable.desc": "Промисловий верстат - неймовірно потужний інструмент для виготовлення.\n\nФактично, він настільки потужний, що потребує власного розділу.\n\nЦей розділ охоплює сам промисловий верстат та всі розширення.§<newPage>Зверніть увагу, що всі розширення вимагають промислового верстату для роботи.\nІ якщо вони прямо або непрямо торкнуться його, їх буде виявлено.\n\nТакож розширення можна використовувати на кількох верстатах.",
  "wiki.ic2.page.blocks.misc": "Різні Блоки",
  "wiki.ic2.page.blocks.misc.desc": "Це блоки, які не підходять під жодну конкретну категорію або є Декорацією.",
  "wiki.ic2.page.blocks.personal_blocks": "Персональні Блоки!",
  "wiki.ic2.page.blocks.personal_blocks.desc": "Іноді ви хочете зберегти предмети від того, щоб інші люди їх чіпали;\n\nОсобисті блоки є особистими!\nТільки ви вирішуєте, хто може мати до них доступ.\n\nТакож є особисті Торгові Блоки.\nВони дозволяють за бажанням користувачам торгувати предметами/рідинами/блоками.§<newPage>§<header;Додаткове про Трейд-О-Мат;true>\nНевелика додаткова інформація.\nЯкщо ви натискатимете клавішу §<key;key.ic2.inv> при відкритті Торгових блоків, ви можете переглядати вид покупця та випробовувати різні можливості.",
  "wiki.ic2.page.blocks.tubes": "Труби",
  "wiki.ic2.page.blocks.tubes.desc": "Труби - один із способів автоматизації транспортування предметів.\n\nЦі труби є дуже простими і не можуть виконати багато функцій.\nАле всі базові компоненти для створення складної системи присутні.\n\nОтже, як вони працюють? Предмети просто протікають через них і рухаються випадковими напрямками, але не в тому напрямку, з якого прийшли.\nЯкщо у трубі занадто багато предметів, труба просто не оброблятиме їх, щоб уникнути зависання гри.\n\nЄ Логістичні труби, які допомагають вам автоматизувати складніші проблеми, але ВОНИ НЕ автоматизують маршрутизацію.\n\nТак, автоматичної маршрутизації немає, але не бійтеся, система труб має все необхідне для власної автоматизації маршрутизації.\nТільки переконайтеся, що не перегрієте свій мозок.\n\nЯ не жартував.\n\nТакож для додаткової функціональності був доданий Конфігуратор труб, щоб надати більше контролю над речами.",
  "wiki.ic2.page.crops": "Культури",
  "wiki.ic2.page.crops.boni": "Ефекти навколишнього середовища на культури",
  "wiki.ic2.page.crops.breeding": "Селекція культур",
  "wiki.ic2.page.crops.boni.desc": "Тепер ви знаєте статистику і те, що вона робить, але як щодо бафів навколишнього середовища?\n\nВони наступні: Поживні речовини, Вологість, Якість навколишнього середовища.\n\nНа поживні речовини та вологість можуть впливати блоки під ним.\nБлок безпосередньо під ним - \"Сільськогосподарські угіддя\",\nа 3 блоки після них - \"Підґрунтя\".\nЗагалом, підґрунтя має менший вплив на блок, ніж сільськогосподарські угіддя. §<Поживні речовини:\r\nДеякі біоми можуть мати вплив на цей показник, який можна з'ясувати, застосувавши трохи здорового глузду.\nЦей показник можна вирівняти за допомогою добрив.\nЦей показник можна вирівняти за допомогою клітин зволоження.\nДля перезволожених культур цей показник автоматично збільшується до максимуму. І в більшості випадків не є важливим фактором.§<newPage>§lЯкість середовища перезволожена:§r\n\nКоли культура перезволожена, біом дає базове значення якості води на основі її ознак. \nЗа кожен стовпчик бульбашок або глини у сітці 3х3 ви отримуєте 1 очко.\nЗа кожну очищувальну культуру (морські водорості/водорості) у сітці 3х3 ви також отримуєте 1 очко.\nЗа кожен блок, який не є водою/мокрою губкою або повітрям, ви втрачаєте 1 очко. \nЦе варіюється від 0 до 10 очок якості навколишнього середовища.§<newPage>§lЯкість навколишнього середовища не заболокована:§r\n\nЗа кожні 15 блоків вище y-64 ви отримуєте 1 очко (обмеження на 5)\nЯкщо культура може бачити небо, ви отримуєте 2 очки.\nА за кожен повітряний/нетвердий блок, який не є культурою в сітці 3х3, ви отримуєте пів-очка.\nЦе варіюється від 0 до 10 очок якості навколишнього середовища.",
  "wiki.ic2.page.crops.breeding.desc": "Тепер, як працює селекція?\n\n Селекція - це важливий процес для створення нових і поліпшених культур. Для перехрещування вам потрібен порожній блок культури, оточений набором культур (до 4 штук). Покладіть ще один блок культури на порожній блок. Культура підключиться до всіх безпосередньо прилеглих культур і спробує перехрестити їх. \n\nПід час кожного тику, культура, що схрещується, запитує бажання схрещуватися з іншими культурами, і культури дещо випадковим чином або погоджуються, або не погоджуються на селекцію. Цей процесс можна прискорити або призупільнити за допомогою статистики культур.\nЗа кожен такт зростання перехрещувана культура запитує інші культури про бажання перехреститися, і вони випадково можуть погодитися або відмовити. \n\nЯкщо 2 або більше культур погоджуються перехреститися, в новому місці з’явиться нова культура. Ви не бачите, які саме культури беруть участь, у вас є лише 2 палички.\n\nРезультат обчислюється на основі напіввипадкового шансу. Враховуються статистика, атрибути та рівні культур. \n\nСпочатку оцінюються всі потенційні культури, які можуть рости на цій ділянці (за винятком бур'янів), і обчислюється значення балів для кожної культури.\n\nЦе обчислюється у кілька кроків.\n\nЯкщо культура з розсадника збігається з культурою зі списку, то вона отримує 500 балів. Більше ніяких обчислень.\n\nІнакше програма почне порівнювати культури.\n\nПерше, що вона порівнює - це статистику (Хімія, Витратні матеріали, Захист, Кольоровість, Бур'яни) культур: якщо порівнювані показники однакові, ви отримуєте 2 очки, якщо є різниця в 1 очко, ви отримуєте 1 очко, різниця в 2 очки ігнорується, а будь-яка більша різниця дає -1 очко\nПісля цього вона порівнює атрибути 2 культур. За кожний збіг атрибутів обох культур ви отримуєте 5 балів.\n\nДалі порівнюються яруси культур:\n\nЯкщо ярус селекційної культури менший за 1 бал, ви втрачаєте 2 бали різниці між ярусами.\n\nТакож якщо селекційна культура більша за 3 яруси, то можлива культура втрачає різницю між ярусами в балах.\n\nНасамкінець програма переконується, що ви не отримаєте менше 0 балів за культуру, і додає їх до балів за цю культуру. \nПісля того, як оцінювання завершено, програма об'єднує всі потенційні бали разом і бере випадкове число між 0 і всіма об'єднаними балами культури.\nТоді вона переглядає кожен дійсний результат і перевіряє, чи бали більші за випадково вибране значення.\nЯкщо так, то це ваш результат.\nЯкщо ні, то вона витрачає бали цього конкретного результату і перевіряє наступну культуру. Повторюємо і т.д.",
  "wiki.ic2.page.crops.desc": "IC2C додає дуже унікальну систему культур до гри. Дехто полюбляє її, а дехто ненавидить.\n\nЯкщо хтось пам'ятає мод Forestry, то вам може бути цікаво дізнатися, що його механіка розведення бджіл була натхненною IC2C.§<newPage>§<header;культури;true>\nкультури надають багато різних ресурсів.\nВи можете вирощувати:\n- Дерево\n- Руди\n- Їжу\n- Фарбники\n- КАЛАМАРІВ!\n\nОбов'язково перегляньте §<redirect;true;Посібник;ic2:підсторінка.культур>§<newPage>§<header;Посадження;true>\nДеякі культури можна посадити безпосередньо, тоді як інші потребують розведення.\nХоча, якщо ви пожнете культуру, ви отримаєте сумку з насінням для її повторного посадеження. Хоча не завжди гарантовано.\nПовнорослі культури мають найвищий шанс випадіння мішочек з насінням.\n\nЦей Вікі покаже вам, чи можна посадити культуру за допомогою предмета чи шляхом розведення.§<newPage>",
  "wiki.ic2.page.crops.helper": "Помічник у розведенні культур",
  "wiki.ic2.page.crops.helper.desc": "Тепер, коли цей великий потік інформації закінчився, сподіваюся, що ваша голова ще не димиться.\n\nТепер ви можете обчислити вручну і сподіватися, що ваші розрахунки точні.\nАле, на щастя, вам не потрібно цього робити.\n\nАналізатор культур має режим розведення культур, який може симулювати весь процес і показати вам кожний шанс для кожної комбінації.\nВін не показує вам ідеальні рішення, але дозволяє експериментувати і знаходити найкращі результати для вашої поточної ситуації.\n\nВам не потрібно володіти жодною культурою, щоб випробувати його. Він має творчий запас усіх культур.\nНі, ви не можете витягти ці культури з його інвентаря.\n\nІ охоплює розділ про культури.",
  "wiki.ic2.page.crops.stats": "Статистика культур",
  "wiki.ic2.page.crops.stats.desc": "Отже, у культур є характеристики, які мають свої переваги та недоліки.\nДіапазон кожної характеристики від 0 до 31.\n\nХоча вищі показники можуть призвести до серйозного підвищення, але є й недоліки, і вони стають величезними при значеннях 24 або вище.§<newPage>§lЗростання:§r\nЗбільшує швидкість росту на певну величину та підвищує шанси на селекція.\nПри значенні 24 або вище культура перетворюється на бур'ян, що призводить до знищення навколишніх незахищених культур.§<newPage>§lУрожайність:§r\nЗбільшує шанси на додатковий врожай на 10% (3% автоматично) і іноді може подвоїти врожай з дуже низьким шансом. \nПри значенні 24 кожен додатковий пункт зменшує шанс випадіння насіння на 5% (множення).§<newPage>§lСтійкість:§r\nЗбільшує шанс випадіння насіння та зменшує шанс загибелі культури через вимоги або спроби поширення бур'яну на неї.\nПри рівні 28 або вище значно зменшує шанс селекція.",
  "wiki.ic2.page.fluids": "Рідини",
  "wiki.ic2.page.fluids.alcohol": "Алкоголь",
  "wiki.ic2.page.fluids.alcohol.desc": "Алкоголь - рідина високого рівня, але неавтоматизована.\n\nВін виробляє велику кількість енергії або може бути використаний для максимізації виводу вашого виробництва з руди в слиток.\n\nВиробляти його можна лише через пивоваріння в бочці.",
  "wiki.ic2.page.fluids.biofuel": "Біопаливо",
  "wiki.ic2.page.fluids.biofuel.desc": "Біопаливо - вдосконалена форма рослиної речовини або деревного газу.\n\nЗа прийнятний проміжок часу воно виробляє велику кількість енергії, яку можна використовувати в середньому та кінцевому етапах гри для підтримання вашої бази в робочому стані.\n\nЯкщо у вас є виробництво, яке може його підтримати.",
  "wiki.ic2.page.fluids.blazing_lava": "Вогняна Лава",
  "wiki.ic2.page.fluids.blazing_lava.desc": "Ця, ще гарячіша, рідина виробляється в рефінерії і є в 10 разів ефективнішою, ніж лава для геотермальних генераторів/термогенераторів. 1 одиниця вогняної лави вважається 10 одиницями звичайної лави і для її отримання потрібно лише трохи розмолотих паличок блейза.",
  "wiki.ic2.page.fluids.desc": "IC2C також надає декілька рідин, які використовуються для кількох цілей.\n\nГоловним чином для виробництва енергії або виробництва деяких корисних речовин.",
  "wiki.ic2.page.fluids.steam": "Пар",
  "wiki.ic2.page.fluids.steam.desc": "Пар можна виробляти багатьма способами, наприклад, у §<redirect;true;Паливному котлі;ic2:preview.fuel_boiler> або §<redirect;true;Паровому реакторі;ic2:preview.steam_reactor>, але в кінці гри він використовується переважно для виробництва енергії середнього та високого рівня у генераторах, таких як §<redirect;true;Паровий тунель;ic2:preview.steam_tunnel> або §<redirect;true;Парова турбіна;ic2:preview.steam_turbine>",
  "wiki.ic2.page.fluids.wood_gas": "Деревний Газ",
  "wiki.ic2.page.fluids.wood_gas.desc": "Деревний газ - біпродукт при виробництві деревного вугілля і може бути вироблений у §<redirect;true;Деревний газифікатор;ic2:preview.wood_gassifier>.\n\nЦе чудовий генератор енергії на початковому етапі гри, але пізніше може бути перероблений в більш потужну рідину.",
  "wiki.ic2.page.items.armors": "Обладунки",
  "wiki.ic2.page.items.armors.desc": "IC2C додає кілька типів броні до гри.\n\nЄ декілька видів броні для початкового етапу гри, електрична броня, утилітарна та інші типи.\n\nУтилітарні обладунки включають можливості заряджати ваші електричні інструменти або реактивні ранці.§<newPage>§<header;Броня;true>\nТакож електрична броня є модульною в цій версії і може бути налаштована за допомогою Конфігуратора броні.",
  "wiki.ic2.page.items.batteries": "Батареї",
  "wiki.ic2.page.items.batteries.desc": "Батареї - ваше портативне джерело енергії, яке ви можете використовувати в багатьох випадках.\n\nЦе може бути як зарядження інших предметів, так і тимчасовий запуск машин.\n\nТакож їх можна використовувати як джерело імпульсної енергії, яке справляється з великим споживанням енергії за короткий проміжок часу,\nз яким ваша енергетична мережа не може справитися.",
  "wiki.ic2.page.items.electric_tools": "Електричні Інструменти",
  "wiki.ic2.page.items.electric_tools.desc": "IC2C надає новий тип інструменту в грі:\n\nелектричний інструмент. Він має свої плюси та мінуси, але загалом велике поліпшення.§<newPage>§<header;Електричні інструменти;true>\n- Використовує електрику як міцність.\n- Вони не можуть ламатися.\n- Їх можна перезаряджати з безлічі джерел.\n- Їх можна чарувати лише за допомогою електричного чарівника.\n- Вони мають стильний колір міцності.\n\nВ цій категорії також є багато корисних інструментів, які вам можуть сподобатися.\nОтже, давайте перейдемо до розділу!",
  "wiki.ic2.page.items.info.cards": "Картки Для Моніторів",
  "wiki.ic2.page.items.info.cards.desc": "IC2C додає монітор до гри.\n\nЦей монітор може відображати багато інформації.\n\nЦі картки надають інформацію для монітора.",
  "wiki.ic2.page.items.misc": "Різноманітні Предмети",
  "wiki.ic2.page.items.misc.desc": "Це предмети, які не вписуються в жодну конкретну категорію.",
  "wiki.ic2.page.items.reactor.components": "Компоненти Реактора",
  "wiki.ic2.page.items.reactor.components.desc": "Компоненти реактора - необхідна частина будь-якого реактора.\n\nЦе, в суті, логіка реактора.\nІснує кілька типів компонентів\n\nтаких як Паливні стержні, Теплообмінники, Кулери, Конденсатори та інші.",
  "wiki.ic2.page.items.scanners": "Сканери",
  "wiki.ic2.page.items.scanners.desc": "Сканери - надзвичайно корисний інструмент для збору ресурсів.\n\nЇх можна використовувати в Видобувачы, щоб вказати, що він повинен видобути для вас.\n\nАле деякі з них можуть бути самостійно використані для відображення кількості руд, які фактично знаходяться під вами.\n\nДля додавання додаткових можливостей їх можна використовувати у комбінації з Буром для показу, чи щось, що ви шукаєте, знаходиться поблизу,\n\nхоча значно скорочений радіус дії.",
  "wiki.ic2.page.items.tools": "Інструменти",
  "wiki.ic2.page.items.tools.desc": "IC2C надає вам безліч інструментів, щоб допомогти вам в вашій меті розширення вашої фабрики.\n\nДеякі з цих інструментів є досить простими копальними інструментами,\n\nінші дають вам доступ до цінної інформації або просто дозволяють вам посилити/прикрасити свою базу.",
  "wiki.ic2.page.items.upgrades": "Покращення",
  "wiki.ic2.page.items.upgrades.category": "Ось категорії оновлень:\n- §<redirect;true;Оновлення машин;ic2:items.upgrades.machine>\n\n- §<redirect;true;Оновлення зарядних плат;ic2:items.upgrades.chargepad>\n\n- §<redirect;true;Оновлення інвентарю;ic2:items.upgrades.inventory>\n\n- §<redirect;true;Комплекти оновлень;ic2:items.upgrades.kits>",
  "wiki.ic2.page.items.upgrades.chargepad": "Оновлення для зарядних плат",
  "wiki.ic2.page.items.upgrades.chargepad.desc": "Зарядні плати круті, і ці оновлення дозволяють зробити їх більш корисними,\n\nособливо для сценаріїв PVP, для яких вони були спочатку створені їх автором.\n\nПроте залишаються кілька основних переваг, навіть для тих, хто не користується PVP.",
  "wiki.ic2.page.items.upgrades.desc": "IC2C додає безліч оновлень для багатьох різних машин.\n\nЦе можуть бути як прямі покращення, так і компроміси щодо того, що ви можете або не можете робити.",
  "wiki.ic2.page.items.upgrades.inventory": "Покращення Інвентаря",
  "wiki.ic2.page.items.upgrades.inventory.desc": "Оновлення інвентарю зазнали змін з останньої версії. Фактично, залишилося лише кілька з них,\n\nале те, що вони дозволяють, - строгий контроль над інвентарем.",
  "wiki.ic2.page.items.upgrades.kits": "Набори Покращення",
  "wiki.ic2.page.items.upgrades.kits.desc": "Набори оновлень - ваш інструмент для покращення частин вашої фабрики без необхідності розбирання всього і потім встановлення оновлених версій назад.\n\nЦе помічники, які вдосконалюють речі на місці.\n\nЗвісно, не завжди простий крок, але він спрощує багато речей.",
  "wiki.ic2.page.items.upgrades.machine": "Оновлення Для Машин",
  "wiki.ic2.page.items.upgrades.machine.desc": "Оновлення для машин - просто покращення лише для певних машин.\n\nЇх існує безліч варіантів, таких як: Транспортування, Зміна виводу, Керування червоним каменем і т. д.\n\nОднак кожна машина сама вирішує, які саме з цих оновлень можна використовувати.",
  "wiki.ic2.page.main.body": "Тепер, коли ми розібралися з цим, давайте перейдемо до деяких керувань.\nЗнизу праворуч/ліворуч є кнопки.\nВони будуть переміщати вас вперед/назад при натисканні.",
  "wiki.ic2.page.main.head": "Посібник з IC2C",
  "wiki.ic2.page.main.intro": "Ласкаво просимо до посібника з IC2C.\nМожливо, найважливіший предмет у цьому моді\nПереконайтеся, що, якщо ви викидаєте мене, ви повинні переконатися, що я дійсно корисний.\n\nЗагалом настійно рекомендується використовувати The One Probe, або Jade + IC2C Addon з цим модом, вони надають багато корисної інформації про Машини. Також EU-Метр(Необхідний для отримання інформації з Jade) ваш найкращий друг! Ви попереджені!",
  "wiki.ic2.page.main.wiki_head": "Докладніше",
  "wiki.ic2.page.table.desc": "Містить.\n\n- §<redirect;true;Хронопосібник;ic2:tutorials>\n- §<redirect;true;Розробники;ic2:credits>\n- §<redirect;true;Блоки;ic2:blocks.generators>\n  - §<redirect;true;Генератори;ic2:blocks.generators>\n  - §<redirect;true;Машини;ic2:blocks.machines>\n  - §<redirect;true;Кабелі;ic2:blocks.cables>\n  - §<redirect;true;Електричні Блоки;ic2:blocks.electric_blocks>\n  - §<redirect;true;Персональні Блоки;ic2:blocks.personal_blocks>\n  - §<redirect;true;Рідинні Блоки;ic2:blocks.fluid_blocks>\n  - §<redirect;true;Труби;ic2:blocks.tubes>\n  - §<redirect;true;Вибухівка;ic2:blocks.explosives>\n  - §<redirect;true;Різні Блоки;ic2:blocks.misc>\n\n\n- §<redirect;true;Речі;ic2:items.tools>\n  - §<redirect;true;Інструменти;ic2:items.tools>\n  - §<redirect;true;ЕлектричніІнструменти;ic2:items.electric_tools>\n  - §<redirect;true;Обладунки;ic2:items.armors>\n  - §<redirect;true;Батарейки;ic2:items.batteries>\n  - §<redirect;true;Сканери;ic2:items.scanners>\n  - §<redirect;true;Покращення;ic2:items.upgrades>\n  - §<redirect;true;Компоненти Реактору;ic2:items.reactor.components>\n  - §<redirect;true;Карта Моніторингу;ic2:items.info.cards>\n  - §<redirect;true;Різні речі;ic2:items.misc>\n- §<redirect;true;Рідини;ic2:fluids>\n- §<redirect;true;Культури;ic2:crops>",
  "wiki.ic2.page.table.head": "Зміст",
  "wiki.ic2.page.tutorials.desc": "Це розділ посібників у цій книзі.\nВін надає просте керівництво та пояснення того, як працюють певні функції.\n\nЦе повинно допомогти в прогресі, а також з більш складними можливостями.\n\nНа наступній сторінці є посилання на вже існуючі посібники.",
  "wiki.ic2.page.tutorials.head": "Посібник",
  "wiki.ic2.page.tutorials.head.path": "Посилання На Посібники",
  "wiki.ic2.page.tutorials.path": "Послідовність навчань:\n- §<redirect;true;Перший День;ic2:subpage.first_day>\n- §<redirect;true;Ранній Етап Гри;ic2:subpage.early_game>\n- §<redirect;true;Другий Рівень;ic2:subpage.second_tier>\n- §<redirect;true;Третій Рівень;ic2:subpage.third_tier>\n- §<redirect;true;Четвертий Рівень;ic2:subpage.fourth_tier>\n\nРізноманітні навчання:\n- §<redirect;true;Електроенергія;ic2:subpage.electricity>\n- §<redirect;true;Логістичний Транспорт;ic2:subpage.logistic_grid>\n- §<redirect;true;Варіння;ic2:subpage.brewing>\n- §<redirect;true;Реактори;ic2:subpage.nuclear_reactor>",
  "wiki.ic2.preview.accumulator": "Квантовий Накопичувач",
  "wiki.ic2.preview.accumulator.desc": "Накопичувач - сховище високої ємності на рівні енергії з низьким споживанням. Воно зберігає менше, але є більш гнучким.",
  "wiki.ic2.preview.activity_card.desc": "Карта активності вказує, чи працює машина чи ні.",
  "wiki.ic2.preview.adamantum.desc": "Адамантум - ваша культура для виробництва діамантів. Вона росте дуже повільно і вимагає наявності блоку або руди діаманта під нею.",
  "wiki.ic2.preview.adjustable_luminator.desc": "Потрібен конкретний рівень освітлення? Регульований світильник приходить на допомогу. Він може змінювати рівень освітленності до будь-якого рівня освітлення, зберігаючи всі функції світильника!",
  "wiki.ic2.preview.advanced_chainsaw.desc": "Розширена Ланцюговапила - це ваш інструмент для вирубування дерев на останньомі етапі грі. Вона 'живе' деревами! Так що будьте обережні з нею. Хоча вона не поїдає вас теж!",
  "wiki.ic2.preview.advanced_drill.desc": "Розширений бур - це ваш кінцевий інструмент для копання. Він дозволяє вам видобувати блоки 3x3 настільки, наскільки хотів Спейгер їх уникнути. Здається, він програв цю битву!",
  "wiki.ic2.preview.advanced_hoe.desc": "Розширена мотика - це інструмент для масового сільського господарювання в кінці гри, який вам потрібен. Вона може обробляти поля в радіусі 5 блоків, роблячи життя набагато простішим!",
  "wiki.ic2.preview.advanced_solar_helmet.desc": "Розширений Сонячний Шолом - це вдосконалений Сонячний Шолом, який виробляє 5EU/т, заряджаючи вашу броню та інструменти.",
  "wiki.ic2.preview.advanced_tree_tap.desc": "Розширений краник для дерев - це монстр. При використанні на гумовому дереві він видаляє ціле дерево, щоб отримати багато липкого смолосполучення! Це справжній монстр!",
  "wiki.ic2.preview.air_refill_module.desc": "Ви знаходитесь під водою і закінчується кисень? Що скажете на те, щоб використати модуль для поновлення повітря? Він завжди забезпечить вас свіжим запасом кисню.",
  "wiki.ic2.preview.allium.desc": "Алліум - це квітка, яка виробляє маджентовий колір. Як і всі квіти, вона вимагає яскравої області (12 або більше).",
  "wiki.ic2.preview.alloy_smelter.desc": "Сплавний плавильник - це ворота до наступного рівня прогресу. Він використовує 16EU/т і використовується для створення сплавів або більш складних матеріалів.",
  "wiki.ic2.preview.alumen.desc": "Алюмен - це рослина, яка виробляє алюміній. Для повного зростання вона потребує блоку/руди вказаного матеріалу під нею.",
  "wiki.ic2.preview.aluminium_cable_item.desc": "Алюмінієвий кабель. Він може переносити 8,192EU з постійною втратою. Дуже ефективний для реакторів у кінці гри.",
  "wiki.ic2.preview.argentum.desc": "Аргентум - це ваші рослини, які виробляють срібло. Для завершення зростання їм потрібен блок/руда вказаного матеріалу під ними.",
  "wiki.ic2.preview.armor.bronze": "Бронзові Обладунки",
  "wiki.ic2.preview.armor.bronze.desc": "Бронзова броня трошки краща, ніж її залізний аналог за рівнем захисту. За межами цього вона в основному є дешевшою варіацією залізної броні.",
  "wiki.ic2.preview.armor.composite": "Композитна Броня",
  "wiki.ic2.preview.armor.composite.desc": "Завдяки своїй двошаровій броні та броньованій пластині з сплаву, Композитна броня є дуже міцною бронею. Краща, ніж недрит.",
  "wiki.ic2.preview.armor.hazmat": "Хімзахист",
  "wiki.ic2.preview.armor.hazmat.desc": "Коли Хімзахист повністю вдягнений, він захищає від лави/вогню і, маючи апарати для подачі повітря, переконуйться, що ви не тонете.",
  "wiki.ic2.preview.armor.jetpack.electric": "Електричний Ранець",
  "wiki.ic2.preview.armor.jetpack.electric.desc": "Електричний Джетпак - це електричний варіант джетпака. Це полегшує процес зарядження. Крім того, Компактний Джетпак має режим рокети!",
  "wiki.ic2.preview.armor.jetpack.nuclear": "Ядерній Ранець",
  "wiki.ic2.preview.armor.jetpack.nuclear.desc": "Дратує постійний відсутній запас палива? Ядерний джетпак вирішить цю проблему. Використовуйте §msafe§r уран, щоб забезпечити його паливом.",
  "wiki.ic2.preview.armor.nano": "Нанообладунки",
  "wiki.ic2.preview.armor.nano.desc": "Нанообладунки - це ваша перша електрична броня в грі. Вона використовує електроенергію, щоб забезпечити вам безпеку, і може бути розширена в конфігураторі броні.",
  "wiki.ic2.preview.armor.quantum": "Квантова Броня",
  "wiki.ic2.preview.armor.quantum.desc": "Квантова броня - це вдосконалена Нанообладунки. Вона має більший об'єм енергозберігання та більше можливостей для розширення.",
  "wiki.ic2.preview.armor_configurator.desc": "Конфігуратор Броні надає можливість налаштування електричних обладунків за допомогою §lмодулів§r, які дозволяють використовувати конкретні функції. Наприклад, супершвидкість, нічний вид, джетпаки тощо.",
  "wiki.ic2.preview.armor_priority_pad_upgrade.desc": "Оновлення пріоритету броні змінює Зарядну плату так, щоб надавати енергію броні перед гарячою панеллю.",
  "wiki.ic2.preview.aurelia.desc": "Аурелія - це ваша золотовиробнича культура, яка потребує руди/блоку золота під собою, щоб завершити зростання. Деякі кажуть, що вона занадто блищить!",
  "wiki.ic2.preview.auto_feeder_module.desc": "Ігноруйте руку, що виступає з вашої голови і запихає консервну банку вам у рот. Це лише Модуль автоматичного годування автоматично подає вам консервні банки з їжею.",
  "wiki.ic2.preview.azure_bluet.desc": "Азурний блут - це квітка, яка виробляє сіре фарбування. Як і всі квіти, для його росту потрібно рівень освітлення 12 або більше.",
  "wiki.ic2.preview.bamboo.desc": "Культура яка вирощує бамбук і росте досить швидко. Вона віддає перевагу низькій вологості (4 або менше), щоб зростати.",
  "wiki.ic2.preview.base_module.desc": "Базовий модуль. Ремесельний компонент для створення електричних модифікацій броні, які можна встановити в бронеконфігураторі.",
  "wiki.ic2.preview.base_teleporter.desc": "Базовий телепортер - це ваша місцева домашня мережа призначень, де ви можете стрибати за потреби за 4000EU/телепорт. Він має горизонтальний радіус 100 блоків.",
  "wiki.ic2.preview.battery": "Батареї",
  "wiki.ic2.preview.battery.desc": "Батареї - це ваш переносний накопичувач енергії, який можна використовувати для живлення інших машин, навіть поза вашою мережею.",
  "wiki.ic2.preview.battery.pack": "Енергетичний Набір",
  "wiki.ic2.preview.battery.pack.desc": "Енергетичний пакет - це ще одна портативна форма зберігання енергії. Обладнані інструменти тощо можуть використовувати його енергію.",
  "wiki.ic2.preview.battery_station": "Батарейна Станція",
  "wiki.ic2.preview.battery_station.desc": "Станція батарей розряджає електричні предмети, а потім виводить їх у світ. Вона створює 4 пакети свого рівня.",
  "wiki.ic2.preview.beetroot.desc": "Вирощування буряка дає можливість використовувати його як їжу або червону фарбу.\n\nЗа бажанням може виробляти насіння, коли встановлено у відповідний режим.",
  "wiki.ic2.preview.blackthorn.desc": "Блекторн - це троянда, яка виробляє чорну фарбу. Деякі чутки говорять, що раніше вона виробляла мішки з чорнилом. На жаль, це, здається, була брехня.",
  "wiki.ic2.preview.blast_induction_furnace.desc": "Індукційна вибухова піч - це спеціалізована індукційна піч лише для руд. Вона використовує 30EU/t для швидкого плавлення.",
  "wiki.ic2.preview.blue_orchid.desc": "Синя орхідея відома тільки в дикій природі, де вона росте лише в багнах. Висока концентрація поживних речовин робить її відмінною ціллю, хоча це не обов'язково. Вона потребує яскравого освітлення (12 або більше). Виробляє світло-голубе фарбування.",
  "wiki.ic2.preview.blue_wheat.desc": "Синя пшениця - це дивний вид культури. Хтось може сказати, що хтось хотів обдурити людей, фарбуючи пшеницю в синій колір, але ні. Це культура, яка виробляє ляпис, і вона потребує багато води. Завдяки такій великій потребі у воді відомо, що вона росте під водою.",
  "wiki.ic2.preview.bone_flower.desc": "Кісткова квітка має до вас кістку. Я не шуткую. Вона виробляє кісткову муку. Також вона потребує кісткового блоку під собою, щоб фактично рости.",
  "wiki.ic2.preview.brain_coral.desc": "Мозковий корал - це водяна культура, яку можна використовувати для вирощування коралових блоків. Вона має шанс виробляти всі варіанти мозкових коралів. Для росту він потребує чистої води (3 або більше).",
  "wiki.ic2.preview.bronze_cable_item.desc": "Бронзовий кабель- дешева альтернатива золоту! Він витримує до 128EU, але може бути використаний лише на відстані 1 блока перед втратами енергії.",
  "wiki.ic2.preview.brown_mushroom.desc": "Коричневий гриб вирощується сам по собі, як і багато інших культур. Для його росту потрібна вологість 1 або більше. І він росте досить швидко.",
  "wiki.ic2.preview.bubble_coral.desc": "Бульбашковий корал - це водяна культура, яку можна використовувати для вирощування коралових блоків. Він має шанс виробляти всі варіанти бульбашкових коралів. Припускається, що він живий. Для росту він потребує чистої води (3 або більше).",
  "wiki.ic2.preview.buffer_storage_expansion.desc": "Розширення буферного сховища надає Промисловому Робочому Столу 9 тимчасових слотів виведення, в яких можна зберігати непотрібні предмети.",
  "wiki.ic2.preview.cactus.desc": "Кактус жалить при доторканні, і це не змінюється, коли він змінюється з великого на менший. Йому просто потрібне сонячне світло. Крім того, чим гарячіший біом, тим швидше він росте.",
  "wiki.ic2.preview.canner.desc": "Каннер - це упаковщик, який використовує 1EU/t для упаковування їжі в банки або поповнення пальників інструментів/предметів їх паливом або поєднання палива для збільшення їх ефективності.",
  "wiki.ic2.preview.capacity_pipe.desc": "Труба великого обсягу має вищу швидкість передачі - 200 мБ/тік, порівняно з звичайною трубою, але міцність залишається тією ж самою.",
  "wiki.ic2.preview.carrot.desc": "Моркву можна використовувати як чудове джерело їжі для вас і ваших свиней! Культура росте сама і забезпечує вас стійким постачанням моркви. Для її росту потрібна освітлена область навколо неї (9 або більше).",
  "wiki.ic2.preview.centrifugal_extractor.desc": "Центрифуга-екстрактор є вдосконаленим екстрактором, який використовує високошвидкісний оберт для вилучення елементів один з одного. Використовуючи 16EU/t.",
  "wiki.ic2.preview.centrifugal_rare_earth_extractor.desc": "Центрифуга для видобутку рідкоземельних елементів - це вдосконалення його аналога, яке використовує енергію обертання для швидшого виділення рідкоземельних металів! Вона використовує 16EU/t.",
  "wiki.ic2.preview.cf_pack.desc": "Пакет будівельної піни дозволяє вам нести з собою набагато більше цієї піни. Це стає дуже корисним для великих місій з розпиленням.",
  "wiki.ic2.preview.cfoam.carpet": "Килим з будівельної піни",
  "wiki.ic2.preview.cfoam.carpet.desc": "Килими з будівельної піни є негорючими та вибухостійкими",
  "wiki.ic2.preview.cfoam.desc": "Блок будівельної піни - це декоративний блок, стійкий до вибухів. Він не є ідеальним, але ТНТ не подряпує його.",
  "wiki.ic2.preview.cfoam.panel": "Панель з будівельної піни",
  "wiki.ic2.preview.cfoam.panel.desc": "Панель з будівельної піниможна використовувати для створення перил або парканів. Він також вибухостійкий.",
  "wiki.ic2.preview.cfoam.slabs": "Плити з будівельної піни",
  "wiki.ic2.preview.cfoam.slabs.desc": "Плити з будівельної піни - декоративні плити, що також стійкі до вибухів.",
  "wiki.ic2.preview.cfoam.stairs": "Сходи з будівельної піни",
  "wiki.ic2.preview.cfoam.stairs.desc": "Сходи з будівельної піни - декоративні сходи, що також стійкі до вибухів.",
  "wiki.ic2.preview.cfoam.tiles": "Плитка з будівельної піни",
  "wiki.ic2.preview.cfoam.tiles.desc": "Плитка з будівельної піни схожа на килим за формою, але має властивості каменю. Знову ж таки, для декору, але стійка до вибухів.",
  "wiki.ic2.preview.cfoam.wall": "Стіна з будівельної піни",
  "wiki.ic2.preview.cfoam.wall.desc": "Хочете декоративну стіну, що стійка до вибухів? Стіни з будівельної піни вас прикривають!",
  "wiki.ic2.preview.cfoam.wool": "Вовна з будівельної піни",
  "wiki.ic2.preview.будівельної піни.wool.desc": "Невогненепроникна вовна, стійка до вибухів? Вовна будівельної піни підходить!",
  "wiki.ic2.preview.chainsaw.desc": "Ланцюгова пила - це ваш універсальний інструмент/зброя! Вона дуже ефективна для рубання дерев, але також може стригти вівці. Загалом, це дійсно корисний інструмент!",
  "wiki.ic2.preview.charged_electrolyzer.desc": "Заряджений електролізер - це вдосконалений електролізер, який може використовувати кілька сховищ енергії для швидшого наповнення предметів!",
  "wiki.ic2.preview.chargepad": "Зарядна Плита",
  "wiki.ic2.preview.chargepad.desc": "Зарядна плита - це стаціонарний зарядник, який буде дбати про ваші електричні пристрої, коли ви стоїте на ній. Просто не впадіть на неї!",
  "wiki.ic2.preview.charger_module.desc": "Модуль зарядки. Додає спеціальні електричні схеми до електричного бронежилета, щоб поділитися енергією з іншими предметами, якщо вони потребують її в вашому інвентарі.",



  "wiki.ic2.preview.charging_bench": "Зарядний стенд ",
  "wiki.ic2.preview.charging_bench.desc": "Зарядний стенд - це інструмент для масового заряджання, який може заряджати до 16 електричних пристроїв будь-якого рівня. Він постачається разом з корисними інструментами.",
  "wiki.ic2.preview.chunkloader.desc": "Провантажувач використовує електроенергію для утримання світу від руйнування, створюючи камеру просторово-часового континууму. Розмір цієї камери залежить від наданої потужності. Мінімально - 5EU/т.",
  "wiki.ic2.preview.cocoa.desc": "Зерна какао-бобів вирощує вказані боби. Для росту вона потребує родючого ґрунту (3 або більше).",
  "wiki.ic2.preview.coffee.desc": "Кава - полюсна протилежність чаю, і обидві групи вкрай нелюб'язно ставляться одна до одної. Для вирощування какао-бобів необхідна достатньо освітлена область (9 або більше), які можна використовувати для виготовлення різних кавових продуктів з різними ефектами.",
  "wiki.ic2.preview.coin.desc": "Промислові гроші - це невиготовний предмет. Це валюта, тому її не слід створювати. Вона видається в Трейд-О-Маті.",
  "wiki.ic2.preview.color_filter_tube.desc": "Кольорова фільтруюча труба просто сортує предмети за їх кольором. Це дозволяє використовувати більш спрощений фільтр і більш складні системи.",
  "wiki.ic2.preview.colossal_compressor.desc": "Що можна зробити, якщо у вас є компресор з гіпершвидкістю? Створіть найбільший можливий компресор! Ось Колосальний компресор! 40EU/т",
  "wiki.ic2.preview.colossal_extractor.desc": "Що можна зробити, якщо у вас є екстрактор з гіпершвидкістю? Створіть найбільший можливий екстрактор! Ось Колосальний екстрактор! 40EU/т",
  "wiki.ic2.preview.colossal_furnace.desc": "Що можна зробити, якщо у вас є піч з гіпершвидкістю? Створіть найбільший можливий піч! Ось Колосальна піч! 40EU/т",
  "wiki.ic2.preview.colossal_macerator.desc": "Що можна зробити, якщо у вас є подрібнювач з гіпершвидкістю? Створіть найбільший можливий подрібнювач! Ось Колосальний подрібнювач! 40EU/т",
  "wiki.ic2.preview.colossal_recycler.desc": "Що можна зробити, якщо у вас є рециклер з гіпершвидкістю? Створіть найбільший можливий рециклер! Ось Колосальний утилізатор! 40EU/т. Він також збільшує удачу на 500%",
  "wiki.ic2.preview.compact_solar_panel": "Стиснута сонячна панель",
  "wiki.ic2.preview.compact_solar_panel.desc": "Стиснуті сонячні панелі по суті є купою сонячних панелей, об'єднаних для збереження простору. СЕРЙОЗНО?!?!?",
  "wiki.ic2.preview.compact_watermill": "Водяний млин",
  "wiki.ic2.preview.compact_watermill.desc": "Водяні млини - це об'єднані водяні млини, які намагаються насильно витиснути більше ефективності з них... що-то вроді працює о.О?!?",
  "wiki.ic2.preview.compacting_recycler.desc": "Компактний утилізатор - це покращений утилізатор, який використовує 16EU/т для надзвичайно швидкої утилізації всього сміття, яке вам вже не потрібно.",
  "wiki.ic2.preview.comparing_cable_item.desc": "Порівняльний кабель: виводить сигнал червоного каменю в залежності від бажаного діапазону потужності. Він може опрацьовувати 2048EU і втрачає потужність кожні 2 блоки.",
  "wiki.ic2.preview.compressor.desc": "Стиснювач - одна з машин, необхідних для просування по технологічному дереву. Робить те, що вказано; стискає речі разом. З невеликим споживанням енергії 2EU/т. Отримайте його, поки не пізно!",
  "wiki.ic2.preview.condensator.desc": "Конденсатор - ресурсне рішення для виведення тепла. Вони зберігають велику кількість тепла. Корисні для нестабільних конструкцій реакторів.",
  "wiki.ic2.preview.construction_light.desc": "Хочете цікавіше освітлення на вашому будівельному майданчику? Що скажете на Будівельний освітлювач? Він робить атмосферу ще реалістичнішою! Також воно працює!",
  "wiki.ic2.preview.copper_cable_item.desc": "Мідний кабель. Ваш початковий кабель, який витримує до 32EU і може бути використаний для 5 блоків до будь-яких втрат.",
  "wiki.ic2.preview.cornflower.desc": "Волошка - це квітка, яка виробляє синій барвник! Хіба це логічно? Запитайте когось іншого. Волошці, як і всім квітам, для росту потрібна світла ділянка (12 або більше)",
  "wiki.ic2.preview.crimson_fungus.desc": "Багряний гриб - це ваш саджанець для Незеру. Його можна виростити у вигляді колод, які дозволять вам вижити у Незері, не маючи при собі дров. Ця культура дає гриби, і вона вимагає абсолютно сухого середовища. Просто переконайтеся, що він не вибухне на вас.",
  "wiki.ic2.preview.crop_analyzer.desc": "Аналізатор культур - це ваш інструмент для з'ясування того, які культури ви маєте на даний момент. Але також дозволяє побачити, які культури можна було б виростити, якби ви їх розводили.",
  "wiki.ic2.preview.crop_analyzer_block.desc": "Аналізатор культур маж ще стаціонарну версію, аналізатор врожаю, який може автоматично аналізувати врожай за 10000EU за культуру. Хоча і не миттєво, він робить це за ціною 1EU/т.",
  "wiki.ic2.preview.crop_harvester.desc": "Збирач культур - це автоматична машина для збору врожаю. Вона не є швидкою і отримує менше ресурсів, але може бути покращена і виконує свою роботу за 5EU/т.",
  "wiki.ic2.preview.crop_library.desc": "Бібліотека культур - це ваше цифрове зберігання культур. Вона може зберігати стільки культур, скільки вам потрібно. Проте для доступу до них потрібно 1EU/т, і вміст втрачається при поламанні!",
  "wiki.ic2.preview.cropmatron.desc": "Сівалка - це нянька для ваших культур. Бажаєте, щоб ваші культури були улюбленими? Інвестуйте в одну з цих. Від 1 до 31EU/т ваші культури отримають всю увагу, яку вони потребують!",
  "wiki.ic2.preview.cutter.desc": "Кабелеріз - це ваш інструмент для керування вашими кабелями. Він може додавати та видаляти ізоляцію з кабелів.",
  "wiki.ic2.preview.damage_conversion_pad_upgrade.desc": "Покращення: Перетворення пошкоджень перетворює зарядний килимок у смертельну пастку. Замість того, щоб використовувати енергію для зарядки гравців, воно завдає їм шкоду.",
  "wiki.ic2.preview.dandelion.desc": "Кульбаба - це типова жовта квітка, яка потребує яскравої області (12 або більше), щоб рости. Нічого особливого в неї немає.",
  "wiki.ic2.preview.detector_cable_item.desc": "Детекторний кабель. Він виявляє, чи витікає потужність через нього, а потім висилає сигнал червоного каменю. Він може опрацьовувати 2048EU і працювати на 2 блоках, перш ніж буде будь-яка втрата.",
  "wiki.ic2.preview.detector_card.desc": "Карта детектора дозволяє вам візуалізувати, хто викликав Детектори гравців, що дозволяє створювати щось подібне до журналу доступу.",
  "wiki.ic2.preview.detector_pipe.desc": "Детекторна рідинна труба - це труба, яка видає сигнал червоного каменю, коли через неї прокачується рідина.",
  "wiki.ic2.preview.diamond_drill.desc": "Діамантовий бур - це покращення бура, яке надає йому здатність видобувати більш тверді блоки, такі як обсидіан, але також швидко видобуває ґрунт. Потребує режиму для ґрунту!",
  "wiki.ic2.preview.directional_tube.desc": "Спрямована труба направляє предмети в бажаному напрямку. Вихід може бути блокований по замовчуванню, щоб нічого не намагалося проникнути через вихід.",
  "wiki.ic2.preview.drain_conversion_pad_upgrade.desc": "Оновлення конвертування стоку ще жорстокіше. Замість того, щоб заряджати ваші предмети, воно розряджає їх, використовуючи енергію, яку ви маєте в килимку.",
  "wiki.ic2.preview.drill.desc": "Буровий вибивач - один з перших електричних інструментів, які вам знадобляться. Це комбінація кайла та лопати. А зі сканером можна виявляти руди неподалік!",
  "wiki.ic2.preview.dropping_tube.desc": "Викидна труба схожа на скидаємий пристрій, але не має випадкових рухів. Також не потребує червоного каменю!",
  "wiki.ic2.preview.dyeing_tube.desc": "Фарбувальна труба розфарбовує предмети, які проходять через неї, у вибраному кольорі. Для вибору кольору використовуються фарба.",
  "wiki.ic2.preview.dynamite.desc": "Динаміт - це ваша контрольована вибхівка. Його можна встановити або кинути. Він створює вибух розміром 3x3x3, який знищує більшість блоків. Ідеально підходить для гірництва.",
  "wiki.ic2.preview.dynamite_remote.desc": "Детонатор може підключатися до розміщеного динаміту та активувати всі підключені одночасно.",
  "wiki.ic2.preview.electric_blast_furnace.desc": "Електрична вибухова піч спеціалізована лише на плавленні руд за допомогою електроенергії. Вона використовує 5EU/t і є приблизно на 40% швидшою за звичайну вибухову піч.",
  "wiki.ic2.preview.electric_enchanter.desc": "Електричний чарівник надає вам можливість чарувати електричні інструменти. Це єдиний спосіб, і для цього потрібно 500EU/t.",
  "wiki.ic2.preview.electric_furnace.desc": "Електрична піч - це проста та пряма піч, яка використовує електроенергію для приготування їжі. Вона використовує 3EU/t і є приблизно на 40% швидшою, ніж звичайна піч.",
  "wiki.ic2.preview.electric_hoe.desc": "Електрична мотика - це ваша незламна мотика, яка також може змінювати врожай культур з продуктів на насіння і назад!",
  "wiki.ic2.preview.electric_pipe_pump.desc": "Електричний насос для труб - це насос, який використовує електроенергію для пересилання рідин через трубопровідну систему. Він має потужність 250 блоків і передає до 500 мБ на такт.",
  "wiki.ic2.preview.electric_smoker.desc": "Електричний копчений - використовує електроенергію для копчення їжі ?!?!?! Як? Магія? Точно, магія! Він використовує 5EU/t і є приблизно на 40% швидший, ніж звичайний копчений.",
  "wiki.ic2.preview.electric_sprayer.desc": "Електричний розпилювач - це ваш розпилювач з більш точним керуванням. Використовує EU для точного контролю за тим, скільки будівельної піни вивільнюється. Може бути заповнений лише у консерванті.",
  "wiki.ic2.preview.electric_tree_tap.desc": "Криник, тому електричний краник вирішує цю проблему, використовуючи EU замість. Його також можна пізніше покращити для автоматичного вставлення липкої смоли в ваш інвентар!",
  "wiki.ic2.preview.electric_vent.desc": "Електричні вентиляційні отвори використовують виробництво EU з вашого реактора для подвоєного ефективного охолодження в порівнянні зі звичайними.",
  "wiki.ic2.preview.electric_wood_gassifier.desc": "Електричний дерев'яний газифікатор - це електрифікований дерев'яний газифікатор, який використовує 1EU/t для виконання тієї ж роботи. Нажаль, він трошки менше виробляє деревного газу.",
  "wiki.ic2.preview.electric_wrench.desc": "Електричний ключ - це ваш апгрейднутий ключ в порівнянні з звичайним. Він має трохи вищий шанс випадіння предметів, і гарантує 15 не втратних випадань.",
  "wiki.ic2.preview.electrolyzer.desc": "Електролізер - це машина, яка насичує предмети електроенергією. Для виконання своєї роботи він повинен безпосередньо торкатися майже повного сховища енергії. Швидкість визначається рівнем сховища.",
  "wiki.ic2.preview.energy_hud_module.desc": "Модуль відображення енергії на HUD додає інформаційний екран до вашого виду, що дозволяє вам бачити потужність кожного електричного елемента броні усе час. Його положення не є остаточним.",
  "wiki.ic2.preview.energy_o_mat.desc": "Енерг-О-Мат - це блок, який дозволяє обмінювати енергію на предмети або монети. Вимагає підключення персонального накопичувача енергії. Дозволяє здійснювати автоматизовану торгівлю.",
  "wiki.ic2.preview.energy_storage": "Енергетичне Сховище",
  "wiki.ic2.preview.energy_storage.desc": "Сховища енергії зберігають надлишкову енергію в вашій енергетичній мережі. Ліміт енергії пакету такий самий, як вихідна потужність.",
  "wiki.ic2.preview.eu_card.desc": "Карта EU показує вам, скільки енергії є в машині.",
  "wiki.ic2.preview.eu_reader.desc": "EU-Метр - це ваш інструмент для отримання інформації. Чи то інформація в інтерфейсі, енергетична інформація або просто загальна статистика. Він значно розширює можливості інформації, яку ви отримуєте!",
  "wiki.ic2.preview.extinguish_module.desc": "Ви горите? Хочете від цього визватися? Модуль загашення приходить на допомогу! Він видаляє вогонь з вас, як тільки він з'являється. Але він не захищає вас від лави.",
  "wiki.ic2.preview.extraction_tube.desc": "Труба вилучення - це труба, яка просто видобуває з підключених інвентарів стійким темпом. Додаткові лиця для додаткового видобутку можна додати за допомогою інструменту TubeTool.",
  "wiki.ic2.preview.extractor.desc": "Екстрактор - це ресурсний рефайнер. Його основне використання - рефайнити липку смолу в гуму, потроюючи ваш вихід! Але він має ще багато використань. Виправдовуючи 2EU/t.",
  "wiki.ic2.preview.ferru.desc": "Культура Ferru - це ваша культура заліза. Найцінніший з усіх металевих культур. Для завершення зростання потрібен блок/руда заліза.",
  "wiki.ic2.preview.fertilizer.desc": "Добриво використовується для прискорення росту культур. Воно повільно споживається з часом.",
  "wiki.ic2.preview.filter_tube.desc": "Фільтруюча труба дозволяє сортувати предмети у вказаному вами напрямку.",

  "wiki.ic2.preview.filtered_extraction_tube.desc": "Фільтрована труба є набагато більш вдосконаленою відносно труби видобутку. Її можна фільтрувати, а також покращувати для переміщення більше предметів одночасно.",
  "wiki.ic2.preview.filtered_scanner.desc": "Фільтрований сканер дозволяє вам вирішувати, що саме ви шукаєте. Він не обмежений рудами, як інші.",
  "wiki.ic2.preview.fire_coral.desc": "Вогняний корал - це водний врожай, який можна використовувати для вирощування коралових блоків. Він має шанс виробляти всі види вогняних коралів, за умови, що він живий. Для росту потрібна чиста вода (3 або більше).",
  "wiki.ic2.preview.fisher": "Електричний рибалка",
  "wiki.ic2.preview.fisher.desc": "Електричний рибалка - це ваш кінцевий варіант для здобичі. Він споживає багато енергії, але висушує океани від всіх їхніх скарбів.",
  "wiki.ic2.preview.fluid_expansion.desc": "Розширення рідини дозволяє Промисловій Робочій стільниці використовувати рідини безпосередньо в своїх рецептах. Вона зберігає до 4 різних рідин з обсягом 128 відра.",
  "wiki.ic2.preview.fluid_o_mat.desc": "Рідин-О-Мат - це блок, який дозволяє рідинам обмінюватися на предмети або монети. Для його роботи потрібно підключити Особистий бак. Дозволяє автоматизований обмін.",
  "wiki.ic2.preview.fluid_scanner.desc": "Сканер рідин шукає тільки рідини. Його основне використання - для Дистанційної Помпи або якщо ви використовуєте Рудник з помпами.",
  "wiki.ic2.preview.fluid_scanner_filtered.desc": "Фільтрований сканер рідин дозволяє шукати конкретні рідини замість будь-яких з них.",
  "wiki.ic2.preview.fluid_tube.desc": "Рідкісна труба, несвята сполучення між трубою та трубою. Фактично дозволяє перетинати 2 потоки.",
  "wiki.ic2.preview.flux_generator": "Генератор потоку",
  "wiki.ic2.preview.flux_generator.desc": "Генератор потоку створює RF з EU. Це дозволяє здійснювати потужність FE/RF за допомогою EU і може діяти як зарядник предметів!",
  "wiki.ic2.preview.foam_sprayer.desc": "Розпилювач будівельної піни використовує гранули, щоб розпилювати вологу будівельну піну. Риштування можуть бути використані як орієнтири, і можна розпилювати дроти/труби/труби також.",
  "wiki.ic2.preview.food_storage_module.desc": "Не хочете носити консервні банки з їжею в своєму інвентарі? Немає проблем! Модуль зберігання їжі додає 4 слоти для вживання їди.",
  "wiki.ic2.preview.forget_me_not.desc": "Незабудка - це гарна блакитна квітка. Її зазвичай забувають, оскільки вона складна квітка, яка не часто потрібна. Для росту потрібна як усім квіткам яскрава область (12 або більше).",
  "wiki.ic2.preview.frequency_transmitter.desc": "Передавач частоти - це інструмент для зв'язку 2 телепортерів або телепортних клапанів між собою.",
  "wiki.ic2.preview.fuel_boiler.desc": "Паливний котел - це багатоблочний генератор пари, який може бути живлений лише паливними банками, хоча із дуже високою паливною ефективністю. Він виробляє 1024мБ/т пари.",
  "wiki.ic2.preview.fuel_can.desc": "Паливний балон - це ваш модульний паливний сховище. Він поповнюється в Консерваторі і може бути дуже великим джерелом палива. Залежно від консерватора його можна заповнити від 6 до 12 предметів.",
  "wiki.ic2.preview.fuel_jetpack.desc": "Реактивний ранець - це ваш ранній варіант руху. Він дуже добре працює при вертикальному русі, але, на жаль, не дуже ефективний при горизонтальному русі.",
  "wiki.ic2.preview.fusion_reactor.desc": "Немає лави? Хочете постійний джерело? І не хочете натякати на Пекло? Термоядерний реактор покрив вас. Він виробляє лаву, використовуючи уран!",
  "wiki.ic2.preview.generator.desc": "Генератор - це ваша найбільш базова машина для генерації EU, що виробляє потужність 10EU/т. Він використовує тверді палива, такі як вугілля або дерево, аналогічно печі.",
  "wiki.ic2.preview.geothermal_generator.desc": "Геотермальний генератор - це потужний генератор, який використовує лаву і виробляє неймовірні 20EU/т. Легко вирішує багато вашіх потреб на початку гри.",
  "wiki.ic2.preview.glassfiber_cable_item.desc": "Скловолоконний кабель. Почекайте, скловолокно? Як це? Магія? У будь-якому випадку, це дорогий, але цінний кабель, який працює з 512EU і може проходити 40 блоків без втрат.",
  "wiki.ic2.preview.glow_berry.desc": "Світло-ягода - це харчування середньої гри, яке можна використовувати для приготування печива!\n\nВ іншому випадку про неї нічого більше.",
  "wiki.ic2.preview.glowshroom.desc": "Світлогриб. Чому він існує? Тому що СВІТЛОГРИБ! Він виробляє пил гловстону, але для того, щоб він міг завершити ріст, потрібно, щоб до нього доторкалася блок гловстону.",
  "wiki.ic2.preview.gold_cable_item.desc": "Золотий кабель: ваш перехід вищої якості енергії. Обробляє до 128EU і може передавати 2 блоки без втрат.",
  "wiki.ic2.preview.golden_module.desc": "Свині люблять ЗОЛОТО. Але вони погорджують електричними бронями. Тому Золотий модуль робить Блискучою Броню! Більше проблем з свинями!",
  "wiki.ic2.preview.heat_exchanger.desc": "Теплообмінник обмінює тепло з навколишніми компонентами та/або самим реактором, допомагаючи балансувати тепло.",
  "wiki.ic2.preview.heat_pack.desc": "Тепловий пакет розігріває реактор до 1000 разів від його розміру. Це дозволяє легко підтримувати певний рівень тепла. Не може бути використаний в Паровому Реакторі",
  "wiki.ic2.preview.heat_spreader.desc": "Вентиль тепла повільно охолоджує себе та/або реактор, який доторкається.",
  "wiki.ic2.preview.heat_storage": "Кулінарна Клітина",
  "wiki.ic2.preview.heat_storage.desc": "Теплове сховище дозволяє тимчасово зберігати тепло в кеші тепла. Це дозволяє вашим компонентам тривати довше.",
  "wiki.ic2.preview.heat_vent.desc": "Вентиль тепла повільно охолоджує сам себе та/або реактор.",
  "wiki.ic2.preview.hemp.desc": "Коноплі - це винятковий врожай IC2. Так, ви не можете садити його без конструкцій IC2. Вона виробляє таку коноплю, яка може бути використана в багатьох виробничих процесах. Для росту потрібна яскрава область (7 або більше).",
  "wiki.ic2.preview.hops.desc": "Хміль - це ваш вступ до варіння. Пиво можна продати селянам, використовувати для виробництва енергії або для вищих врожаїв з руди. Це повністю ручний процес, який займає години, але його легко масово виробляти. Для росту потрібна яскрава область (9 або більше).",
  "wiki.ic2.preview.horn_coral.desc": "Роговий корал - це підводний врожай, який можна використовувати для вирощування коралових блоків. Він має шанс виробляти всі види рогових коралів. Це за умови, що він живий. Для росту потрібна чиста вода (3 або більше).",
  "wiki.ic2.preview.hover_tube.desc": "Летюча труба - це дорогий шматок технології, який дозволяє предметам не бути під впливом гравітації або змінювати швидкість взагалі.",
  "wiki.ic2.preview.hydration_cell.desc": "Клітина зволоження - це ваш спосіб забезпечити додаткову вологість вашим культурам. Деякі з них потребують дуже високої вологості для росту.",
  "wiki.ic2.preview.induction_furnace.desc": "Індукційна піч - це покращена електрична піч, яка може обробляти предмети швидше і до 2 одночасно за вартістю залишання під напругою і 16EU/т (1EU/т у мережі).",
  "wiki.ic2.preview.industrial_belt.desc": "Промисловий ремінь дозволяє вам нести деяку зарядку навколо ваших ніг, яку інструменти можуть використовувати під час гірничої сесії.",
  "wiki.ic2.preview.industrial_worktable.desc": "Промислова Робоча стільниця - це основний інструмент, який забезпечить вирішення всіх ваших потреб у виготовленні якнайефективніше!",
  "wiki.ic2.preview.inkbergine.desc": "Чи коли-небудь ви роздратовані листям чи травою? Інструмент для косіння приходить на допомогу! Увімкнувши його, ви дивитеся на щось, що вас роздратовує, і воно зникло! Він уникає культур.",
  "wiki.ic2.preview.input_pipe.desc": "Вхідна труба приймає рідини з зовнішніх джерел, що призводить до їх розподілу через неї. Має силу 25 блоків.",
  "wiki.ic2.preview.insertion_tube.desc": "Вставна труба надає перевагу вставці в інвентарі над рухом по іншим трубам, просто й чітко.",
  "wiki.ic2.preview.inv_card.desc": "Карта інвентаря дозволяє візуалізувати інвентар з різними режимами відображення. Хороший спосіб відстежувати інвентар!",
  "wiki.ic2.preview.iridium_stone.desc": "Потрібна персоналізована база? Камінь ірідію - ідеальне джерело для цього. Блок може бути знищений тільки його власником і він є БЕЗПЕЧНИМ ВІД ВИБУХУ!",
  "wiki.ic2.preview.iron_cable_item.desc": "Рафінований залізний кабель. Він може витримати 2048EU, але за ціною, що при цьому втрачається 1EU на кожному блоку.",
  "wiki.ic2.preview.iron_furnace.desc": "Залізна піч - це краща версія звичайної печі. Її основні покращення - швидший час приготування, що також покращує ефективність палива. \nЗалізо > Камінь.",
  "wiki.ic2.preview.item_limiter.desc": "Оновлення обмеження предметів дозволяє вам визначити, скільки предметів кожного типу можуть залишатися в конкретному інвентарі. Це може бути дуже зручним.",
  "wiki.ic2.preview.itnt.desc": "Промисловий TNT - це покращена версія TNT. Він має сильнішу силу вибуху, але працює точно так само, як TNT, і випадають усі знищені блоки! Ідеально підходить для розробки!",
  "wiki.ic2.preview.jump_boost_module.desc": "Модуль збільшення стрибка забезпечує вам сильнішу силу стрибка, щоб стрибати вище, ніж зазвичай.",
  "wiki.ic2.preview.kelp.desc": "Комбу - це ваше джерело палива під водою, яке фактично можна вирощувати на суші зараз! Масове виробництво зазвичай бажане, оскільки це дійсно надійне джерело палива. Вона також очищує воду навколо себе.",
  "wiki.ic2.preview.lag_card.desc": "Лаг-карта показує вам, скільки затримки на сервері. Це глобальна затримка.",
  "wiki.ic2.preview.lava_module.desc": "Коли ви коли-небудь хотіли гарячу ванну? Як на рахунок ванни з лавою? Модуль лави дозволяє вам плавати в лаві з постійним енергозбереженням.",
  "wiki.ic2.preview.light_module.desc": "Ви ненавидите встановлювати факели в печерах? Модуль світла - це перемикачний портативний світло. Зверніть увагу, що це фактичне світло, а не тільки рендер.",
  "wiki.ic2.preview.lily_of_the_valley.desc": "Лілія долини - це ваш типовий білий квітковий фарбник. Вона потребує постійного джерела світла 12 або більше, щоб повністю вирости.",
  "wiki.ic2.preview.limiter_tube.desc": "Трубка обмежувач - це ваш спосіб часткового розподілу сітки запитів, де деякі кольори запитів блокуються, а інші проходять.",
  "wiki.ic2.preview.liquid_generator.desc": "Генератор рідкого палива використовує рідке паливо для виробництва енергії. Виробництво значно варіюється в залежності від палива.",
  "wiki.ic2.preview.lumilia.desc": "Люмілія - це декоративна культура, яка потребує місячного світла для росту. Вона виробляє тільки листя, але випромінює світло, коли повністю виросте.",
  "wiki.ic2.preview.luminator.desc": "Люмінатор робить те, що й каже; він розсвітлює ваш день! Звісно, за невелику кількість енергії. Його також можна укласти в скло, коли клікнете на нього зі склом.",
  "wiki.ic2.preview.macerator.desc": "Макератор - це дуже корисний механізм на початку гри. Його призначення досить просте: розміщуйте руди в порошок, подвоюючи ваші слитки! Він використовує 2EU/т для цього.",
  "wiki.ic2.preview.machine_buffer.desc": "Машинний буфер - це невеликий буфер предметів, здатний використовувати модулі транспорту для сортування предметів. Дуже корисний для автоматизації.",
  "wiki.ic2.preview.machine_tank.desc": "Машинний бак - це невеликий рідкісний буфер, здатний використовувати модулі транспорту для передачі рідин. Дуже корисний для автоматизації.",
  "wiki.ic2.preview.magnetizer.desc": "Магнетайзер - це те, що стовп бульбашок для сходинок. Він заряджає залізні паркани, які піднімають вас в небо або повільно опускають, якщо ви потихеньку носите металеві чоботи!",
  "wiki.ic2.preview.malachite.desc": "Малахіт - це ваш рудний мідний врожай. Під ним повинен бути рудний/блок, щоб завершити ріст.",
  "wiki.ic2.preview.mass_fabricator.desc": "Занадто багато енергії? Не переймайтесь, Massfab вас захистить! Він використовує багато енергії, щоб створювати рожеві клякси, які називаються UU(УП) Матерія, які можна використовувати для виготовлення майже чого завгодно!",
  "wiki.ic2.preview.melon.desc": "Кавун - це щільне джерело їжі, яке виробляє кавунові кавунові скибочки, хоча є невелика ймовірність вирощування повних блоків кавунів. Його також можна налаштувати на вирощування насіння замість скибочок.",
  "wiki.ic2.preview.memory_expansion.desc": "Розширення пам'яті забезпечує Промислову Робочу стільницю до 18 нових слотів рецептури для ваших складних рецептів.",
  "wiki.ic2.preview.memory_stick.desc": "Паличка пам'яті - це розширення рецептури для Промислової Робочої стільниці та масового крафту. Вона зберігає рецептури для подальшого використання.",
  "wiki.ic2.preview.miner.desc": "Гірник - це дійсно ефективний копач. Він використовує сканери, бурові станки та гірничі трубки, щоб копати безпосередньо до руди, а не видобувати. Використання 16EU/т. Насоси взаємодіють з ним.",
  "wiki.ic2.preview.miner_remote.desc": "Дистанційний гірник - це локатор для Ракетного гірника, який визиває на його базову позицію, щоб заправитись або розвантажитись.",
  "wiki.ic2.preview.mining_laser.desc": "Гірничий лазер - це ваш передовий інструмент для копання. У нього є різні режими лазера, щоб позбутися від блоків. Він може використовуватися в шахтаря і в ньому є потужний режим зброї!",
  "wiki.ic2.preview.monitor.desc": "Монітор. Дуже корисний, повністю модульний блок, який відображає текст та інші речі на ньому. Для його роботи використовуються моніторні карти.",
  "wiki.ic2.preview.monitor_card.desc": "Карта монітора - це основа для всіх інформаційних карт, які вам потрібно, або, якщо коротко, це компонент виготовлення. Карти монітора можна налаштувати через gui.",
  "wiki.ic2.preview.mowing_tool.desc": "Чи коли-небудь ви були роздратовані листям чи травою? Інструмент для скошування приходить на допомогу! Увімкнувши його, ви дивитеся на щось, що вас роздратовує, і воно зникло! Він уникає культур.",
  "wiki.ic2.preview.nano_saber.desc": "Наношабля - це ваша зброя проти електричного бронювання. Вона завдає багато додаткових пошкоджень на молекулярному рівні. Це робить його небезпечним контр-засобом!",
  "wiki.ic2.preview.netherwart.desc": "Наріст Незеру - це протилежність Наросту. Він використовується, зокрема, для виготовлення зілля. Якщо під ним знаходиться блок з піску душ, він буде рости на 50% швидше. Також звичайний наріст перетворюється на Наріст Незеру",
  "wiki.ic2.preview.nightvision_goggles.desc": "Нічні біноклі дозволяють бачити в темряві. Але, на відміну від експериментального аналога, вони не роблять вас сліпими у яскравих місцях.",
  "wiki.ic2.preview.nuclear_reactor.desc": "Ядерний реактор - це ваша \"§lОстаточна§r §lЕнергетична§r §lДжерело!§r\". Це повністю налаштовується §mі безпечне§r! Він може задовольнити всі ваші потреби в енергії. На ризик втрати всього.",
  "wiki.ic2.preview.nuke": "Ядерна бомба",
  "wiki.ic2.preview.nuke.desc": "Ядерна бомба - дуже потужний вибух. Вона приблизно в 75 разів сильніша за звичайний TNT. Очікуйте дуже великого кратера з дуже малою кількістю предметів. Може бути розібрана ключем.",
  "wiki.ic2.preview.obscurator.desc": "Коли ви завжди хотіли побудувати твердий діамантовий будинок 9x9, але не хотіли копати, Obscurator робить свою роботу! Він може копіювати, обертати текстури та вставляти їх на будівельний пін!",
  "wiki.ic2.preview.ocean_generator.desc": "Генератор океану - це потужний виробник. Для його роботи потрібно багато води і коралових блоків, щоб зберегти чистоту. Виробляє до 100EU/т.",
  "wiki.ic2.preview.orange_tulip.desc": "Помаранчева тюльпан - частина родини тюльпанів. Виробляє помаранчеву фарбу і потребує рівня світла 12 або вище.",
  "wiki.ic2.preview.ore_scanner.desc": "Сканер руди використовує сканери та 40EU/блок, щоб показати вам точно, що/скільки та де знаходяться ваші бажані ресурси! Дійсно недооцінений!",
  "wiki.ic2.preview.overclocked_pump.desc": "Overclocked Pump - це швидший насос, який робить точно те саме з додатковим енергоспоживанням. Просто набагато швидше.",
  "wiki.ic2.preview.overgrowth_fertilizer.desc": "Цей спеціальний добриво - ваш ядерний паливо для рослин. За його допомогою швидкість росту збільшується в 256 разів протягом 5 хвилин. Це може піти жахливо неправильно.",
  "wiki.ic2.preview.oxeye_daisy.desc": "Оксай Дейзі - це дейзі, що виробляє світло-сіру фарбу. Як і всі квіти, вона потребує яскравого рівня світла.",
  "wiki.ic2.preview.painter.desc": "Художник фарбує речі. Шокуюче, я знаю... Крім того, він робить фарбу більш ефективною і може масово фарбувати блоки.",
  "wiki.ic2.preview.parachute_module.desc": "Ви падаєте з дуже високого місця, і ви знаєте, що ви померли. Ви мали б додати Парашутний модуль, який міг би цього уникнути. Шкода!",
  "wiki.ic2.preview.personal_chest.desc": "Вам подобаються ваші предмети в безпеці? Навіть якщо хтось накине бомбу на вашу базу? Особистий скарбничка захистить вас. Вона забезпечує контроль доступу і не може бути знищена!",
  "wiki.ic2.preview.personal_tank.desc": "Ви хочете свій власний персоналізований бак? Щоб ніхто не міг забрати? Особистий бак захистить вас. Він навіть дозволяє налаштувати доступ!",
  "wiki.ic2.preview.pickup_tube.desc": "Pickup tube вставляє будь-який предмет, який він торкається, в себе, з конфігурованим радіусом за допомогою §<redirect;true;Tube Tool;ic2:preview.tube_tool>. Лінії, які він кидає, повинні бути настільки добрими. Добре підходить для культур кактусів.",
  "wiki.ic2.preview.pink_tulip.desc": "Добре, ви, мабуть, втомилися від цього самоповторення. Рожевий тюльпан - це рожевий квітка, який потребує рівня світла 12 або вище і виробляє рожеву фарбу.",
  "wiki.ic2.preview.pipe.desc": "Труба для рідин - це ваш інструмент для транспортування рідин. Вона має деякі фільтри виведення та необов'язкові функції вилучення. Може висилати 20 мБ/т з міцністю 25.",
  "wiki.ic2.preview.pixelfoam": "Піксельна піна",
  "wiki.ic2.preview.pixelfoam.desc": "Піксельна піна - це дуже декоративний блок з унікальним текстурним оформленням. Деякі можуть мати спеціальні здібності!",
  "wiki.ic2.preview.plasma_cable_item.desc": "Плазмовий кабель: ОСТАННІЙ кабель! Він може працювати з 32kEU, але з втратою на кожному блоку. На цьому етапі? Хто більше турбується про втрати?",
  "wiki.ic2.preview.plasmafier.desc": "Плазмоутворювач - останній ворота до рівня LuV. Він створює плазму з 10000EU/т і UU(УП) Матерія, яке можна зберігати в порожніх акумуляторах, що використовуються для розблокування всіх елементів кінцевої гри!",
  "wiki.ic2.preview.plating.desc": "Пластини реактора дозволяють розширити межу нагрівання реактора, перш ніж він вибухне.",
  "wiki.ic2.preview.poppy.desc": "Поппі, також відомий як троянда, - це ваша базова червона квітка. Ті ж правила, як і для всіх квітів, застосовуються.",
  "wiki.ic2.preview.portable_teleporter.desc": "Портативний телепортатор - це §lабсолютний§r §lкінцевий§r. Ви можете пов'язати його з телепортером, і з одного кліку ви вже там! Використовує багато енергії!",
  "wiki.ic2.preview.potato.desc": "Картопляна культура. Ця дещо унікальна. Хоча для росту потрібно рівень світла 9 або вище, вона виробляє картоплю. Але також є дуже мала ймовірність вирощування отруйної картоплі. Це насправді цінний продукт.",
  "wiki.ic2.preview.precision_wrench.desc": "Прецизійний гайковий ключ - це останнє оновлення гайкового ключа. Він подвоює всі можливості гайки, зробивши його ефективно втратним.",
  "wiki.ic2.preview.pressure_alloy_furnace.desc": "Тископідвищувальна сплавна піч - це багатоблочне оновлення до його аналога. Вона потребує нагріву для обробки ресурсів швидше при 16EU/т.",
  "wiki.ic2.preview.pressure_pipe.desc": "Високонапірна труба - це ваша труба на велику відстань, якщо 20 міцності недостатньо. Вона збільшує її до 100 міцності.",
  "wiki.ic2.preview.progress_card.desc": "Карта прогресу показує поточний прогрес роботи машини.",
  "wiki.ic2.preview.protective_module.desc": "Отруйні речовини набридливі. На щастя, захисний модуль досить швидко їх усуває, хоча за певну ціну.",
  "wiki.ic2.preview.provider_tube.desc": "Логістична постачальницька труба, яка постачає предмети по мірі їх запиту логістичної сіткою. Багато налаштувань. Напрямок пріоритету можна встановити за допомогою TubeTool.",
  "wiki.ic2.preview.proximity_booster_pad_upgrade.desc": "Оновлення близького підсилювача дозволяє заряджати не лише предмет, який ви тримаєте в руці, але й слоти безпосередньо з ним.",
  "wiki.ic2.preview.pump.desc": "Насос - це машина, яка використовує EU, щоб висмоктати рідини безпосередньо під собою та переносити їх в контейнер для рідини. Він використовує 1EU/т і має багато особливих взаємодій.",
  "wiki.ic2.preview.pumpkin.desc": "Культура гарбуза: вона вирощує гарбузи. Нічого особливого.",
  "wiki.ic2.preview.purple_tulip.desc": "Фіолетовий тюльпан виробляє фіолетову фарбу та потребує рівня освітленості 12 або більше.",
  "wiki.ic2.preview.quarry_scanner.desc": "Сканер кар'єра перетворює шахту на кар'єр, яка розкопує все. Нехай це й не цікавиться тим, що вона фактично розкопує.",
  "wiki.ic2.preview.rainbow_flower.desc": "Радужний квітка - це дуже унікальний квітка. Він виробляє всі види фарб, але який саме він випускає, це цілком випадково. Чутки кажуть, що він також міг виробляти ляпис в дуже низькому шансі. Хоча це всього лише чутки. Також діють правила квітів.",
  "wiki.ic2.preview.ranged_pump.desc": "Дальновидний насос - це ще одне оновлення насоса, яке дозволяє витягувати рідину з набагато більшої відстані, завдяки можливості шахтаря. Він не може розкопувати. Він використовує 8EU/т.",
  "wiki.ic2.preview.rare_earth_extractor.desc": "Кубічна форма матері матері ховає в собі багато рідкісних ресурсів, таких як алюміній! Видобувач рідкоземельних металів повільно розблоковує їх для нас. На 1EU/т.",
  "wiki.ic2.preview.reactor_card.desc": "Карта реактора надає вам багато інформації про реактор. Від виробництва до часу, що залишився до закінчення урану та більше",
  "wiki.ic2.preview.reactor_fuel_cell.desc": "Топливна комірка реактора - це паливо, яке потрібно зарядити, доторкаючись до уранової вставки. Вона поглинає ізотопи, що створюються нею.",
  "wiki.ic2.preview.reactor_planner.desc": "Планувальник реактора - це симулятор, який дозволяє вам безпечно тестувати ваші реактивні установки, не ризикуючи від вибуху. Він використовує 100EU/т для симуляції дизайну реактора.",
  "wiki.ic2.preview.recycler.desc": "Рециклер використовується для усунення всіх непотрібних речей, що лежать навколо бази. Хоча він повільніший, ніж лавовий басейн, він може виробляти скрап, який можна використовувати пізніше. На 1EU/т.",
  "wiki.ic2.preview.red_mushroom.desc": "Червоний гриб - красивіший з двох. Але не кажіть це коричневому грибу. Він вирощує червоні гриби та потребує будь-якої вологості для росту.",
  "wiki.ic2.preview.red_tulip.desc": "Червоний тюльпан в основному є клоном маку. Ось і все.",
  "wiki.ic2.preview.red_wheat.desc": "Червоне пшениця - це просто сором'язлива пшениця. Вона не любить яскравості (між 5 та 12). Її продукт - це червоний камінь, тому вона дійсно цінна. Вона також може виробляти насіння, якщо вона встановлена в режимі.",
  "wiki.ic2.preview.redirector_master.desc": "Майстер-перенаправник - це дуже унікальний блок. Він може розподіляти потужність між своїми рабами на основі відсотка. Це дозволяє взяти розподіл потужності в свої руки.",
  "wiki.ic2.preview.redirector_slave.desc": "Раб-перенаправник приймає потужність від свого Майстра та намагається розподілити її. Якщо він не може цього зробити, то майбутні пакети будуть тимчасово розподілені серед інших рабів.",
  "wiki.ic2.preview.redstone_tube.desc": "Червона труба видає сигнал червоного каменю кожного разу, коли предмет проходить через неї, і як тільки у неї не залишилося предметів, сигнал зникає.",
  "wiki.ic2.preview.refinery.desc": "Рефінерія дозволяє вам переробляти ресурси в якісніші ресурси. Змішуючи предмети та рідини разом за потреби. Збільшуючи виходи руди або виробляючи високоякісне паливо.",
  "wiki.ic2.preview.reflector.desc": "Нейтронний відбивач робить уран більш ефективним, відбиваючи більше тепла, відбиваючи нейтрони назад до джерела.",
  "wiki.ic2.preview.reinforced.glass": "Підсилений скло",
  "wiki.ic2.preview.reinforced.glass.desc": "Підсилений скло - це додатково стійке скло, яке може витримати вибухи. Воно трохи слабше, ніж його кам'яний аналог.",
  "wiki.ic2.preview.reinforced.stone": "Підсилене каміння",
  "wiki.ic2.preview.reinforced.stone.desc": "Підсилене каміння міцніше за обсидіан і з кількома шарами воно може витримати вибух ядерної бомби!",
  "wiki.ic2.preview.reinforced_door.desc": "Підсилена двері - це дуже захисна двері проти вибухів. Отже, коротко кажучи, це безпечні двері!",
  "wiki.ic2.preview.request_tube.desc": "Труба запитів дозволяє запитувати предмети з підключених постачальницьких труб. Вона має багато налаштувань, наприклад, колірну кодировку, яка може бути досліджена.",
  "wiki.ic2.preview.restoring_fertilizer.desc": "Цей добриво відновлює культуру після її ядерної аналога, оскільки після цього вона мертва. Ні одне з них не може бути використано двічі.",
  "wiki.ic2.preview.rock_cutter_drill.desc": "Дробарка - це спеціалізована дриль, яку винахід Грега. Вона була оптимізована проти каменю та обсидіану, і нічого іншого. Розкопувати стопку обсидіану ніколи не було так задовільно!",
  "wiki.ic2.preview.rocket_miner.desc": "Ракетний гірник - це літаючий гірник, який шукає нові місця для копання. Крім того, ви можете надати йому заправну станцію та спосіб позбутися від сміття.",
  "wiki.ic2.preview.rotary_macerator.desc": "Роторний дробар - це покращений дробар і може руйнувати скелі набагато швидше за 16EU/т, хоча він потребує постійного сигналу, щоб залишитися на цій високій швидкості.",
  "wiki.ic2.preview.rotor": "Ротори для вітряка",
  "wiki.ic2.preview.rotor.desc": "Ротори - це те, що ви кидаєте в §<redirect;true;Вітряк;ic2:preview.windmill>, щоб він почав обертатися. Вони мають лише різну міцність.",
  "wiki.ic2.preview.round_robin_tube.desc": "Труба Раунд-Робін перерозподіляє предмети на інші сторони в потрібних кількостях; розмір стеку повністю ігнорується.",
  "wiki.ic2.preview.sapling_acacia.desc": "Бонсай дерево акації - це ваш виробник деревини/саджанців акації. Це одна з найефективніших вирощувань дерев, яку ви можете зробити. Вона потребує рівня освітленості 9 і це все.",
  "wiki.ic2.preview.sapling_birch.desc": "Бонсай дерево берези - це ваш виробник деревини/саджанців берези. Це одна з найефективніших вирощувань дерев, яку ви можете зробити. Вона потребує рівня освітленості 9 і це все.",
  "wiki.ic2.preview.sapling_dark_oak.desc": "Бонсай дерево темного дуба - це ваш виробник деревини/саджанців темного дуба. Це одна з найефективніших вирощувань дерев, яку ви можете зробити. Вона потребує рівня освітленості 9 і це все.",
  "wiki.ic2.preview.sapling_jungle.desc": "Бонсай дерево джунглів - це ваш виробник деревини/саджанців джунглів. Це одна з найефективніших вирощувань дерев, яку ви можете зробити. Вона потребує рівня освітленості 9 і це все.",
  "wiki.ic2.preview.sapling_oak.desc": "Бонсай дерево дуба - це ваш виробник деревини/саджанців дуба. Це одна з найефективніших вирощувань дерев, яку ви можете зробити. Вона потребує рівня освітленості 9 і це все.",
  "wiki.ic2.preview.sapling_spruce.desc": "Бонсай соснове дерево - це ваш виробник деревини/саджанців сосни. Це одна з найефективніших вирощувань дерев, яку ви можете зробити. Вона потребує рівня освітленості 9 і це все.",
  "wiki.ic2.preview.sawmill.desc": "Пилорама - це простий верстат. Він бурхливо рубає бруски на дошки за 2EU/т з можливістю стати ефективнішим, ніж гравець, використовуючи §<redirect;true;Оновлення пилки;ic2:preview.upgrade_efficient_sawblade>. Слідкуйте за пальцями!",
  "wiki.ic2.preview.scanner.od": "Сканер густоти руд",
  "wiki.ic2.preview.scanner.od.desc": "Сканер густоти руд показує вам, наскільки густі руди знаходяться під вами за допомогою бінарної оцінки.",
  "wiki.ic2.preview.scanner.ov": "Сканер вартості руд",
  "wiki.ic2.preview.scanner.ov.desc": "Сканер вартості руд показує вам загальну вартість руди під вами, оцінюючи її на основі вартості руд.",
  "wiki.ic2.preview.scrapbox.desc": "Скрапбокс - це неофіційний Лутбокс гри. Він має багато випадкових і рідкісних випадків. Просто переконайтеся, що не виробляєте їх масово...",
  "wiki.ic2.preview.sea_grass.desc": "Морська трава - це ваша підводна трава, яка знищує ваші культури. Оскільки трава не може рости під водою, вона заміщує їх.",
  "wiki.ic2.preview.sea_pickle.desc": "Здається, море потрапило у скруту, ну воно вирощує огірки. Морські огірки - це джерело зеленого фарбування, а також виділяє світло під водою. Це круте джерело світла. Для його вирощування потрібно яскраве місце (10 або більше).",
  "wiki.ic2.preview.shields": "Щити",
  "wiki.ic2.preview.shields.desc": "IC2 додає деякі спеціальні щити до гри, які просто додають різноманіття. Електричний використовує електрику замість тривалості.",
  "wiki.ic2.preview.simple_crop_library.desc": "Проста бібліотека культур - це ваш доступ на ранній етап до більш щільного зберігання культур. Вона може зберігати до 20 різних культур з 20 мутацій і не потребує жодної енергії.",
  "wiki.ic2.preview.simple_pipe_pump.desc": "Простий трубопровідний насос - це насос, який відправляє рідини через трубопровідну сітку. Він має міцність 100 блоків і передає 20мБ на такт.",


  "wiki.ic2.preview.simple_tube.desc": "Ваша проста труба, яка переміщує предмети. Немає багато чого що додати. Дешева і робить свою роботу.",
  "wiki.ic2.preview.singularity_compressor.desc": "Сингулярний компресор - це покращений компресор, який використовує енергію, 16EU/т, щоб накопичити достатній тиск для створення сингулярності.",
  "wiki.ic2.preview.slag_generator.desc": "Шлаковий генератор - це вдосконалений генератор, який збільшує свою потужність до 60EU/т. Крім того, він випадковим чином видає вторинний продукт - сміття.",
  "wiki.ic2.preview.slow_grinder.desc": "Повільний дробар - це високоефективний переробник, який має ефективність 100% або менше, якщо потрібні більші швидкості. За 10EU/т.",
  "wiki.ic2.preview.smoker_induction_furnace.desc": "Індукційна коптильня - це спеціалізований індукційний піч, який може швидко коптити їжу за 30EU/т. Як? Магія! Як ще?!?!",
  "wiki.ic2.preview.solar_helmet.desc": "Сонячний шолом - це ваш пасивно-переносний джерело енергії, яке заряджає вашу броню та інструменти. Не допоможе під землею!",
  "wiki.ic2.preview.solar_panel.desc": "Сонячна панель - це генератор §lБЕЗКОШТОВНОЇ ЕНЕРГІЇ§r. Забезпечує 1EU/т протягом дня. Використовуючи здавалося б нескінченну енергію сонця. Просто переконайтеся, що є резервний джерело енергії.",
  "wiki.ic2.preview.solar_panel_compressed.desc": "Що, якщо я кину свою сонячну панель у компресор? Так, саме так народжуються погані ідеї...",
  "wiki.ic2.preview.solar_turbine.desc": "Сонячна турбіна - це покращена сонячна панель. З водою вона буде виробляти до 32EU/т. Вона продовжуватиме виробляти енергію, коли охолоджується, максимізуйте її потужність.",
  "wiki.ic2.preview.sonar_module.desc": "Модуль сонару - це сканер короткого/довгого діапазону, який виділяє всі сутності в певному радіусі. Може стати корисним, якщо ви шукаєте щось. Крутий ефект включено.",
  "wiki.ic2.preview.sound_beacon.desc": "Звуковий маячок - це ваш спосіб контролювати звуки IC2. Оскільки вони особливі, це дозволяє створювати мікроплями шумових редукторів/підсилювачів. Використовує оновлення.",
  "wiki.ic2.preview.speed_boost_module.desc": "Модуль прискорення дозволяє вам рухатися зі швидкістю звуку. Просто не врізайтесь у стіни.",
  "wiki.ic2.preview.speed_tube.desc": "Швидкісна труба впевнена, що ваші предмети швидко рухаються в вашому світі.",
  "wiki.ic2.preview.splitter_cable_item.desc": "Роздільний кабель. Він може використовуватися як ваш вимикач для з'єднання через червоний камінь. Він працює з 2048EU і втрачає енергію кожні 2 блоки.",
  "wiki.ic2.preview.splitter_pipe.desc": "Розгалужувачева труба - це службова труба, яка відключає всі з'єднання, коли її живить електрика, але з'єднує їх негайно після того, як сигнал червоного каменю зникає.",
  "wiki.ic2.preview.stacking_tube.desc": "Складальна труба - це труба, яка споживає всі предмети та складає їх до потрібного розміру. Потім виводить їх в потрібний бік.",
  "wiki.ic2.preview.stannum.desc": "Станнум - це ваш гнучкий олов'яний рудний врожай. Олово використовується практично скрізь. Для його вирощування потрібно мати руду/блок відповідного металу під ним, просто й чітко.",
  "wiki.ic2.preview.static_boots.desc": "Заземлені чоботи - це те, що діти завжди роблять, коли вони дізнаються, що килими можна використовувати для виклику шоків. Ви отримуєте невелике виробництво EU за кілька пройдених блоків.",
  "wiki.ic2.preview.steam_reactor.desc": "Паровий реактор - це §lНайкраще§r §lОновлення§r до реактора. Він додає ризику, але приносить багато винагороди. Виробництво енергії набагато вище, за рахунок відсутності простору для помилок.",
  "wiki.ic2.preview.steam_tunnel.desc": "Паровий тунель - це багатоблочне джерело енергії, яке виробляє цілих 2048EU/т в пакетах по 512EU для до 4096мБ пари. Повертаючи воду.",
  "wiki.ic2.preview.steam_turbine.desc": "Парова турбіна - це ваш спосіб виробляти EU з пари. Вона виробляє 32EU/т з 64мБ пари, не повертаючи воду. Використання §<redirect;true;Паливного котла;ic2:preview.fuel_boiler> як джерела додає 8EU/т.",
  "wiki.ic2.preview.steam_vent.desc": "Паровий вихід використовує воду з реактора, щоб створити пар. Чим гарячіші вони, тим ефективніше вони працюють.",
  "wiki.ic2.preview.step_assist_module.desc": "Всі люблять підйом допомоги. Ось модуль для цього. Хоча за це доводиться платити невелику ціну.",
  "wiki.ic2.preview.stickreed.desc": "Резинова тростина - найцінніший врожай серед усіх врожаїв, оскільки він виробляє липку смолу масово. Якщо у вас завжди закінчується гумка, це вирішує всі ваші проблеми. Просто досить важко отримати, але без спеціальних вимог.",
  "wiki.ic2.preview.sticky_dynamite.desc": "Липкий динаміт - це форма динаміту, який призначений лише для метання та прилипає до першого блоку, який йому зустрічається. В інших випадках він функціонує так само, як звичайний динаміт.",
  "wiki.ic2.preview.sticky_tube.desc": "Клейка труба - це дійсно класна труба, вона прилипає скрізь! Жарти на стороні, вона дозволяє вам видобувати смолу із відра на вашому гумовому дереві! Більше не літає смола, вуууууу!",
  "wiki.ic2.preview.stone_canner.desc": "Кам'яний наповнювач - це кухонний комбайн, який збільшує цінність їжі для використання бляшаних банок. Вони дають одну порцію їжі з банки, але й також лікують.",
  "wiki.ic2.preview.stone_macerator.desc": "Кам'яний подрібнювач - дуже примітивний подрібнювач, який працює на вугіллі. Він жахливо неефективний, але дозволяє подвоювати руду на ранніх стадіях.",
  "wiki.ic2.preview.storage_expansion.desc": "Розширення: Буферне сховище додає ще 18 слотів до Промислового робочого столу, просто і зрозуміло.",
  "wiki.ic2.preview.su_battery.desc": "Батарейка - невеликий, але корисний інструмент, який дає 1000 EU за трохи червоного каменю та вугілля. Дозволяє швидко отримати енергію без будівництва генераторів.",
  "wiki.ic2.preview.sugarcane.desc": "Цукрова тростина - дуже швидкозростаюча культура. З неї отримують цукрову тростину і вона є селекційним матеріалом для очерету. Подейкують, що на піску очерет росте швидше, ніж на ґрунті. Інші чутки стверджують протилежне. Ніхто не знає, яка з них правдива.",
  "wiki.ic2.preview.super_cable_item.desc": "Супер-кабель. Завдяки силі пива ви можете передати 8192EU через 1000 блоків до того, як виникнуть будь-які втрати. Хтось може сказати, що це все ще занадто дешево!",
  "wiki.ic2.preview.sweet_berry_bush.desc": "Солодкі ягоди - це ідеальне джерело їжі для початку гри, яке може вжалити вас, якщо ви не будете обережними. В іншому вони не мають жодних вимог.",
  "wiki.ic2.preview.switch_tube.desc": "Труба перемикач. Робить те, що сказано. Якщо він отримує сигнал червоного каменю, він просто замикає всі з'єднання, поки сигнал не зникне.",
  "wiki.ic2.preview.tank.desc": "Бак це модульний контейнер для рідини, який можна побудувати з великої кількості блоків. Це може бути до 50x200x50 блоків. Він використовує клапани, з якими можна взаємодіяти.",
  "wiki.ic2.preview.tank_storage_module.desc": "Що скажете, якщо ми перетворимо ваш обладунок на портативну ємність? Саме це і робить модуль сховища бака. Нічого особливого.",
  "wiki.ic2.preview.tea.desc": "Чай - для тих, хто хоче розслабитися. Він виробляє чайне листя, з якого можна зробити різні види чаю. Більшість любителів чаю не люблять каву. Для зростання потрібен рівень освітленості 7 або вище.",
  "wiki.ic2.preview.teleport_tube.desc": "Телепортаційна труба. Вона надсилає / отримує предмети до/від інших бажаних телепортаційних труб. Логістичні запити не будуть надсилатися через неї. Працює між вимірами.",
  "wiki.ic2.preview.teleporter.desc": "Телепортер - це ваш інструмент для телепортації на великі відстані, який вимагає божевільної кількості енергії. Ось чому він повинен знаходитися поруч з накопичувачами енергії.",
  "wiki.ic2.preview.teleporter_hub.desc": "Що якби ви об'єднали телепортер та базовий телепортер? Так, ви отримаєте телепортаційний хаб! Це по суті телепортер \"оберіть мету\". Використовує багато енергії!",
  "wiki.ic2.preview.terraformer.desc": "Світ не такий, як ви хочете? Ви хочете його змінити? Терраформер прийде на допомогу. Він має здатність змінювати світ. За тисячі EU/т.",
  "wiki.ic2.preview.terrawart.desc": "Земний наріст - дуже корисний предмет. Його легко отримати, поклавши блок снігу під нетервартом. Блок снігу також прискорює зростання на 50%. З'їдений Земний наріст видаляє всі погані ефекти зілля з вас.",
  "wiki.ic2.preview.tesla_coil.desc": "Котушка Тесли - це шокер! Буквально. Вона накопичує заряд, і коли поруч знаходиться жива істота, вона випускає заряд, щоб уразити її на смерть. Корисно для млинів мобів.",
  "wiki.ic2.preview.text_card.desc": "Текстова картка показує якийсь текст, який ви можете набрати тут. Також підтримується Tab (буде перетворено на пробіли).",
  "wiki.ic2.preview.tfbp.desc": "КрТФ терраформера вирішує, як працює терраформер. Це синій проект зміни навколишнього середовища. Вони дуже дорогі.",
  "wiki.ic2.preview.tfbp_biome.desc": "КрТФ Місцевості терраформера вирішує, як працює терраформер. Він змінює біом, в якому ви знаходитеся. Вони також дуже дорогі.",
  "wiki.ic2.preview.tfbp_biome_chilling.desc": "КрТФ Місцевість - Охолодження, змінює біом на снігову тундру.",
  "wiki.ic2.preview.tfbp_biome_cultivation.desc": "КрТФ Місцевість - Культивування, змінює біом на рівнинний.",
  "wiki.ic2.preview.tfbp_biome_desertification.desc": "КрТФ Місцевість - Опустелення, змінює біом на пустельний.",
  "wiki.ic2.preview.tfbp_biome_forestification.desc": "КрТФ Місцевість - Лісовідновлення, змінює біом на лісовий.",
  "wiki.ic2.preview.tfbp_biome_irrigation.desc": "КрТФ Місцевість - Зрошення, змінює біом на болотний.",
  "wiki.ic2.preview.tfbp_biome_mushroom.desc": "КрТФ Місцевість - Грибна, змінює біом на грибні поля.",
  "wiki.ic2.preview.tfbp_biome_undergrowth.desc": "КрТФ Місцевість - Підлісок, змінює біом на джунглі.",
  "wiki.ic2.preview.tfbp_chilling.desc": "КрТФ - Охолодження створює зимову казку.",
  "wiki.ic2.preview.tfbp_cultivation.desc": "КрТФ - Культивування перетворює ваш район на рівнинне поле з вирощуванням врожаю та квітів.",
  "wiki.ic2.preview.tfbp_desertification.desc": "КрТФ - Опустелення перетворює ділянку на пустелю.",
  "wiki.ic2.preview.tfbp_flatification.desc": "КрТФ - Площинність вирівнює місцевість навколо себе до рівня терраформера по осі Y. Або заповнюючи відсутні блоки, або видаляючи блоки.",
  "wiki.ic2.preview.tfbp_irrigation.desc": "КрТФ - Зрошення перетворює ваш район на дощовий ліс.",
  "wiki.ic2.preview.tfbp_mushroom.desc": "КрТФ - Грибна перетворює ваш район на грибний острів. Включно зі стосами грибів!",
  "wiki.ic2.preview.thermal_generator.desc": "Термальний генератор - це оновлений геотермальний генератор. Виробляє 90EU/т, паливо триває на 50% довше. Він також виробляє пасивну потужність на основі температури цієї області.",
  "wiki.ic2.preview.thermometer.desc": "Термометр - це ваш інструмент для реакторів. Він дозволяє побачити, наскільки гарячий реактор у цей момент. Ця інформація може бути життєво важливою.",
  "wiki.ic2.preview.time_card.desc": "Картка часу. Вона показує ігровий час, серверний час, ваш час і галактичний час... Чекайте, не той .Але він показує час.",
  "wiki.ic2.preview.tin_cable_item.desc": "Олов’яний кабель. Це дуже дешевий, але слабкий провідник енергії. Він може витримати тільки 5EU, але втрати відсутні для 40 блоків. Ідеально підходить для сонячних електростанцій або водяних млинів!",
  "wiki.ic2.preview.tool_box.desc": "Інструменти - це ваше переносне сховище для інструментів / їжі, які ви не використовуєте так часто, але все одно потрібні. Є різних розмірів.",
  "wiki.ic2.preview.tools.aluminium": "Інструменти з алюмінію",
  "wiki.ic2.preview.tools.aluminium.desc": "Алюміній знаходяться між Діамантом та Залізом. Мають меншу міцність, але легше",
  "wiki.ic2.preview.trade_o_mat.desc": "Трейд-О-Мат дозволяє обмінювати предмети на інші предмети або монети, для роботи потрібен підключений Персональний Скринь, дозволяє автоматизовану торгівлю",
  "wiki.ic2.preview.transformer": "Трансформатор",
  "wiki.ic2.preview.transformer.desc": "Трансформатор дозволяє керувати пакетами енергії, що протікають по мережі, 1 великий пакет перетворюється на 4 менших",
  "wiki.ic2.preview.transformer_adjustable.desc": "Регульований трансформатор - це повністю налаштовуваний трансформатор. Його не можна інвертувати, але він може виробляти до 32 пакетів будь-якого розміру.",
  "wiki.ic2.preview.transport_tube.desc": "Транспортний трубопровід з'єднується лише з іншими трубами. Інвентарі будуть проігноровані.",
  "wiki.ic2.preview.tree_tap.desc": "Краник - це ваш інструмент для видобутку липкої смоли з гумових дерев. Просто будьте обережні, щоб не перетаплювати дерева.",
  "wiki.ic2.preview.treetap_and_bucket.desc": "Краник і відро - це дуже корисний блок, який можна прикріпити до гумових дерев для автоматичного збору урожаю. Вони зберігають 5 смоли і прискорюють ріст смоли.",
  "wiki.ic2.preview.tube_coral.desc": "Трубковий корал - це підводний врожай, який можна використовувати для вирощування коралових блоків. Він має шанс виробляти всі варіанти трубкових коралів. Це припущення, що він живий. Для зростання потрібна чиста вода (3 або більше).",
  "wiki.ic2.preview.tube_tool.desc": "Конфігуратор труб - це ваш доступ до деяких функцій труб. Ці функції значно розширюють контроль над ними.",
  "wiki.ic2.preview.upgrade.kit.pad": "Комплекти оновлення зарядних підкладок",
  "wiki.ic2.preview.upgrade.kit.pad.desc": "Комплекти оновлення зарядних підкладок дозволяють оновлювати зарядні підкладки без їх заміни.",
  "wiki.ic2.preview.upgrade.kit.storage": "Комплекти оновлення енергоефективності",
  "wiki.ic2.preview.upgrade.kit.storage.desc": "Комплекти оновлення енергоефективності дозволяють оновити попереднє енергоефективне сховище до бажаного нового рівня.",
  "wiki.ic2.preview.upgrade_basic_fluid_export.desc": "Просте оновлення виведення рідини в основному виштовхує 100 мБ на такт з машини. Може бути накладено до 9 елементів.",
  "wiki.ic2.preview.upgrade_basic_fluid_import.desc": "Просте оновлення імпорту рідини в основному втягує 100 мБ на такт з рідкісного резервуара. Може бути накладено до 9 елементів.",
  "wiki.ic2.preview.upgrade_cobble_generator.desc": "Покращення: Генерації каміння виробляє камінь у вхід машини з швидкістю 1 предмет на секунду. Може бути накладено слоями по кількості.",
  "wiki.ic2.preview.upgrade_container.desc": "Контейнер для оновлення в основному є розширенням оновлення. У ньому є 3 слоти для оновлення, які машина може використовувати. Хоча неприпустимі оновлення вимкнені.",
  "wiki.ic2.preview.upgrade_crafting.desc": "Оновлення для крафту збирає предмети разом і експортує їх в підключений інвентар. Швидкість крафту динамічна в залежності від того, наскільки швидко інвентар надає предмети.",
  "wiki.ic2.preview.upgrade_creative.desc": "Творче оновлення призначене тільки для творчого використання. Забезпечує енергоефективність / рівень / швидкісне оновлення.",
  "wiki.ic2.preview.upgrade_durable_sawblade.desc": "Довговічний пилковий диск - це тільки оновлення для пилорами. Машина отримує +400% швидкості, а вихід збільшується на 2 предмети за вартість +2EU/т",
  "wiki.ic2.preview.upgrade_efficiency.desc": "Оновлення ефективності робить машини набагато ефективнішими. Споживання енергії зменшується на 5%. Допускається кілька стеків в кожній машині.",
  "wiki.ic2.preview.upgrade_efficient_sawblade.desc": "Ефективний пилковий диск - це тільки оновлення для пилорами. Машина отримує +200% швидкості, а вихід збільшується на 4 предмети за вартість +1EU/т",
  "wiki.ic2.preview.upgrade_energy_storage.desc": "Оновлення енергозбереження розширює внутрішній буфер на +10000EU.",
  "wiki.ic2.preview.upgrade_energy_storage_multiplier.desc": "Оновлення множника енергозбереження подвоює поточний внутрішній буфер енергії.",
  "wiki.ic2.preview.upgrade_exp_collector.desc": "Оновлення колекції додаткового досвіду збирає додатковий EXP з машин. Воно має обмеження у 5000XP запасу та ефективність у 50% його збору.",
  "wiki.ic2.preview.upgrade_export.desc": "Оновлення експорту - це розширене оновлення ІО. Воно може бути фільтроване, і воно використовує EU для виведення набагато більше предметів одночасно",
  "wiki.ic2.preview.upgrade_field_upgrade": "Оновлення поля розширення",
  "wiki.ic2.preview.upgrade_field_upgrade.desc": "Оновлення поля розширення збільшує радіус зарядження зарядної підкладки.",
  "wiki.ic2.preview.upgrade_fluid_export.desc": "Оновлення експорту рідини - це розширене оновлення ІО. Воно може бути фільтроване і використовує EU для виведення 10-кратного обсягу його простішого варіанту.",
  "wiki.ic2.preview.upgrade_fluid_import.desc": "Оновлення імпорту рідини - це розширене оновлення ІО. Воно може бути фільтроване і використовує EU для виведення 10-кратного обсягу його простішого варіанту.",
  "wiki.ic2.preview.upgrade_import.desc": "Оновлення імпорту - це розширене оновлення ІО. Воно може бути фільтроване і використовує EU для витягування набагато більше предметів одночасно",
  "wiki.ic2.preview.upgrade_loudness.desc": "Оновлення гучності робить машину гучнішою. Якщо вона має максимальну гучність, то її буде чути далі.",
  "wiki.ic2.preview.upgrade_muffler.desc": "Оновлення звукоізоляції робить машину тише. Таким чином, її все ще можна чути, але менше дратує.",
  "wiki.ic2.preview.upgrade_mute.desc": "Оновлення вимкнення вимикає звук машини.",
  "wiki.ic2.preview.upgrade_overclocker.desc": "Оновлення Overclocker робить машину набагато швидше, ніж раніше. Воно забезпечує 30% збільшення швидкості за 60% більше споживання енергії.",
  "wiki.ic2.preview.upgrade_quantum_overclocker.desc": "Квантове оновлення Overclocker - це оновлення кінцевої гри. Воно робить машину на 60% швидше за 30% збільшення споживання енергії.",
  "wiki.ic2.preview.upgrade_redstone_inverter.desc": "Оновлення Redstone Inverter інвертує вимоги червоного каменю. Якщо потрібний сильний сигнал, то тепер потрібний слабкий.",
  "wiki.ic2.preview.upgrade_redstone_sensitivity.desc": "Оновлення чутливості до червоного каменю перемикає, чи є у машини які-небудь вимоги червоного каменю. Забезпечення багатшого контролю.",
  "wiki.ic2.preview.upgrade_simple_export.desc": "Просте оновлення експорту повільно виводить предмети з машини. 1 Предмет за секунду/операція. Це можна накладати до 9 елементів.",
  "wiki.ic2.preview.upgrade_simple_import.desc": "Просте оновлення імпорту повільно вводить предмети в машину. 1 Предмет за секунду/операція. Це можна накладати до 9 елементів.",
  "wiki.ic2.preview.upgrade_slowness.desc": "Оновлення повільності - це дійсно маловикористовуване оновлення. Воно зменшує швидкість виробництва машини наполовину і знижує потреби в енергії на 40%.",
  "wiki.ic2.preview.upgrade_transformer.desc": "Оновлення трансформатора піднімає максимальний рівень потужності машини, який вона може приймати.",
  "wiki.ic2.preview.uranium_enricher.desc": "Урановий енрішер - це машина, яка поєднує уран з екзотичними матеріалами і 250EU/t, щоб створювати дуже дивні варіанти урану. Це робить життя цікавішим.",
  "wiki.ic2.preview.uranium_rod_blaze_single.desc": "Вогняний урановий стержень. Він виробляє надзвичайну кількість тепла. Корисно для парових реакторів.",
  "wiki.ic2.preview.uranium_rod_charcoal_single.desc": "Вугільний урановий стержень. Довгострокове, але повільне виробництво палива. Дуже підходить для довгострокових установок.",
  "wiki.ic2.preview.uranium_rod_ender_pearl_single.desc": "Ендеровий урановий стержень. Він має далекосяжний вплив на області, які він може впливати.",
  "wiki.ic2.preview.uranium_rod_isotopic.desc": "Ізотопні стержні - це стержні, які готові бути повторно збагаченими в реакторі.",
  "wiki.ic2.preview.uranium_rod_near_depleted.desc": "Порожні клітини є відходами від уранових стержнів. Можуть бути знову запалені на повний уран.",
  "wiki.ic2.preview.uranium_rod_nether_star_single.desc": "Незірковий стержень. Виробляє тони енергії та тепла. Важко володіти!",
  "wiki.ic2.preview.uranium_rod_re_enriched.desc": "Переочищені уранові стержні - це племінний уран, який можна використовувати в реакторі.",
  "wiki.ic2.preview.uranium_rod_redstone_single.desc": "Червоний камінь Урановий стержень дуже пульсуючий. Виробляє 2x кількість ізотопів. Працює трохи гаряче.",
  "wiki.ic2.preview.uranium_rod_single.desc": "Дуже базовий урановий стержень. Виробляє стандартну кількість енергії. Нічого особливого.",
  "wiki.ic2.preview.uu_crop_library.desc": "Бібліотека культур UU-Матерія - це оновлена Бібліотека культур, яка має можливість створювати вже відомі мутації культур з UU(УП) Матерія та енергії. Це не дешево!",
  "wiki.ic2.preview.uu_expansion.desc": "Розширення матерії дозволяє використовувати UU Matter ефективніше. Воно також забезпечує ресурси, які можуть бути недоступні для виготовлення. 9 може бути вибрано з.",
  "wiki.ic2.preview.vacuum_canner.desc": "Вакуумний консервант - це високошвидкісний консервант, який створює вакуум, щоб упаковувати більше ресурсів і швидше їх упаковувати. Він використовує 16EU/t.",
  "wiki.ic2.preview.valve.desc": "Простий багатоцільовий клапан, який дозволяє зовнішній взаємодії з багатоблочними резервуарами. Може використовуватися з Obscurator.",
  "wiki.ic2.preview.valve_animated.desc": "Анімований клапан - це невелике візуальне оновлення клапана. Він показує потік у бак і те, що втікає.",
  "wiki.ic2.preview.valve_pushing.desc": "Тисковий клапан - це оновлення для звичайного клапана, де він автоматично відкачує рідини. Він також може працювати з трубчастою сіткою.",
  "wiki.ic2.preview.valve_teleporting.desc": "Телепортуючий клапан - це клапан, який з'єднується з одного бака до іншого за допомогою прямого транслятора частот. Гайка може встановити його у режимі випромінювання. Випромінюючи 100 мБ/т вмісту в інший бак!",
  "wiki.ic2.preview.venomilia.desc": "Веномілія - це хитрий фіолетовий квітка. Якщо ви збиратимете чи вб'єте цю квітку, то може отримати велику кількість отруйності. Ви не можете використовувати цю рослину для створення UU-Матерії.",
  "wiki.ic2.preview.water_mill.desc": "Водяний млин - це перший тип генератора універсального стандартного генератора, який вам вибирати. Він використовує воду, ріку або сніг, якщо це працює.",
  "wiki.ic2.preview.water_mill_small.desc": "Малий водяний млин - це адаптація водного млина. Він менше генерує, але його легше зробити.",
  "wiki.ic2.preview.water_mill_ultimate.desc": "Верховний водяний млин - це найпотужніший водяний млин. Він генерує 1,000EU/t.",
  "wiki.ic2.preview.water_mill_waterwheel.desc": "Водяне колесо - це простий генератор енергії, який працює на потоці води. Він може бути поліпшений для більшої ефективності.",
  "wiki.ic2.preview.water_splitting.desc": "Розділення води - це машина, яка розділяє воду на водень і кисень. Вона виробляє значну кількість енергії.",
  "wiki.ic2.preview.water_unit.desc": "Універсальна водна одиниця - це сира кришталева вода. Вона використовується для вирощування трубкових коралів.",
  "wiki.ic2.preview.wind_mill.desc": "Вітряк - це генератор, який використовує вітер, щоб створювати електроенергію. Він не потребує пального, але працює тільки в певних місцях.",
  "wiki.ic2.preview.wind_mill_offshore.desc": "Офшорний вітряк - це вітряк, який створюється в естетичних цілях, але не більше того.",
  "wiki.ic2.preview.wind_mill_small.desc": "Малий вітряк - це більш маленький вітряк, який не такий потужний, як великий вітряк, але він все ще здатний створювати електроенергію.",
  "wiki.ic2.preview.wind_mill_ultra.desc": "Ультра вітряк - це великий вітряк, який може створювати значну кількість енергії. Він також має досить велику базову продукцію.",
  "wiki.ic2.preview.wind_unit.desc": "Вітряна одиниця - це сира кришталева вода. Вона використовується для вирощування трубкових коралів.",
  "wiki.ic2.preview.wireless_transmitter.desc": "Бездротовий передавач - це простий блок для того, щоб передавати потужність через повітря, не використовуючи дроти. Він рекомендується для збільшення потужності енергії або ефективності виробництва.",
  "wiki.ic2.preview.world_accelerator.desc": "Світовий прискорювач - це гіпершвидкий генератор, який використовує велику кількість енергії. Він також прискорює все на світі.",
  "wiki.ic2.preview.world_item_scanner.desc": "Сканер світових предметів - це сканер, який розглядає всі предмети на світі. Це дає вам можливість переглядати їх у інтерфейсі.",
  "wiki.ic2.preview.world_text_scanner.desc": "Світовий текстовий сканер - це сканер, який розглядає всі текстові елементи на світі. Це дає вам можливість переглядати їх у інтерфейсі.",
  "wiki.ic2.subpage.addons.head": "IC2C Аддони",
  "wiki.ic2.subpage.brewing.head": "Виробництво напоїв",
  "wiki.ic2.subpage.brewing.body": "Ти, напевно, побачив пивоварні вироби і хочеш зрозуміти, як це працює.\n\n\nПивоваріння дуже просте, але займає багато часу.\nСенс цього тільки один - поглинати час.\nЭто нудне заняття, але ви зможете зайнятися іншими справами, поки чекаєте. §<newPage>§<header;Вступ;true>\nЩоб зібрати діжку, вам потрібно її скрафтити і помістити на Дерев'яні Ліси.\nДля відображення складу і віку продукту в діжці, використовуйте §<redirect;true;Термометр;ic2:preview.thermometer>.\nКоли ж процес бродіння буде завершено, відкрийте діжку за допомогою §<redirect;true;Краника;ic2:preview.tree_tap>.\nВсе настільки просто. Для більшої зручності, використовуйте термометр.\n\nІснують 4 режими варіння:\n- Ром\n- Пиво\n- Віскі\n- Зілля§<newPage>§<header;Ром;true>\nРом приготувати дуже легко.\nПросто засуньте Цукрову Очеретянку та чекайте, доки вона приготується! \n\nВсього за кілька хвилин реального часу, порівняно з іншими.§<newPage>§§<header;Пиво;true>\nПиво приготувати теж дуже легко.\nВам потрібен Хміль, Пшениця і вода, можна по 32 шт. за раз. Все, чекайте! Пропорція Хміль/Пшениця вирішує рівень % алкоголю, тоді як пропорція Пшениця/Вода - щільність напою. Вода збільшує кінцевий об'єм. Рівень % алкоголю вирішує, який ефект ви отримаєте, його тривалість визначить щільність напою, а сила ефекту - якість приготування. \nНайвища якість приготування триває 8 годин, а після 10 днів вона псується.§<<newPage>§<header;Приготування Віскі;true>\nПриготування Віскі дуже схоже на приготування Рому.\nПросто ставиш воду і Солод Віскі і чекаєш.\nБагатого чекаєш!\nКаждий день реального часу дорівнює 1.4 рокам. Тиждень - 10 років.\nОдно добре, він не псується.\nНатиснувши на бочку, буде виводитися округлений рік.§<newPage>§<header;Хиткі ефекти;true>\nпВживання Віскі змушує п'яніти (та годі).\nІ що це зазвичай тягне за собою? \nПрямо ходити стає неможливо.\n\n\nПривітання, ви відчуваєте п'яне почуття в грі (Хехе).§<newPage>§<header;Хиткі ефекти;true>\nПоки ви під цим ефектом, ваше пересування не постраждає, а ось одержати удар від будь-кого важче (зазвичай навпаки).\nТ.е. вас забирає настільки, що тактика \"п'яного майстра\" здається чудовим захистом. §<newPage>§<header;Приготування Зілля;true>\nПриготування зілля теж дуже просте.\n\nЯк і звичайна варильна стійка, але в промислових масштабах.\nПросто поставте інгредієнти у великій кількості і все готово. Наприклад, для Зілля Вогнестійкості вам потрібно:\nНезерський наріст, Згусток Магми і вода.\n\nВода почне процес.\n\n\nТакож можете заздалегідь кинути до 20 шт червоного каменю або світлокам'яного пилу.\n- §ІКрасний камінь§r: Збільшує час (до 30 хвилин)\n\n\n\n- §ІСвітлокам'яний пил§r: Збільшує рівень (до 3 рівня).\n\nАле варто врахувати, що кожен додатковий рівень зменшує тривалість процесу. рівень зменшує тривалість удвічі.\n\nЯкість залежить від тривалості й рівня.§<newPage>§§<header;Одержання зілля;true>\nНайкраща якість досягається приблизно за 4 години. \n\nМи можемо разом отримати до 12 пляшечок або 120 стріл з зіллям.\n\nЦього вистачить, поки вариться нова партія.§<newPage>§<header;Переварювання зілля;true>\nПісля 20 годин варіння зілля псується і перетворюється на отруйну хмару поряд із діжкою під час відкриття, тож не треба залишати його без нагляду.\n\nЦе стосується тільки зіллів!",

  "wiki.ic2.subpage.chunkloader.head": "Провантажувач",
  "wiki.ic2.subpage.chunkloader.body": "Провантажувач простий у використанні, але для його роботи потрібна енергія.\n\nВін має 4 різні налаштування діапазону:\n\n§l0§r: Локальний чанк: 5EU/т\n§l1§r: Локальний чанк + 1 радіус чанка: 15EU/т\n§l2§r: Локальний чанк + 2 радіуси чанків: 60EU/т\n§l3§r: Локальний чанк + 3 радіуси чанків: 300EU/т",
  "wiki.ic2.subpage.chunkloader.body2": "Провантажувач забезпечує завантаження всіх сутностей та плиток-сутностей у межах області.\n\nЄ також можливість увімкнути 'Чанкові Тики'.\n\nЦе дозволяє випадковим чином виконувати дії всередині чанків, такі як зростання культур.\nПроте витрати EU/т подвоюються.",
  "wiki.ic2.subpage.colossal_machine.body": "Колосальна машина - це динамічний пристрій, який можна побудувати як структуру 2x2x2, 3x3x3 або 4x4x4.\n\nЗ головним блоком у верхньому лівому куті відповідно до обличчя.\n\nКожне оновлення подвоює потужність слотів попереднього. Вона споживає 25 мілілітрів води на операцію і виділяє пару як відходи.",
  "wiki.ic2.subpage.colossal_machine.compressor": "Колосальний компресор",
  "wiki.ic2.subpage.colossal_machine.extractor": "Колосальний екстрактор",
  "wiki.ic2.subpage.colossal_machine.furnace": "Колосальна піч",
  "wiki.ic2.subpage.colossal_machine.macerator": "Колосальний подрібнювач",
  "wiki.ic2.subpage.colossal_machine.recycler": "Колосальний утилізатор",
  "wiki.ic2.subpage.crop.body": "IC2C має систему культур.\nВи можете вирощувати, хрестити і збирати культури за вашим бажанням.\n\nНа відміну від свого ванільного аналога, культури IC2 не ґрунтуються на випадковій системі тактів Minecraft.\nАле вони мають стійкий такт.\n§<newPage>§<header;Статистика культур;true>\nКультури ростуть кожні 256 тактів (12.8 секунд).\nНаскільки вони ростуть, визначається багатьма факторами та невеликою випадковістю.\n\nКультури IC2 також можуть бути розміщені під водою.\nХоча деякі культури можуть або не виживуть під водою.\nІнші, навпаки, не люблять свіжого повітря.§<newPage>§<header;Статистика культур;true>\nТак які статистики насправді мають культури? §<image;ic2:textures/wiki/crops/stats.png;33;20;78>\n§<padding;2>\n- §lЗріст§r: Збільшує швидкість росту\n- §lУрожайність§r: Додаткові врожаї\n- §lСтійкість§r: Збільшує захист\n\nВсі ці 3 статистики можуть бути від 0 до 31, чим вище статистика, тим більше догляду потрібно культурі.§<newPage>§<header;Попередження про статистику;true>\nВаш головний мета - підняти статистику, але тримати її нижче 24.\nЯкщо ви перевищите 24 для кожної статистики, є серйозні недоліки, які можуть зіпсувати ваше поле культур.\nТакож, якщо статистика занадто висока і догляду недостатньо, культури також можуть померти від голоду.\nТому, якщо ви виводите статистику вище, слідкуйте, щоб культура фактично могла рости без додаткового догляду.§<newPage>§<header;Статистика Зростання;true>\n§lСтатистика Зростання§r збільшує швидкість росту культури.\nЦе означає, що кожен такт культури збільшується набагато більше, ніж без високої цієї статистики.\n\nКоли статистика досягає рівня 24, культура стає «Схожою на бур’ян».\nХоча вона не самознищується, вона атакує інші культури, які не є «Схожими на бур’ян».§<newPage>§<header;Статистика Урожайність;true>\n§lСтатистика Урожайність§r збільшує врожаї.\nЦе може бути величезним, коли збирається вручну, де декілька культур може дати купи продуктів.\nАвтоматичний збір не дозволить отримати такий великий приріст урожаю, але все одно суттєво збільшить його.\n\nКоли статистика досягає 24 або вище, вона зменшує шанс отримання додаткових сумок з насінням.§<newPage>§<header;Статистика Стійкість;true>\n§lСтатистика Стійкість§r збільшує стійкість проти бур’яну.\nНа рівні 31 його не можна взяти під контроль бур’яну.\n\nАле коли статистика перевищує 28, це зменшує ймовірність участі в хрестопилінні.§<newPage>§<header;Поліпшувачі культур;true>\nКультури впливають на середовище §<image;ic2:textures/wiki/crops/environment.png;33;20;78>\n§<padding;2>\nЦі 3 статистики масово підвищують швидкість росту культур і забезпечують, що вони не голодують.\nКожен біом надає кілька бонусів / недоліків в залежності від того, звідки ви.§<newPage>§<header;Поліпшувачі культур;true>\nНаприклад, Неземля - жахливе місце для Вологості, тоді як океани діють на нього дивовижно.\n\nЗолоте правило: чим вище, тим краще.§<newPage>§<header;Поживні речовини / Вологість;true>\nПоживні речовини та вологість обидва залежать від Підземелля / Підгрунття нижче.\nЇх можна підвищити в залежності від того, в якому біомі вони знаходяться, або за допомогою Добрива чи Гідратації.§<newPage>§<header;Середовище;true>\nКультури також потребують здорового середовища для швидкого росту.\nЄ 3 фактори, щоб підвищити якість середовища.\n- §lДоступ до неба§r\n- §lПростір§r: Відсутність твердих блоків або культур навколо себе.\n- §lВисота§r: До певного рівня вищі висоти допомагають підвищити якість середовища.§<newPage>§<header;Середовище під водою;true>\nКультури під водою також потребують гарного середовища.\nЦе трохи складніше створити.\nЄ кілька способів підвищити його.\n- §lГлина§r: Наявність глини в навколишньому ґрунті незначно підвищує його.\n- §lОчищення культур§r: Деякі культури очищають воду навколо себе.\n- §lКолони з бульбашками§r: Забезпечують чудове середовище.§<newPage>§<header;Хрестопилля культур;true>\nХрестопилення - серце системи культур.\n\nІ це може бути досить прямолінійним.\nРозмістіть 2-4 культури навколо культурного палички, на якій ви хочете здійснити хрестопилення, і розмістіть ще один набір культурних паличок на ньому.\nВи не можете гарантувати, що в хрестопиленні беруть участь більше 2 культур, але як мінімум в 2 беруть участь.§<newPage>§<header;Хрестопилля культур;true>",
  "wiki.ic2.subpage.crop.breeding": "Так як працює хрестопилення? Це досить просто! Практично будь-яка комбінація може призвести до чого завгодно§<newPage>§<header;Хрестопилення культур;true>\nАле як визначається результат?\n\nЦе ґрунтується на системі балів.\nБали генеруються в залежності від того, скільки властивостей культури співпадають або наскільки близькі вони відносно один одного.\nСума цих балів розраховується разом з усіма батьківськими культурами, і потім випадково вибирається один з них.\nЄ одне виключення. Якщо батьківська культура дорівнює культурі, яку можна вибрати, вона отримує плоский бонус у 500 балів.\nЦе робить її набагато ймовірнішою.\n\n§<redirect;true;Аналізатор культур;ic2:preview.crop_analyzer> може симулювати приклади і показувати потенційні результати.\n\nКрім того, це випадкова удача, що вибирається.§<newPage>§<header;Хрестопилення статистики;true>\nТепер, коли ви хрестопили культуру, вона також змінить статистику.\nЯк це відбувається також досить просто.\n\nВона бере суму статистик батьків, кожну статистику окремо, і ділить її на кількість батьків.\nОтримуєте вашу середню статистику.§<newPage>§<header;Хрестопилення статистики;true>\nТоді додається деяка коливання, де випадково застосовуються 2 бали статистики в кожному напрямку за наявності батьків.\nТаким чином, ви можете втратити або здобути статистику через хрестопилення культур.§<newPage>§<header;Копіювання культур;true>\nТепер отримати велику кількість насіння дуже складно і неприємно.\nТому ви можете копіювати культури досить просто.\n\nПрактично, якщо культурна паличка має тільки 1 можливого батька для хрестопилення, вона замість цього клонує батьківську культуру.\nБез змін статистики, без змін культури прямий клон.§<newPage>§<header;Відмінник бур'яну;true>\n§<redirect;true;Відмінник бур'яну;ic2:preview.weed_ex> захищає ваші культури від знищення бур'яном.\nАле з усім гарним, зловживання може зашкодити культурам. Зокрема, статистиці.\nОтже, правило таке: використовуйте його лише один раз або коли Відмінник бур'яну майже пустий.§<newPage>§<header;Аналізатор культур;true>\nВи можете сканувати культури, натиснувши на них правою кнопкою миші з §<redirect;true;Аналізатор культур;ic2:preview.crop_analyzer>\n\nЗагалом, коли ви маєте Аналізатор культур у своєму гарячому слоті, багато інформації відображається в One Probe для вас!§<newPage>§<header;Родючість ґрунту / Підгрунт!;true>",
  "wiki.ic2.subpage.crop_analyzer.body": "Аналізатор культур - це ваш рухомий інструмент для аналізу ваших культур.\n\nВи можете або натиснути правою кнопкою миші на культуру, щоб сканувати її, поки вона посаджена, або ви можете кинути предмет у його внутрішній інвентар.\nКожен повний скан коштує 10 000 EU. Це робиться через кілька кроків, які розкривають деякі дані.\n\nКрім того, Аналізатор культур може бути переведений у режим хрестопилення, що дозволяє вам симулювати хрестопилення культур.\n\n\nУ верхній частині GUI ви вибираєте культури, які хочете використовувати, і потім натискаєте кнопку Схрещування.\nРезультати того, що може потенційно вийти, відображаються.\nМаленький недолік, щоб додати: лише 2 культури повністю точні, оскільки ви не маєте реального контролю над тим, скільки культур бере участь у хрестопиленні.\nОскільки випадково обирається культура, яка готова схрещуватися.",
  "wiki.ic2.subpage.crop_analyzer.head": "Аналізатор культур",
  "wiki.ic2.subpage.crop_harvester.body": "Культурний жниварник - це ваш спосіб автоматичного збору культур IC2.\n\nВін автоматично збирає культури, коли вони повністю дозріють. Зауважте, що це призводить до меншої кількості продуктів порівняно з ручним збором.\nЙого діапазон може бути від 3x3x3 до 11x11x11 за допомогою модернізації Поле розширення. Машина знаходиться в центрі цього кубічного ящика.\n\nВін також може бути модернізований за допомогою Overclockers, щоб збирати культури набагато швидше.",
  "wiki.ic2.subpage.crop_harvester.head": "Культурний жниварник",
  "wiki.ic2.subpage.crop_library.body": "Бібліотека культур - це значне удосконалення порівняно з її простим аналогом.\n\nВона має необмежене сховище типів культур і мутацій, але для доступу і модифікації потрібні EU.\nЦе коштує приблизно 1EU пасивного стоку, щоб мати можливість бачити культури і 5 EU, щоб вставити будь-яку культуру будь-якого розміру.\nПодібно до аналогів, вона приймає лише повністю проаналізовані насіння.\nХоча її справжнім недоліком є те, що всі культури втрачаються, якщо ви знищите бібліотеку. Тому переконайтеся, що ви порожнійте її перед переміщенням.\n\nЦе ціна за необмежене сховище",
  "wiki.ic2.subpage.crop_library.head": "Бібліотека культур",
  "wiki.ic2.subpage.cropmatron.body": "Сівалка - це інструмент, який вам потрібен для ваших культур IC2.\n\nВін автоматизує накладення зволоження / добрив / відмінника бур'яну на ваші культури.\nХоча не так ефективний в тому, скільки ви отримуєте з цих предметів протягом часу, він все одно вартий того.\nЙого повне покриття - 9x5x9, яке він повинен знаходитися в центрі.\n\nВоду можна подавати в Сівалка, щоб отримати 2 справжні переваги машини.\nСпочатку Сівалка стає залитим водою і забезпечує те, що підгрунтя залишається вологим на 1мБ води на такт.\nДруге - це автоматичне поповнення Гідратації за допомогою води в баці Культурного матрона.",
  "wiki.ic2.subpage.cropmatron.head": "Сівалка",
  "wiki.ic2.subpage.early_game.body": "Отже, ви завершили свої походи за ресурсами, можливо, навіть померли не один раз по дорозі,\nі готові поглибитися в модифікацію.\n\nМожливо, ви навіть вже зробили кам'яні машини для ефективнішої обробки своїх руд.§<newPage>§<header;Як почати?;true>\nТипове занурення в IC2C починається з наступних речей:\n- §<redirect;true;Генератор;ic2:preview.generator> \n- §<redirect;true;Екстрактор;ic2:preview.extractor> \n- §<redirect;true;Макератор;ic2:preview.macerator> \n- §<redirect;true;Електрична піч;ic2:preview.electric_furnace> \n- §<redirect;true;Кабелі;ic2:preview.copper_cable_item> \nІдеальне налаштування може виглядати так:§<image;ic2:textures/wiki/early_setup.png;60;5;108>§<newPage>§<header;Ідеальне налаштування;true>\nХоча це ідеальне налаштування, воно не є ідеальним.\nОскільки генератор не зберігає паливо ефективно,\n§<redirect;true;Батбокс;ic2:preview.batbox> може бути хорошим доповненням.\nЦе дозволить покращити ефективність використання палива.§<image;ic2:textures/wiki/early_setup_storage.png;60;5;108>§<newPage>§<header;Ідеальне налаштування;true>\nЗа допомогою невеликого налаштування ви можете ефективніше обробляти свої ресурси.\nМакератор/Екстрактор забезпечують більше виходу з ресурсів,\nтоді як Генератор/Електрична піч забезпечують ефективне використання палива.\n\nНа наступній сторінці ви знайдете список блискучих речей, які можуть вас зацікавити.§<newPage>§<header;Блискучі цілі!;true>",
  "wiki.ic2.subpage.early_game.head": "Початкова гра",
  "wiki.ic2.subpage.early_game.list": "Цей список містить цілі, до яких ви можете прагнути.§<newPage>§<header;Блискучі Інструменти!;true>\n- §<redirect;true;Гайковий ключ;ic2:preview.wrench> дозволяє піднімати машини, не руйнуючи їх, у більшості випадків.\n- §<redirect;true;Бур;ic2:preview.drill> дає вам доступ до нескінченного кайла, поки ви живите його енергією.\n- §<redirect;true;Ланцюгова пила;ic2:preview.chainsaw> - ваш вибір зброї?!!!!!\n- §<redirect;true;Інструмент для стрижки;ic2:preview.mowing_tool> позбавляє вас всіх ЦІ КЛЕЩОВИХ ЛИСТКІВ!\n- А §<redirect;true;Шкатулка з інструментами;ic2:preview.tool_box> зберігає всі ваші інструменти.",
  "wiki.ic2.subpage.electric_enchanter.body": "Електрична чарувальня - це поєднання чарівного столу, наковальні, розчаровувача та потужності EU!\n\nЦе єдиний спосіб чарувати електричні інструменти EU.\nАле взагалі він також є дуже потужним чарівником.\n\nУ чарівника є кілька режимів.§<newPage>§<header;Режим чарів;true>\nРежим чарів - це в основному ваш звичайний чарівний стіл,\nале замість випадкового вибору він показує вам точно, що ви отримаєте\nі використовує EU, щоб зменшити витрати досвіду, необхідні для цього.\n\nЗачаровані інструменти також можна перекручувати за допомогою нього за вищою ціною, ніж звичайне чарування.\nСлоти книг у верхній частині визначають, скільки чарувань ви отримаєте і наскільки потужні ці чарування.\nЯкщо в цих слотах є зачаровані книги, вони будуть пріоритетними, і решта буде застосована після.\nВи отримуєте 2 чари за кожним слотом книги. Якщо є достатньо чарів для вибору.\nЗвісно, також потрібно лазурит.§<newPage>§<header;Режим наковальні;true>\nРежим наковальні - це ваша класична наковальня, лише з зменшеними витратами досвіду та здатністю чарувати електричні предмети.\nПредмети, такі як §<redirect;true;Майнінг Лазер;ic2:preview.mining_laser>, можуть бути дуже корисні, оскільки чари будуть працювати також у §<redirect;true;Шахтар;ic2:preview.miner>.\nХоча сам майнінг-лазер не буде безпосередньо працювати з чарами.§<newPage>§<header;Режим розчарування;true>\nРежим розчарування також дуже простий.\nПокладіть предмет, який потрібно розчарувати, у центральний слот.\nНадайте книги та досвід\nПЕРЕМОГА!\n\nі він відокремлює верхнє чарування з цього предмета та переносить його в окрему книгу.",
  "wiki.ic2.subpage.electric_enchanter.head": "Електрична чарувальня",
  "wiki.ic2.subpage.electricity.body": "IC2C має одиницю енергії, яка називається EU. (Energy Unit)\n\nEU створюється в генераторах і передається по кабелях до машин, які ви хочете використовувати. Це те, що живить усі модулі.\n\nEU - це дуже проста форма енергії, але вона не дозволяє вам розслабитися.\nДавайте почнемо з генераторів.§<newPage>§<header;Генератори;true>\nГенератори досить прості.\nВони використовують паливо і виробляють енергію.\nЗвичайний генератор, наприклад, виробляє 10EU/тик.\nЦя енергія потім автоматично випромінюється як пакет енергії.\n\nЩо таке пакет енергії?\nЦе пояснюється пізніше.§<newPage>§<header;Електричні Машини;true>\nЕлектричні машини - це речі, які використовують EU для виконання завдань.\nНаприклад, Дробарка (Машина) використовує енергію для перетворення бутового каменю на пісок.\n\nМашина може приймати енергію в залежності від її рівня.\nУ нашому прикладі з дробаркою вона може приймати 32EU на пакет.§<newPage>§<header;Пакети Енергії?;true>\n§<reset_header>\nОтже, що насправді таке пакет енергії?\nЦе досить просто.\nЦе ящик, заповнений енергією, який ви відправляєте поштою. Займає трохи часу, але він дістається туди в кінцевому підсумку.\n\nОк, жарти осторонь.\nТак, ви можете думати, що пакет енергії - це ящик, і саме паливо визначає, як великим є цей ящик.\n\nТаким чином, машини можуть приймати лише ящики певного розміру, але нескінченну кількість ящиків, доки вони не заповнені.\n\nНі, машина не вибухне, якщо вона повністю заповнена, і ви спробуєте засунути в неї ще ящики з енергією.§<image;ic2:textures/wiki/packet.png;80>§<newPage>§<header;Кабелі;true>\nКабелі - це ваш транспорт для цих уявних пакетів енергії.\nЯк і машини, вони мають обмеження на кількість енергії, яку вони можуть передавати.\n\nНаприклад, Мідні кабелі мають обмеження передачі 32EU на пакет.\nАле вони можуть передавати нескінченну кількість пакетів.\n\nПроте, оскільки ви намагаєтеся протиснути енергію через метал, виникають втрати.\nЗа нашим прикладом з мідними кабелями. Втрати складають 0,2EU за кожний блок, через який ви намагаєтеся пропустити енергію.\n\nЩоб спростити гру, втрати округлюються вниз. Це означає, що досягнувши 1,0, ви не втратите жодної енергії.\nЦе означає, що вам слід тримати відстані короткими або враховувати це.\nЗверніть увагу, що втрати відносяться до кожного пакета окремо.\n\nТакож переконайтеся, що кабелі ізольовані, інакше ви можете отримати шокуючий досвід, якщо наблизитесь до них.§<newPage>§<header;Трансформатори;true>\nТепер тут очевидна проблема.\nЩо робити, якщо моя джерело енергії занадто велике для моєї машини?\nЧи мені потрібно будувати новий?\n\nОсь де входять в гру трансформатори.\nВони можуть приймати пакети вищого рівня і перетворювати їх на пакети нижчого рівня.§<newPage>§<header;Обернені Трансформатори;true>\n§<image;ic2:textures/wiki/inverse_transformer.png;50>\n§<padding;3>\nТрансформатори також можуть бути обернуті за допомогою сигналу червоного каменю.\nЦе інвертує \"входи\" та \"виходи\".\nЦе дозволяє стиснути пакети енергії і допомагає зменшити втрати енергії.§<newPage>§<header;EU-Ридер;true>\nТепер уся ця інформація корисна, але ця інформація всіма прихована і невидима.\n\nТепер §<redirect;true;EU-Ридер;ic2:preview.eu_reader> змінює це.\nЯкщо у вас є EU-Ридер у вашому гарячому рядку, включені підказки на предметах, які дозволяють переглядати точні характеристики сказаних генераторів / кабелів / машин.§<newPage>§<header;Напрямна Енергія;true>\nБільшість джерел енергії випромінюють свою енергію в усі 6 напрямків.\nАле є кілька, які мають напрямну природу.§<image;ic2:textures/wiki/directional.png;45>§<newPage>§<header;Напрямна Енергія;true>\nЗагальне правило таке:\n- Один точковий - це §lВихід§r\n- тоді як ніякі або 3 точки - це §lВхід§r\n\nМаленька примітка:\nКольори на крапках вказують на те, яка енергія буде на їхньому боці, на основі відповідних кабелів§<newPage>§<header;Розгалуження Мережі;true>\nТепер є ще одна проблема, з якою ви можливо зіткнулися або не зіткнулися.\nЩо робити, якщо вам потрібно пройти кабелі дуже близько один до одного і не хочете, щоб вони підключалися?\n\nУ вас є 2 варіанти вирішення цієї проблеми:\n- 1: Здавайтеся.\n- 2: Будуйте більше§<newPage>§<header;Маляри;true>\nЖарти осторонь. Варіант 1 - §<redirect;true;Маляри;ic2:preview.painter> §<image;ic2:textures/wiki/color_blocking.png;45>\n§<padding;5>\nКабелі, які розфарбовані, не будуть підключатися до інших кабелів, якщо вони мають різний колір.§<newPage>§<header;Шахтарські Труби;true>\nДругий варіант - шахтарські труби: §<image;ic2:textures/wiki/mining_blocking.png;45>\n§<padding;5>\nШахтарські труби можна розмістити на кабелях і виступати як якорі / вилки, щоб кабелі не підключалися один до одного.\n\nДодатково до цього тримання шахтарських труб показує цю класну накладку.",
  "wiki.ic2.subpage.electrolyzer.head": "Електролізер",
  "wiki.ic2.subpage.electrolyzer.body": "Електролізер - це машина, яка безпосередньо отримує енергію з енергетичних сховищ.\n\nХоча вона повинна торкатися енергетичного сховища, їй не потрібно підключатися до виходу для роботи.\n\nВона споживає 1/4 витрат енергії енергетичного сховища. §<newPage>§<header;Рецепти;true>\nЕлектролізер має 2 режими рецептів:\n- §lЗарядження§r: коли сховище заповнене на 70% або більше.\n- §lРозрядження§r: коли сховище заповнене на 30% або менше.\n\nСами рецепти можуть вирішувати, які режими працюють для них.\nКоли рецепт говорить \"Подвійний\", це означає, що він працює з обох режимів.",
  "wiki.ic2.subpage.first_day.body": "IC2 Classic - оновлена версія попередньої експериментальної версії IndustrialCraft 2 для Minecraft 1.4.7.\nВона розширена додатковими покращеними машинами, паровим варіантом ядерного реактора, розширеними варіантами ЩР та ВР сканерів, відведеними батарейними блоками та ядерним реактивним ранцем. IC2 Classic також сумісний з більшістю доповнень до IC2 Experimental. Збір ресурсів: Почніть, як і в будь-якій іншій грі, зі збору ресурсів.§<newPage>§<header;Руди;true>\nВирушайте на гірничий похід і збирайте такі руди: Вугілля, Залізо, Мідь, Олово, Редстоун.§<newPage>§<header;Дослідження;true>\nВаша мета - знайти ці дерева: §<image;ic2:textures/wiki/rubber_tree.png;130>\nВони називаютсья §lГевеєю.§r\nВони можуть бути знайдені у:\n- Лісах\n- Болотах\n- Джунглях.\nБолота - джерело їх.\nАле, як завжди, будь ласка, залишайте їхнє болото.\n\nЯк тільки знайдені, вам потрібно зібрати їхню смолу і зібрати сажанці для вашого будинку.§<newPage>§<header;Збір Смоли;true>\nЯк тільки у вас будуть деякі гевеєві дерева, ви хочете зібрати їхню смолу за допомогою Treetap.\n\nГевеєві дерева мають ці місця смоли, які ви можете витягнути.\nПісля видалення, натиснувши правою кнопкою миші їх з Treetap, вони повільно відновлюватимуться.\nПросто переконайтеся, що ви не перетримуєте їх, інакше місце смоли перестане існувати.§<newPage>§<header;Корисні предмети;true>",
  "wiki.ic2.subpage.first_day.head": "Перший день: Що робити?",
  "wiki.ic2.subpage.first_day.list": "Цей список показує вам декілька речей, на які ви маєте звернути увагу,\nЩо ви можете перетворити та інше.",
  "wiki.ic2.subpage.fisher.head": "Авторибак",
  "wiki.ic2.subpage.fisher.body": "Авторибак - це ваше вирішення в кінці гри, щоб отримати здобич,\n\nДля того, щоб він працював, потрібно багато енергії, але здобич, яку ви отримуєте, велика.\nВін працює швидше, ніж 64 гравці разом з кращою здобиччю.\n\nСтруктура досить проста, просто мала платформа і ланцюг вниз.\nДовжина ланцюга визначає, наскільки більше удачі ви отримуєте.\n\nЛанцюг повинен мати мінімальну довжину 5 блоків і максимальний діапазон 10.\n\nПлатформу можна зробити з будь-якої дошки/бруса, а контейнер над рибалкою повинен мати принаймні 20 слотів, щоб бути придатним.",
  "wiki.ic2.subpage.fourth_tier.body": "Для четвертого рівня вам потрібен Іридій.\n\nІридій створюється за допомогою UU(УП)-Матерії, який виробляється §<redirect;true;Massfabricator;ic2:preview.mass_fabricator>.\nПеретворення енергії та додаткових ресурсів на UU.\n\nДодаткові ресурси - \"Скрап\", який зменшує витрати енергії в 7 разів.§<newPage>§<header;Блискуча смакота для собак!;true>\nЗрештою, на цьому етапі вам вже не потрібно багато.\nОсь ваш списочок!\n\nБудь ласка, підійдіть погратися!!!!",
  "wiki.ic2.subpage.fourth_tier.head": "Четвертий Рівень",
  "wiki.ic2.subpage.fuel_boiler.head": "Паливний Котел",
  "wiki.ic2.subpage.fuel_boiler.body": "Паливний Котел є одним з виробників енергії кінцевої гри.\nЦе мультиблочна споруда розміром 2x2, побудована з цього та його блоків структури.\n\nВін використовує Паливні банки для кип'ятіння води на пар. Він виробляє 1024 мілібаку пару на такт.\nЦе робиться дуже ефективно. Він вдвічі ефективніший, ніж звичайний генератор зі своїм паливом.\n\nХоча це відбувається тільки тоді, коли він нагрітий. Фаза розігрівання забирає 10 разів більше палива порівняно з повністю розігрітим станом.\nЦя паливна ефективність може бути значно покращена шляхом ефективного використання Паливної банки, яка є модульним джерелом палива, яке може бути досить поганим або безумовно добрим.\n\nВерхні 4 блоки цієї мультиблочної споруди автоматично виводять пару до безпосередньо підключених резервуарів.\n\nНа відміну від інших модульних аналогів, цей не вибухає, якщо вода закінчиться і її поповнити.",
  "wiki.ic2.subpage.fusion_reactor.head": "Термоядерний Реактор",
  "wiki.ic2.subpage.fusion_reactor.body": "Термоядерний Реактор - це кубічна структура розміром 5x5x5, де всі блоки є посиленими варіантами.\n\nЦе також відповідь на питання: скільки лави досить лави?\n\nВідповідь? Немає такої речі, як досить!§<newPage>§<header;Структура;true>\nКаркас та підлога виготовлені з будь-якого посиленого каменю,\nв той час як решта зроблена з будь-якого посиленого скла.\n\nКлапани можуть бути вставлені в будь-який момент у структурі.§<newPage>§<header;Як запустити;true>\nЯк працює термоядерний реактор?\nКиньте до 6 уранових стержнів та розтоплюваний блок.\nРізні типи урану мають власні швидкості виробництва.\n\nБудьте попереджені, що вартість розігріву висока, але після нагрівання паливо стає досить ефективним.",
  "wiki.ic2.subpage.gui.body": "IC2C має різноманітний набір функцій графічного інтерфейсу, які призначені допомогти вам у дослідженні моду.\n\nДавайте почнемо з трьох найбільш поширених кнопок.§<image;ic2:textures/wiki/gui/buttons.png;30;42; 34.56>\n§<padding;5>\n- §lI§r: Налаштування доступу\n- §lC§r: Налаштування компаратора\n- §lS§r: Інформація про слот\n\nЦі налаштування доступні у кожному механізмі з графічним інтерфейсом.\nЦе заміна \"Machine Tool\", який був у попередніх версіях.§<newPage>§<header;Налаштування доступу;true>\n§<image;ic2:textures/wiki/gui/machine.png;74>\n§<padding;5>\nУправління доступом до машини дозволяє встановити параметри інвентаря для механізму / слотів\nЗа замовчуванням все ввімкнено.§<newPage>§<header;Налаштування;true>\n - §l§9Синій§r: Літери DUNSWE позначають сторону, яку ви хочете налаштувати.\n- §l§cЧервоний§r: Ці кнопки-перемикачі дозволяють увімкнути / вимкнути доступ до сторони.\n- §l§bБірюзовий§r: 4 стани кнопки дозволять вам вирішити, чи буде сторона приймати / віддавати, лише приймати, лише віддавати або вимкнена.\n- §lСкидання§r: Просто скидає налаштування.\n- §l§aЗелений§r: 2 кнопки призначені лише для налаштувань, які використовуються лише в деяких машинах.\n - §lЛіва кнопка§r: дозволяє приймати лише 1 предмет кожного типу в видимий інвентар (для конкретної сторони)\n - §lПрава кнопка§r: дозволяє приймати лише 1 стопку в видимий інвентар (для конкретної сторони)§<newPage>§<header;Налаштування слотів;true>\n§<image;ic2:textures/wiki/gui/machine_selected.png;60;10;98>§<padding;5>Максимальний контроль слотів. Можна фільтрувати які і скільки предметів дозволені, а які ні.\nТакож ви можете натискати на слоти і задавати налаштування для них!§<newPage>§<header;Налаштування компаратора;true>\n§<image;ic2:textures/wiki/gui/comparator.png;74>\n§<padding;5>\nДозволяють змінювати вивід компаратора.§<newPage>§<header;Налаштування компаратора;true>\n- §l§9Синій§r розділ дозволяє вам вибрати, який вихід компаратора ви хочете змінити.\nV => Ванільний компаратор,\nтоді як все інше відноситься до Продвинутого компаратора.\n- §l§aЗелений§r розділ містить джерела для вихідного сигналу, який ви можете вибрати.\nВідображення в реальному часі, який вихідний сигнал вони можуть надати.\n\n- §l§cЧервоний§r розділ розраховує вихідний сигнал вашого компаратора. Число зліва — вхідний сигнал, а справа - сила вихідного сигналу.\nОкрім цього, є ще й 3 кнопки, які впливають на значення.\n§lЧервона факел§r інвертують сигнал, \n§lПовторювач§r робить його або 0, або 15.\nОстаточний вивід потім розраховується на основі того, який режим вибрано кнопкою \"знизу\".\nЗа замовчуванням стоїть §l\"Мін\"§r, але  також можна вибрати §l\"Макс\"§r або §l\"Середнє\"§r. Враховуються всі надані джерела.\n\nПросто натисніть на джерело, щоб додати / видалити.§<newPage>§<header;Що куди покласти?;true>\nЧасто ви запитуєте себе, що входить в цей слот механізму?§<image;ic2:textures/wiki/gui/inventory_selected.png;74>\n§<padding;5>\nІнформація про слот вам підкаже!\nПросто натисніть на кнопку §l\"S\"§r, а потім на будь-який слот у інвентарі.\nЦе покаже, що може знаходитися в кожному слоті.\n\nЯкщо список довгий, є також рядок пошуку!\nСпасибі Daenara, що запропонувала цю ідею! §<newPage>§<header;Налаштування фільтра;true>\nНалаштування фільтра дуже корисна річ.\nЗнаєте, для чого і як налаштувати фільтр?\nНавіть якщо він порожній, вам все одно захочеться налаштувати сторони.\n\nНе треба, я знаю, про що ви думаєте!\nЗараз розповім!§<newPage>§<header;Налаштування фільтра;true>\n§<image;ic2:textures/wiki/gui/item_selector.png;74>§<padding;5>\nКожен слот - це фільтр. Ви можете просто натиснути на цей слот, щоб вибрати свій фільтр.\nВін навіть перевіряє, який елемент є допустимим входом. Так що не треба гадати!§<newPage>§<header;Підказки;true>\n§<image;ic2:textures/wiki/gui/tooltip.png;18>§<padding;5>\nПредмети мають спливаючі підказки з прив'язкою клавіш, які точно кажуть вам, що робити.\nІноді прив'язка клавіш каже лише \"Натисніть m\", як у цьому прикладі.\nУ більшості випадків \"Кнопка\" поєднується з \"ПКМ\", якщо зрозуміло, що просто ПКМ не працює.\nНаприклад, як у випадку з реактивними ранцями.§<newPage>§<header;Інвентар предмета;true>\nІ остання функція, яку люди не очікують побачити.\nВи можете відкривати інвентар предметів навіть з інвентаря іншого блоку.\nЦе дозволяє здійснювати швидке налаштування, не виймаючи предмет і не використовуючи функцію клацання правою кнопкою миші.§<newPage>§<header;Інвентар предмета;true>Це вже було зроблено і в інших модах, але там це працювало лише з інвентарями гравців.§<newPage>§<header;Графічний інтерфейс друзів;true>\nУ IC2C є декілька персоналізованих блоків.\nАле іноді ви граєте в групі.\nСаме тут в гру вступає графічний інтерфейс друзів.\n\nВін відкривається натисканням:\n§<key;key.ic2.hud> + §<key;key.ic2.toggle> \n\nПотім ви можете включити, хто є вашим другом, а потім вибрати їх і вказати певні дозволи за бажанням.",
  "wiki.ic2.subpage.gui.head": "Посібник з інтерфейсу",
  "wiki.ic2.subpage.industrial_worktable.body": "Промисловий верстат - дійсно потужний інструмент,\n поєднана з надійним рішенням для зберігання; він перевершує інші варіанти, що існують тут.\n\nПромислова верстатня, однак, не є \"Інструментом автоматизації\". Він призначений для зменшення ручної роботи, допомагаючи вам, а не автоматизуючи її.§<newPage>§<header;Промисловий верстат;true>\n§<image;ic2:textures/wiki/industrial_worktable.png;120>§<newPage>§<header;Пам'ять рецептів;true>\n§lЗелена частина§r  - це ваше сховище рецептів. \nЗа замовчуванням ви отримуєте 9 рецептів, але це можна розширити за допомогою  §<redirect;true;Паличок пам'яті.;ic2:preview.memory_stick>.§<newPage>§<header;Пам'ять рецептів;true>\nРецепти можна додати, коли у вас є рецепт, збережений у робочій сітці, і натисніть кнопку збереження. Просто клацніть на слоті, в якому хочете зберегти. \nПри натисканні на рецепт він автоматично завантажується в сітку рецептів. \nНатискання середньою кнопкою миші на рецепт видалить його.§<newPage>§<header;Розширення памйяті;true>\n§lЖовта секція§r зберігає палички пам'яті, які розширюють рецепти. \nЗауважте, що рецепти зберігаються у самих паличках пам'яті, що означає, що їх можна замінити за потреби.§<newPage>§<header;Основне сховище;true>\n§lЧервона область§r - це ваше основне сховище, де зберігаються предмети. Кнопка поповнення (Воронка) поповнює ваші предмети після кожного ремесла. (Вона запам'ятовує розташування)§<newPage>§<header;Сміттєве сховище;true>\nThe §lСині слоти §r - це ваші сміттєві слоти, куди потрапляють інгредієнти, які з'являються під час ремесла і не використовуються. Ця область ігнорується функцією поповнення і також має пріоритет для робочої сітки.§<newPage>§<header;Налаштування NBT;true>\nКнопка \"Папір\" є кнопкою \"для кожного рецепта\", яка вказує, чи потрібно рецепту шукати точні дані NBT замість будь-якого предмета, який ви шукаєте. Це допомагає рецептам, які повинні мати конкретні дані для роботи, за замовчуванням вона вимкнена через те, що більшість рецептів не перевіряє NBT-дані самостійно.§<newPage>§<header;Рекурсивне виробництво;true>\nКнопка Верстаку активує рекурсивне виробництво. \nале у вас є лише його базові компоненти, і не всі необхідні інгредієнти, \nця кнопка дозволяє автоматично виготовляти всі підкомпоненти для вас. Забезпечивши, що він знає рецепти. Це означає, що ви можете мати дуже важкі рецепти, які перетворюються в один клік, оскільки він автоматично визначає, що виробляти і робить це за вас, \nі якщо він не може виробити, він автоматично скаже вам, де він застряг.§<newPage>§<header;Обмеження рекурсивного виробництва;true>\nЗвісно, існують обмеження цієї системи. Головним чином через причини продуктивності, а також для того, щоб вона не була занадто потужною.\n- Ви можете мати лише 512 підкомпонентів одночасно. Це означає, що якщо ваш рецепт потребує більше, ніж 512 виробництв для виготовлення його інгредієнтів, він скаже \"ні\".\n- Ви можете мати лише 6 шарів глибини.  \n\nЦе означає, що ви можете мати лише обмежене число інгредієнтів, які можуть бути створені, перш ніж вас заблокують.\n- Результатуючі невикористані предмети повинні вміщуватися в сміттєві слоти. Так що переконайтеся, що тримаєте їх чистими або відстежуйте їх.\n- Всі інгредієнти або підрецепти мають бути надані користувачем.§<newPage>§<header;Поповнення;true>\nКнопка Поповнення, Воронка, дозволяє автоматично поповнювати головне сховище всіма відсутніми предметами \nпісля кожного виробництва, намагаючись зберегти макет перед виробництвом. \nЦе також працює з розширеннями, де воно автоматично поповнює їх, якщо вони хочуть/потребують поповнення.§<newPage>§<header;Мережа запитів;true>\nSОскільки труби мають систему запитів, у Промислового Робочого Стола теж є система запитів. \n2 факти.\n Кнопка вагонетки з вагоном, яка симулює виробництво, і якщо воно дійсно валідне, вона запитає всі відсутні предмети з мережі запитів. \nКнопка труби запитів відкриває підрозділ, де користувач може робити свої власні запити. \nВарто зауважити, що \"Вибір запиту\" не знає, які предмети знаходяться у сітці, тому ви можете запитувати все, і речі, які можна задовольнити, будуть задоволені.\n\n.§<newPage>§<header;Розширення;true>\nПромисловий верстат може мати розширення, за замовчуванням може бути 6, але це може бути від 0 до 20 в конфігураціях. Вони розширюють функціональність робочого столу. Поки розширення прямо або опосередковано пов'язані з робочим столом, їх можна додати. Крім того, розширення можуть бути спільними для кількох робочих столів.",
  "wiki.ic2.subpage.industrial_worktable.head": "Промисловий верстат",
  "wiki.ic2.subpage.item_energy.head": "Портативна енергія",
  "wiki.ic2.subpage.item_energy.body": "У IC2C є багато електричних інструментів та портативних сховищ енергії.\nТакож їх називають батареями.\n\nЄ кілька речей, які важливо знати про портативну енергію загалом для комфортної гри:\n\n§<newPage>§<header;Інструменти;true>\nЯк я можу заряджати інструменти без повернення до блоку генератора?\n\nЄ 2 способи:\n- §lОблодунок/К'юріо§r: Маєте портативне сховище енергії в слотах облодунках або К'юріо (якщо встановлено).\n   Інструменти автоматично намагатимуться заряджатися, коли ви їх використовуєте.\n- §lПредмет§r: Правий клік на батарею в головній руці.\n   Відразу після правого кліку на батарею в руці вона зарядить все на вашій панелі інструментів своєю власною енергією.\n\n§<newPage>§<header;Рівні енергії;true>\nПредмети також мають свій власний рівень енергії. §<image;ic2:textures/wiki/energy_tier.png;40>\n§<padding;5>\nПри спробі зарядити/розрядити батарею/інструментом будь-якого типу, зарядник/розрядник повинен бути рівним або вищим за рівень енергії.\n\nНаприклад, §<redirect;true;Акумуляторна скринька;ic2:preview.batbox> не може заряджати §<redirect;true;Енергетичний кристал;ic2:preview.energy_crystal>.\nТому що Енергетичний кристал має рівень 2, а Акумуляторна скринька - рівень 1.\n\n§<newPage>§<header;Зарядний стенд;true>\n§<redirect;true;Зарядний стенд НН;ic2:preview.charging_bench_lv> та §<redirect;true;The  НН;ic2:preview.battery_station_lv> можуть це перевищити.\nОскільки вони спеціалізовані блоки для роботи з такими речами.",
  "wiki.ic2.subpage.liquid_generator.body": "Рідкопаливний генератор в основному приймає 3 види рідини.\n\n§lДерев'яний газ§r\n4 мб: 1 такт: 10EU/т \n\n§lБіопаливо§r\n1 мб: 2 такти: 128EU/т \n\n§lСпирт§r\n1 мб: 24 такти: 50EU/т \n\nДерев'яний газ може бути вироблений за допомогою §<redirect;true;Газифікатора деревини;ic2:preview.wood_gassifier>",
  "wiki.ic2.subpage.liquid_generator.head": "Рідкопаливний генератор",
  
  "wiki.ic2.subpage.miner.head": "Гірник",
  "wiki.ic2.subpage.miner.body": "Гірник - ваша ворота до напівавтоматичного видобутку.§<newPage>§<header;Гірник;true>\nВам закінчуються ресурси. Гірник - один з найефективніших способів збору ресурсів, який не потребує сил рабів у ваших шахтах!\n\nЧому він напівавтоматичний?\nГоловним чином тому, що він працює лише один раз і потребує ручного переміщення.§<newPage>§<header;Сканери для Гірника;true>\nГірнику потрібен §<redirect;true;Сканер;ic2:items.scanners>, щоб працювати.\nСканер визначає, як і на якій відстані працює Гірник, без нього він лише копатиме вниз.\n\nЗвичайний сканер просто спрямовується на потрібні руди та пропускає всі непотрібні речі, якщо вони не прямо на шляху.\nКар'єрний сканер спрямований на кожен окремий блок для великої ями.§<newPage>§<header;Бури;true>\nБур визначає, наскільки швидко і ефективно копає Гірник, а також який блок він може копати.\nФактично бур, навіть якщо §<redirect;true;Буріння лазером;ic2:preview.mining_laser> здається дивним.\nЯкщо бур відсутній, бурильна труба буде витягнута назад.\nТакож Фортуна/Шовковий Доторк використовуються, коли вони є на бурильній головці.§<newPage>§<header;Бурильні Труби;true>\nГірник потребує бурильних труб для прокладання шляху вниз у землю.\nФактично вони визначають, наскільки глибоко може проникнути Гірник.\nВи завжди можете поповнити запас бурильних труб, оскільки вони використовуються.\nТакож, коли бурильні труби витягуються назад, ви можете замінити їх іншим блоком, і вони будуть встановлені на його місце.§<newPage>§<header;Спеціальні Взаємодії;true>\nГірник може використовувати насос, якщо він підключений, щоб відкачати рідини, які в іншому випадку застрягли б Гірнику.\n\nГірник за замовчуванням виводить лише на боки, а не вгору/вниз.\nЦе можна налаштувати за допомогою управління доступом до інвентаря, воно перевіряє, чи є сторона експортною.§<newPage>§<header;Робоча Група;true>\nГірник сам по собі працює не так швидко. Розміщення кількох близько один до одного має недолік в тому, що вони будуть конкурувати між собою, що робити\nі фактично сповільнювати один одного.§<newPage>§<header;Як працює Робоча Група;true>\nТут на сцену виходить кнопка \"Робоча Група\".\nПісля того, як ви розмістили всі свої гірники, ви можете натиснути цю кнопку, щоб створити Робочу Групу.\nЦя Робоча Група шукає в радіусі 5 блоків всі гірники, які не знаходяться в Робочій Групі, і додає їх до списку.\nРоблячи той, в якому ви почали, Майстром Гірника.§<newPage>§<header;Що робить Робоча Група;true>\nКоли Гірник - помічник у Робочій Групі, він більше не потребує сканера,\nоскільки Майстер вирішує, які блоки копаються.\nКожен окремий Гірник має своє завдання, яке Робоча Група переконується, що немає конфліктів.\nЯкщо завдань недостатньо або гірники конфліктують між собою під час роботи, замість боротьби за блоки гірники допомагають один одному.\nЗбільшуючи Швидкість Копання цього конкретного блоку.\n\nХоча можуть виникнути неефективності. Це значно підвищує ефективність.§<newPage>§<header;Додаткові Знання про Робочі Групи;true>\nКожен Гірник все ще потребує Буру, Бурильних Труб та енергії.\nТакож Гірник, який нарешті руйнує блок, фактично створює Падіння, тому вам потрібно охопити всіх гірників відправленням предметів.\nНасоси також повинні бути налаштовані окремо, хоча тільки Майстер потребує його для відкачування рідин, кожен додатковий насос лише допомагає впоратися з рідинами.",
  "wiki.ic2.subpage.ocean_generator.body": "Океанський генератор перевіряє §lRadius§r §llof§r §l5§r §lBlocks§r в усіх напрямках.\n\nВін потребує щонайменше 26 сусідніх коралових блоків, щоб почати генерувати EU.\n\nКожен корал (понад 25) збільшує ефективність на 4%, а 10 Water мають виробництво 1EU/t",
  "wiki.ic2.subpage.ocean_generator.head": "Океанський Генератор",
  "wiki.ic2.subpage.overgrowth_fertilizer.head": "Добриво Переросту",
  "wiki.ic2.subpage.overgrowth_fertilizer.body": "Добриво переросту є небезпечним інструментом.\n\nВін надає високу винагороду при певному ризику.\nЗбільшує швидкість тиків врожаю у 256 разів протягом 5 хвилин.\nЦе має перевагу у тому, що культури ростуть у 256 разів швидше, але також Добриво, Ґербіциди та Гдратаційні елементи використовуються у 256 разів швидше.§<newPage>§<header;Обмеження;true>\nПісля закінчення 5 хвилин культура практично вмирає. Вона більше не відраховується.\nТак що, якщо у вас частково виросте врожай, бажаю вдачі, щоб витягти його.§<newPage>§<header;Відновлення;true>\nДобриво відновлення може бути використане для відновлення його до попередньої поведінки, але обидва можуть бути використані лише один раз на культурному стеблі.\nЯкщо ви хочете повторно застосувати його, вам потрібно розібрати і замінити культурні стебла.§<newPage>§<header;Попередження;true>\nОдним дійсно жорстоким недоліком цього є те, що якщо бур'ян коли-небудь вирішить розповсюдитися на інший культурний стеблина,\nвін також буде розповсюджувати переріст, що означає, що ви випускаєте пекло на свої ферми з культурами.§<newPage>§<header;Чому?;true>\nЧому б ви коли-небудь використовували це?\n\nУ контрольованому просторі може бути дуже корисним інструментом.\nселекція культур може займати години, щоб отримати одну культуру.\nЦе прискорює процес на ризик втрати того, що ви щойно отримали, або втрати культур, які ви використовуєте для селекція.§<newPage>§<header;Коментарі;true>\nТакож може бути використано для масового виробництва певних продуктів, які вам потрібні лише один раз і які ви не хочете довго чекати.\n\nТак що будьте попереджені, небезпечний інструмент.",
  "wiki.ic2.subpage.pressure_alloy_furnace.body": "Сплавна піч великого тиску - мультиблок, який використовує сплавну піч великого тиску та блоки її структури для утворення. Це структура розміром 2x2x2 з майстер-блоком у верхньому лівому куті згідно з його орієнтацією.",
  "wiki.ic2.subpage.pressure_alloy_furnace.head": "Сплавна піч великого тиску",
  "wiki.ic2.subpage.pump.body": "Помпа:\nЦе дійсно корисний блок, якщо вам потрібен стабільний джерело води, яке не випадково видаляється через надмірне використання. Помпа здатна перекачувати рідину лише безпосередньо під собою.\n\nДля масового очищення: будь ласка, перевірте ваш місцевий §<redirect;true;Дистанційна помпа;ic2:preview.ranged_pump>.§<newPage>§<header;Спеціальні Взаємодії з Помпою;true>",
  "wiki.ic2.subpage.pump.compressor": "Помпу можна використовувати безпосередньо з §<redirect;true;компресором;ic2:preview.compressor>.§<newPage>§<header;Компресор;true>\nВін бере воду з помп і перетворює її безпосередньо на сніжки!§<newPage>§<header;Гірник;true>\nЄ також особливі взаємодії з §<redirect;true;Гірником;ic2:preview.miner>,\nде вона допомагає Гірнику взаємодіяти з рідинами, коли вони з ними контактують.",
  "wiki.ic2.subpage.pump.head": "Помпи",
  "wiki.ic2.subpage.pump.interactions": "Взаємодія з помпою",
  "wiki.ic2.subpage.reactor.body": "Ядерний реактор - високотехнологічний та модульний генератор, який використовує компоненти реактора для вироблення електроенергії. Реактори є порожньою оболонкою, які потребують різних компонентів для правильної роботи.§<newPage>§<header;Фізика Реактору;true>\nРеактор оновлюється зліва направо, зверху вниз. Він також може вибухнути, якщо тепло перевищить максимально допустимий рівень після оновлення всіх компонентів.§<newPage>§<header;Компоненти;true>\nІснує кілька типів компонентів, таких як уранові стрижні, теплові вентилі, теплообмінники, покриття реактора, відбивачі, ізотопні стрижні, конденсатори. Компоненти можуть пошкодитися, якщо перегріваються.§<newPage>§<header;Uranium Rods;true>\nУранові стрижні генерують потужність, але також можуть викликати вибухи. Уран отримує бонус до ефективності, якщо торкається іншого уранового стрижня.§<newPage>§<header;Тепловідводи;true>\nТепловідводи охолоджують реактор, дозволяючи йому продовжувати роботу. Є різні варіанти, такі як тепловідводи, Stream Vents та електричні вентилятори.§<newPage>§<header;Теплообмінники;true>\nТеплообмінники регулюють тепловий баланс між компонентами реактора. Вони допомагають збалансувати тепло, щоб уникнути вибухів.§<newPage>§<header;Теплові балансири;true>\nТеплові балансири схожі на теплообмінники, але вони працюють як переливний балансир, регулюючи потік тепла.§<newPage>§<header;Охолоджувальна Капсула;true>\nОхолоджувальна капсула - буфер теплозберігання, яке можна заповнити або витягти тепло з нього.§<newPage>§<header;Покриття;true>\nПокриття реактора збільшує максимальну тепловіддачу та зменшує його вибухонебезпечність.§<newPage>§<header;Ізотопні комірки;true>\nІзотопні комірки використовують тепло реактора та іони уранових стрижнів для самовідновлення, покращуючи ефективність реактора.§<newPage>§<header;Конденсатори;true>\nКонденсатори - метод грубої сили для охолодження реактора, використовуючи ресурси, такі як лазурит чи червоний камінь.§<newPage>§<header;Планувальник реактора;true>\nЩоб уникнути вибухів, можна використовувати Планувальник реактора для моделювання реакторів та перевірки їх безпеки перед будівництвом. Він надає додаткову статистику та забезпечує безпечний спосіб проектування реакторів.§<newPage>§<header;ПОПЕРЕДЖЕННЯ;true>\nВажливо враховувати, що реактор може вибухнути з будь-якої причини. Забезпечте велику кількість заходів безпеки та ретельно вивчайте попередження, перш ніж приступити до будівництва реактора.",
  "wiki.ic2.subpage.reactor.head": "Ядерний реактор",
  "wiki.ic2.subpage.rocket_miner.body": "Ракетний гірник є дуже універсальним інструментом, що дозволяє повністю автоматизувати збір ресурсів, але вимагає значної кількості налаштувань для його безперебійної роботи.\n\nУ графічному інтерфейсі є кілька слотів, які дозволяють включати різні оновлення/модулі. До них належать:\n- §<newPage>§<header;Компоненти;true>\n- §<redirect;true;Завантажувач чанків;ic2:preview. chunkloader>, що дозволяє працювати, навіть якщо гірник знаходиться за тисячі блоків від місця заправки, \n- §lГірнична труба§r §lсховище§r для дуже глибоких руд, \n- §lКапсули§r для роботи з рідинами, які інакше могли б зупинити гірник\n- §l: Генерація каміння§r §lпокращення§r для заповнення частини його безладу назад. §<newPage>§<header;Переробка;true>\nПотенційно, ви можете включити переробник для утилізації непотрібних блоків.\nЦе вирішує сканер. Це означає, що бруківка і бруд, наприклад, перетворюються на брухт/коробки.\nЦе робиться для того, щоб збільшити обсяг сховища для потрібних вам речей і зменшити кількість сміття.§<newPage>§<header;Накопичувачі енергії;true>\nЩе важливішим є Накопичувач енергії та слот для Дистанційного гірника. Перший дозволяє заряджати високовольтну батарею енергії і використовувати її під час роботи гірника.\nДругий §<redirect;true;Дистанційний гірник;ic2:preview.miner_remote> дозволяє гірнику знайти шлях додому, щоб дозаправитися. §<newPage>§<header;Refueling;true>\nПідзарядка є критично важливою частиною роботи Ракетний гірник, оскільки його енергетичного буфера вистачить лише на деякий час, після чого або внутрішній накопичувач заповниться і він більше не зможе ефективно працювати.\nКоли гірник або \n- §lA§r.) досягне певного порогу залишкової енергії, він полетить додому для підзарядки\n\n- §lB§r.) коли внутрішній накопичувач заповниться, він полетить додому, щоб віддати свої предмети. \nПовернувшись додому, він чекатиме на сигнал червоного каменя, щоб полетіти на роботу. Будьте обережні, ви ж не хочете, щоб він полетів назад до того, як буде готовий, тому намагайтеся уникати постійних сигналів червоного каменю на точці заправки.",
  "wiki.ic2.subpage.rocket_miner.head": "Ракетний гірник",
  "wiki.ic2.subpage.second_tier.body": "Ви досягли моменту, коли хочете перейти на наступний рівень.\n\nЩо вам насправді потрібно:\n\n- Енергетична система, яка може виробляти принаймні 50-80EU/т\n\n- Багато бруду/глини/теракоти§<newPage>§<header;Aluminium;true>\nВаша мета - виробляти алюміній (Alu) для просунутих механізмів. \n \nАлюмінієвий пил можна отримати за допомогою §<redirect;true;Рідкоземельного екстрактор;ic2:preview.rare_earth_extractor>. \nВикористовуючи Бруд/Глину/Теракоту,\n- §lБруд§r - найповільніший спосіб, але найлегший для отримання.\n- §lГлина/Теракота§r - найкращий спосіб, якщо можливо.§<newPage>§<header;Nether Aluminium;true>\nВи також можете знайти алюміній у Нідерландах, але він дуже добре захований,\nале якщо ви знайдете 1-2 штуки, то ви готові до середини гри. \nОтримавши алюмінієвий пил, ви переробляєте його у §<redirect;true;Alloy Smelter;ic2:preview.alloy_smelter> з піском.\n\nОсь де вам знадобиться енергія. Це енергоємна машина.\n\nПереконайтеся, що вона не висмокче вашу електромережу насухо!\n\n§<newPage>§<header;Machine List;true>",
  "wiki.ic2.subpage.second_tier.head": "Другий рівень",
  "wiki.ic2.subpage.second_tier.list": "Це машини/матеріали, які вам потрібні.\nТак, трохи сухувато, але розважайтеся, знаходячи блискучі речі самостійно!",
  "wiki.ic2.subpage.simple_crop_library.body": "Проста бібліотека культур - об'ємне рішення для зберігання насіння культур.\n\nХоча найобмеженіше рішення, воно не потребує живлення і скидає весь вміст при розбитті.\n\nВона зберігає 20 типів культур і кожен тип може мати 20 мутацій з 128 збереженими елементами.\n\nЩо призводить до загального обсягу зберігання 51,200 насінин культур, які вона потенційно може зберігати.\n\nЦе задовольнить вашу потребу у зберіганні насіння культур на початкових етапах гри. Це набагато краще, ніж подвійна скриня, і надає набагато більше інформації.\n\nЄдиним реальним недоліком є те, що насіння культур має бути проаналізоване для зберігання у бібліотеці.",
  "wiki.ic2.subpage.simple_crop_library.head": "Проста бібліотека культур",
  "wiki.ic2.subpage.steam_reactor.body": "Паровий реактор є покращенням ядерного реактора.\n\nХоча і за досить високу ціну.\nУ паровому реакторі змінюється кілька правил, які роблять його більш ризикованим, але й набагато цікавішим.§<newPage>§<header;Яка різниця?;true>\nПерш за все, тепло, яке виробляє уран, тепер є вашим виробничим потенціалом, а не електричною енергією.\nТепло має проходити через парові вентилятори, які використовують внутрішній резервуар реактора для перетворення тепла на пару. §<newPage>§<header;Парові вентилятори;true>\nПарові вентилятори тим ефективніше перетворюють тепло на пару, чим гарячіші вони є. Якщо вони не мають води або не можуть випускати пару, то вони миттєво припиняють охолодження. §<newPage>§<header;The Reward;true>\nІ остання, але масивна зміна - тактова частота реактора у 20 разів вища за звичайний реактор.\n\nЦе означає, що у вас дуже мало часу на виправлення помилок.\n\nВинагородою буде вища потенційна потужність.\n\nЯкщо ви зможете впоратися з теплом! На відміну від якогось Довахкіна0_0",
  "wiki.ic2.subpage.steam_reactor.head": "Паровий реактор",
  "wiki.ic2.subpage.steam_tunnel.body": "Паровий тунель - мультиблок, який виробляє EU з пари і здатний переробляти пару назад у воду.\n\nВін споживає до 4096mB за тик для виробництва 2048EU/т, у пакетах по 512EU. §<newPage>§<header;Structure;true>\nСтруктура є порожнистою 5x3x3 і §<redirect;true;Клапан;ic2:preview.valve> може використовуватися для заповнення/зливу пари/води.\nВін використовує блоки машинної структури і блок парового тунелю в центрі леза.",
  "wiki.ic2.subpage.steam_tunnel.head": "Паровий тунель",
  "wiki.ic2.subpage.tank.body": "Бак - повністю динамічний мультиблок, який можна побудувати від 3x3x3 до 50x200x50.\n\nВін може бути побудований з великою варіацією блоків.\n\nКожен повітряний блок коштує 16 відер.\n\n§<redirect;true;Клапан;ic2:preview.valve> може бути використаний у будь-якому не каркасному блоці для взаємодії з танком.\n\nСкляні блоки не допускаються у каркасі.\n\nОсь список допустимих блоків: ",
  "wiki.ic2.subpage.tank.head": "Бак",
  "wiki.ic2.subpage.teleporter.body": "Для зв'язування телепортів вам потрібен §<redirect;true;Передавач частоти;ic2:preview.frequency_transmitter> і використовуйте його на відповідних телепортах для зв'язування.",
  "wiki.ic2.subpage.teleporter.body2": "Телепортер здатний телепортувати багато речей, включно з сутностями, рідинами, предметами та ЄС.\n\nВін телепортує все, що знайде перед собою, якщо воно збігається з іншим телепортом.\n\nЯкщо перед ним є контейнер для зберігання (наприклад, скриня), він телепортує предмети до контейнера для зберігання іншого телепортатора. \nТе саме стосується рідин та ЄС з відповідним контейнером для рідини (бак) та контейнером для ЄС (наприклад, MFSU).\n\nЩо стосується об'єктів, то він телепортує будь-який об'єкт, який знаходиться перед ним, якщо на іншій стороні є місце.\n\nМайте на увазі, що затрати дуже високі, але робиться масово.",
  "wiki.ic2.subpage.teleporter.head": "Телепортер",
  "wiki.ic2.subpage.tesla_coil.body": "Як вже було сказано, Котушка Тесла дуже корисна для ферм мобів.\n\nКотушка Тесла має радіус 4 блоки і завдає однакової шкоди всім ушкоджуваним об'єктам в радіусі дії.\n\nВона розряджається кожні 32 тики(1. 6 секунд) і завдає 1 пошкодження за кожні 400 розряджених EU.\n\nВважається фальшивим гравцем, тому буде давати дроп \"Тільки для гравця\".\n\nЕлектрична броня захищає від смертельної дії високої напруги СМЕРТІ і може перетворити її в безкоштовну зарядку!",
  "wiki.ic2.subpage.tesla_coil.head": "Котушка Тесли",
  "wiki.ic2.subpage.thermal_gen.body": "Теплогенератор - більш ефективний геотермальний генератор.\n\nВін збільшує час роботи палива на 50% і виробляє на 50% більше енергії, а також має пасивне виробництво енергії.\nЦе залежить від блоків навколо нього, яке також може бути підсилене / ослаблене біомом, в якому він знаходиться.§<newPage>§<header;Теплогенератор;true>\nОсь приблизний список:\n- §lСхожий на лаву§r: 0.005EU/блок\n- §lВогонь / Розливаючася лава§r: 0.0015EU/блок\n- §lБлок магми§r: 0.0035EU/блок\n- §lОбсидіан§r: 0.0025EU/блок\n- §lКамінь / Металеві блоки§r: 0.001EU/блок\n- §lСхожий на воду§r: -0.0015EU/блок\n- §lБлоки снігу§r: -0.0025EU/блок\n- §lБлоки льоду§r: -0.005EU/блок\nУ найкращому випадку, всі блоки лави, призведе приблизно до 16EU пасивного виробництва.\nХоча в середньому ваша пасивна продукція становитиме близько 5EU в горах або близько 10EU в пеклі...",
  "wiki.ic2.subpage.thermal_gen.head": "Термогенератор",
  "wiki.ic2.subpage.third_tier.body": "Хей, нарешті ти дійшов до моменту, коли думаєш, що настав час перейти на наступний рівень.\n\nАле ти не впевнений, з чого почати.\nНе хвилюйся, ми підготували для тебе докладний план!\n\nОсь деякі вимоги, які ти повинен перевірити, перш ніж починати:§<newPage>§<header;ВИМОГИ!;true>\n- §lПотужність§r: Маєш щонайменше 300-500EU продукції енергії, стабільно. \nХоча не є обов'язковим, воно значно полегшує життя, оскільки зараз ми переходимо до етапу, коли дуже потрібна енергія.\n- §lРесурси§r: Переконайся, що у тебе є декілька стеків кварцу та рідкоземельних металів. Хоча їх не важко отримати, вони є необхідними.§<newPage>§<header;Як продовжити!;true>\nТепер, коли ти §mне§r переконався, що у тебе є все необхідне.\nОсь що тобі потрібно зробити:\n\n- Використовуй кварц і червоний камінь у §<redirect;true;Сплавний піч;ic2:preview.alloy_smleter>, щоб виробити Пульсуючий кварц§<newPage>§<header;Як продовжити!;true>\n- А рідкоземельні метали перетвори на магніти за допомогою §<redirect;true;Електролізер;ic2:preview.electrolyzer>\n\n\nЦі два ресурси дозволять тобі виробляти машини наступного рівня, які ти так прагнеш, щоб увійти в наступний рівень прогресу...\nДобре, я перестану вживати ці великі слова... перейдемо до БЛИСКУЧИХ речей!§<newPage>§<header;Блискучі речі!;true>",
  "wiki.ic2.subpage.third_tier.head": "Третій рівень",
  "wiki.ic2.subpage.third_tier.list": "На цей момент ви справді повинні знати, чого ви хочете.\nЩе дійсно необхідний посібник?!?!?!?!\nТАК ЗВИЧАЙНО! Правда?",
  "wiki.ic2.subpage.tube_tool.body": "Конфігуратор Труб - велике розширення системи труб.\n\nВін дозволяє реалізувати можливості, недоступні без нього, активуючи функції, які за замовчуванням вимкнені.\n\nОскільки функцій так багато, наведено список того, що воно може робити.",
  "wiki.ic2.subpage.tube_tool.head": "Конфігуратор Труб",
  "wiki.ic2.subpage.tubes.body": "Система Труб - досить проста, але ефективна система в IC2.\nАле на відміну від повністю автоматичних варіантів, які більше в дусі Minecraft.\n\nЄ купа варіантів, кожен з яких виконує свою специфічну функцію, і ваше завдання - використовувати їх так, щоб вони відповідали вашим потребам.§<newPage>§<header;Трубна сітка;true>\nЦе може бути легким завданням, якщо невелика система, але також може стати дуже складним, якщо ви намагаєтеся зробити щось велике/складне одразу.\nТак що пам'ятайте про це, коли ви використовуєте їх.\n\nЗагалом, система труб надає вам все необхідне для створення прийнятної системи автоматизації.§<newPage>§<header;Інструмент для труб;true>\nТакож переконайтеся, що ви перевірили §<redirect;true;Інструмент для труб;ic2:preview.tube_tool>.\nВін містить деякі додаткові функції для труб, які можуть бути включені за бажанням.\nТакі як керування червоним каменем, розширена з'єднуваність та кілька інших речей.§<newPage>§<header;Логістична сітка;true>\nСистема труб також поставляється з приєднаною логістичною системою для більш масштабного рішення автоматизації.\nАле на відміну від інших варіантів, вони не вирішують \"Маршрутизацію\", все, що вони роблять - надсилають та виконують запити, ви відповідальні за управління маршрутизацією!§<newPage>§<header;Базовий запит;true>\n§<image;ic2:textures/wiki/logistic_grid.png;45>\n§<padding;5>\nОсь найпростіший приклад того, як може виглядати логістична сітка!\nМає простий §<redirect;true;Запитова труба;ic2:preview.request_tube> справа та §<redirect;true;Постачальна труба;ic2:preview.provider_tube> зліва.§<newPage>§<header;Базовий запит;true>\nЗапитова труба автоматично надсилає запити через підключені труби до всіх постачальних труб.\nЯкщо є наявний запас, він буде відправлений!§<newPage>§<header;Маршрутизація;true>\n§<image;ic2:textures/wiki/logistic_crossing.png;75>\n§<padding;5>\nАле як ви вирішуєте перехрестя в такому сценарії.\nЗазвичай труби просто рандомізують, куди йдуть речі.\nТак що ця поточна установка просто не буде працювати.\nРішення?\nЄ 2 рішення для цього:\n- §<redirect;true;Труба з фільтром;ic2:preview.filter_tube>, що дозволяє фільтрувати напрямки на основі предметів.\n- §<redirect;true;Труба з кольоровим фільтром;ic2:preview.color_filter_tube>, яка дозволяє фільтрувати напрямки за кольорами.\n\nТак, запитники можуть бути встановлені з \"кольором запиту\", тому вам не потрібно налаштовувати фільтр для кожного потенційного предмета.§<newPage>§<header;Розподіл сітки;true>\n§<image;ic2:textures/wiki/logistic_splitting.png;75>\n§<padding;5>\nЯк ви вирішуєте сценарій, де ви хочете, щоб сітка ділилася, але запити були лише частково спільними для 2 сіток.\nУ цьому випадку ви хочете, щоб зелене/синє було доступним на іншій сітці, тоді як червоне залишалося розділеним.\nОскільки ви не можете фільтрувати червоний, щоб він йшов на праву сторону, оскільки запит надає лише колір, але не те, в яке місвін повинен потрапити.\n\nІ запити не цікавляться, чи може елемент пливти кудись, чи ні.§<newPage>§<header;Розподіл сітки;true>\nРішення насправді досить просте.\n§<redirect;true;Труба обмеження запитів;preview.limiter_tube> в основному блокує будь-які запити від проходження через нього.\nІ вам потрібно специфічно активувати колір, який ви хочете пропустити.\n\nЦе означає, що ви можете просто встановити його, щоб пропускати запити зеленого/синього, тоді як всі червоні запити залишаються в своїй місцевій сітці.§<newPage>§<header;Порівняння з BuildCraft;true>\nВеликий слон в кімнаті полягає в тому, що сильно натхнене BuildCraft.\n\nОсь деякі ключові відмінності:\n- §lВибух§r: Труби ніколи не вибухають, якщо ви кидаєте занадто багато предметів.\nАле як спосіб зменшення витрат на продуктивність/затримку, вони не обробляють більше 100 окремих стеків одночасно, що означає, що вони застрягають, поки не залишиться місце. Це значно економить сервери!\n\n\n- §lПродуктивність§r: Труби мають справу з оптимізацією. Хоча вони можуть спричиняти затримки на сервері, ви можете розмістити десятки тисяч їх і майже не відчути затримки від них.\n\n\n- §lГравітація§r: Гравітація існує. Це означає, що предмети, що рухаються вниз, розганяються, тоді як предмети, що рухаються вгору, сповільнюються швидше, ніж рухаються горизонтально. Існує мінімальна швидкість, однак.\n\n- §lТрубні проводи§r: Не існують.",
  "wiki.ic2.subpage.tubes.head": "Труби та Логістичні труби",
  "wiki.ic2.subpage.uu_crop_library.body": "Бібліотека культур UU(УП)-матерію кількість одиниць у стопці змінено на 1.\nІ зберігання такого насіння коштує 512 EU.\nМожливість бібліотеки культур UU(УП)-матерію полягає в клонуванні насіння. Використовуючи UU(УП)-матерію та EU.\nКлонування культури коштує кількість статистики, яку вона має, помножену на 10000 EU та 1 одиницю UU(УП)-матерію за кожен клонований предмет.\nВона може зберігати до 512 UU(УП)-матерію.",
  "wiki.ic2.subpage.uu_crop_library.head": "Бібліотека культур UU(УП)",
  "wiki.ic2.subpage.villager.body": "IC2C також додає деяких Селян у гру.\nЦих можна розблокувати за допомогою різних блоків професій.§<newPage>§<header;Електротехнік;true>\n§lБлок:§r §lЗалізна піч§r\nЦей електрифікований Селян - ваш постачальник компонентів, він продає схеми та кілька інших речей.\nМоже бути корисним, якщо у вас мало заліза!\nХоча я б уникав його, оскільки декілька Селян повідомили, що удари зробили його сум'ятим...§<newPage>§<header;Ядерний інженер;true>\n§lБлок:§r §lЯдерний реактор§r\nЦей якось зелено світяться Селян - ваш постачальник реакторів, який продає компоненти реактора та уран...\nЦе пояснює світіння... Я думаю.\nАле один зі способів отримати багато урану.§<newPage>§<header;Фермер культур;true>\n§lБлок:§r §lПроста бібліотека культур§r\nФальшивий фермер - ваш місцевий любитель культур. Нічого підозрілого в ньому.\nВін продає культури з поганими або прийнятними статистиками, або деякі предмети, пов'язані з культурами.§<newPage>§<header;Ви;true>\n§lБлок:§r §lДинаміт§r\nЦей вкритий пилом Селян - ваш інженер-вибухівник.\nПотрібно щось підривати? Він ваш чоловік!\nПродає всі види вибухових речовин та пошкодженого металу!\nТільки переконайтеся, що ніколи не залишаєте його самого з вибуховими речовинами у вашій базі!§<newPage>§<header;Майстер пивоваріння;true>\n§lБлок:§r §lБочка§r\nЦей п'яний Селян - ваш експерт з пивоваріння!\nПродає всі види пива та віскі.\nДуже приємна людина для розмови!§<newPage>§<header;Грег;true>\n§lБлок:§r §lПіксельна піна GregTech§r\nГрег - це... Грег. Він був настільки божевільним, що ми змусили його стати Селянином!\nВін також затвердив це... Ну, він лише сказав \"хммммммммммм\", але повинно бути згода...\nПравда! Правда???\nВін продає будівельної пін, інструменти та кілька інших речей.\nПросто будьте обережні. Деякі угоди занадто хороші, щоб бути правдою!§<newPage>§<header;Рецепти;true>",
  "wiki.ic2.subpage.villager.head": "Селяни",
  "wiki.ic2.subpage.villager.recipes": "Тут ви знайдете всі рецепти для створення необхідних блоків!",
  "wiki.ic2.subpage.villager_o_mat.body": "Селян-О-Мат - автоматичний торговець, який використовує крадіжку ідентичності, щоб торгувати від вашого імені!\n\nХоча на початку може звучати марно, але насправді він дуже корисний.\nОскільки ви зберігаєте всі корисні знижки, які торговець зробить з часом для вас.\nАбо, якщо ви їх збережете, знижки рятівника.§<newPage>§<header;Механіка для всієї родини!;true>\nДавайте ігнорувати той факт, що вас стимулювали створювати ситуації, коли Селян потрібно було рятувати!\n\n§lкхе§r §lкхе§r Де/Зомбіфікація для отримання знижок §lкхе§r §lкхе§r§<newPage>§<header;Інтерфейс користувача;true>\n§<image;ic2:textures/wiki/villager_o_mat.png;85>\n§<padding;2>\nІнтерфейс здається складним, але насправді він досить простий.\nСмуга у верхній частині - збережені очки досвіду, які автоматично збираються при здійсненні торгівлі.§<newPage>§<header;Інтерфейс користувача;true>\nСелектор Селяна відстежує всіх Селянів, яких він може знайти\nі дозволяє вам вибрати їх всіх.\nПри цьому відображаються смуги досвіду.\n\nСеляни, у яких немає смуг досвіду, - «Категорії» Селян, які дозволяють вам масово вибирати їх, щоб зменшити рутинну роботу.§<newPage>§<header;Вибір торгівлі;true>\nОсновний елемент - власне ваш вибір торгівлі.\nВи просто клікаєте на Торгівлю, щоб вимкнути/увімкнути її.\n\nРозділ Введення/Виведення в основному показує вам, звідки імпортуються предмети для торгівлі і куди експортуються результати торгівлі.\nНа вихід підтримує Труби, але не вхід.§<newPage>§<header;Як працює?;true>\nСелян-О-Мат - досить повільний пристрій.\nВін намагається здійснювати торгівлю лише раз на хвилину. Проте він спробує обробити кожну вибрану торгівлю одночасно.\nЯкщо була здійснена хоча б одна торгівля, він стягне з вас 6000EU за кожну вибрану торгівлю, ігноруючи, чи було здійснено торгівлю, чи ні.§<newPage>§<header;Як працює?;true>\nЦе звучить дуже дорого, але якщо у вас обрано 20 торгівель, що означає 6000EU, становить 100EU/т, що насправді споживається.\nЦе не так дорого.\nІ навіть не враховує того, що Селян може торгувати лише двічі на день.",
  "wiki.ic2.subpage.villager_o_mat.head": "Селян-О-Мат",
  "wiki.ic2.subpage.wrench.body": "§<redirect;true;Гайковерт;ic2:preview.wrench> є досить суперечливою механікою у IC2C.\n\nЦе ваш єдиний інструмент для зняття машин.\nУ старих версіях не було чітко окреслно, що він робить.\nУ цій версії було змінено на 3-х кольорове накладання на блок, що мають свої властивості. §<newPage>§<header;Синя;true>\n§<image;ic2:textures/wiki/wrench_blue.png;90>\n§<padding;5>\nСинє накладання призначене для зміни напрямку блоку.\nНапрямок встановлюється залежно від того, на яку частину блоку ви клацнете.\n- §lУ центрі§r: Встановлює напрямок до сторони, з якої ви клацнули. (Протилежний, при зажатому Shift)\n- §lЛівуроч§r: Задає напрямок ліворуч від натиснутого напрямку.\n- §lПраворуч§r: Задає напрямок праворуч від натиснутого напрямку.\n- §lНиз/Верх§r: Задає напрямок вниз/вгору від натиснутого напрямку: Встановлює напрямок вниз/вгору.\n\n\nОтже, якщо ви не натискаєте на центр, ви встановлюєте напрямок, виходячи з того, в який бік ви диветесь.§<newPage>§<header;Жовта;true>\n§<image;ic2:textures/wiki/wrench_yellow.png;90>\n§<padding;5>\nЖовте накладання призначене для спеціальних дій.\nНаприклад, видалення Гірничних труб з інших труб.§<newPage>§<header;Червоний;true>\n§<image;ic2:textures/wiki/wrench_red.png;110>\n§<padding;5>\nЧервоне накладання призначене для зняття машини. При знятті, сама сторона не має значення.§<newPage>§<header;Зняття;true>\n§<image;ic2:textures/wiki/wrench_loss.png;70>\n§<padding;5>\nПри знятті машини немає гарантії, що ви зможете її зняти не зламав. §<newPage>§<header;Якщо все таки зламали;true>\nЯкщо вам не пощастило, ви отримаєте Машинний блок відповідного рівня замість машини.\n\nОдин зі способів зменшити верогідність втрати - зачарувати свій ключ на Фортуну. Це дає 10% множник на кожен рівень.\n\nАле грубі рішення можуть завести вас лише до цього рівня!\n\nІнший спосіб - зробити §<redirect;true;Електричний Гайковерт;ic2:preview.electric_wrench>,\nякий має невтратний режим.\nЦей режим заднім числом гарантує, що машина не буде зламана, ціною її дуже обмеженого використання.\nТрохи пояснення: Ви перевантажуєте схему, щоб досягти ідеального результату, але ваша система може впоратися лише з таким навантаженням.\nПізніше ви можете оновитися, що дасть вам 100% верогідність не втратити машину. §<newPage>§<header;Суперечності;true>\nМеханіка втрат машин викликала суперечки, \nдеяким людям ця функція дуже не подобається. Настільки, що вони проходять повз 1.19.2 . \nЯ вніс кілька змін до цієї функції, оскільки вона мені подобається, щоб зробити її доступнішою.\n\nАле деяким людям все одно байдуже, і вони воліли б видалення цієї функції.\n\nЦитуючи TFS Android 16:\n§l\nВаша згода не є показником\n§r\n\nТому, якщо вам вона не подобаєьтся, тоді цей мод не для вас.",
  "wiki.ic2.subpage.wrench.head": "Гайковерт",
  "wiki.ic2.translated": "Andrij Zyniuk(IsPlayer), Factor-OVF(Factoriador)",
  "wiki.ic2.translated_by": "Перекладено українською: "
}