{
  "wiki.ic2.category.armors": "Броня",
  "wiki.ic2.category.batteries": "Батарейки",
  "wiki.ic2.category.block_misc": "Разное",
  "wiki.ic2.category.blocks": "Блоки",
  "wiki.ic2.category.brewing": "Пивоварение",
  "wiki.ic2.category.cables": "Кабели",
  "wiki.ic2.category.cfoam": "Строительная пена",
  "wiki.ic2.category.credits": "Благодарность",
  "wiki.ic2.category.crops": "Культуры",
  "wiki.ic2.category.early_game": "Ранняя игра",
  "wiki.ic2.category.electric_blocks": "Электрические блоки",
  "wiki.ic2.category.electric_tools": "Электроинструменты",
  "wiki.ic2.category.electricity": "Электричество",
  "wiki.ic2.category.essentials": "Основы",
  "wiki.ic2.category.explosives": "Взрывчатые вещества",
  "wiki.ic2.category.first_day": "Первый день",
  "wiki.ic2.category.fluid_blocks": "Жидкие блоки",
  "wiki.ic2.category.fluids": "Жидкости",
  "wiki.ic2.category.fourth_tier": "Четвертый уровень",
  "wiki.ic2.category.general": "Общие",
  "wiki.ic2.category.generators": "Генераторы",
  "wiki.ic2.category.gui": "Знание графического интерфейса",
  "wiki.ic2.category.item_energy": "Портативная энергия",
  "wiki.ic2.category.item_misc": "Разное",
  "wiki.ic2.category.items": "Предметы",
  "wiki.ic2.category.logistic": "Логистический транспорт",
  "wiki.ic2.category.machines": "Машины",
  "wiki.ic2.category.misc": "Разное",
  "wiki.ic2.category.misc_tutorials": "Разное",
  "wiki.ic2.category.monitor_cards": "Карты монитора",
  "wiki.ic2.category.personal_blocks": "Личные блоки",
  "wiki.ic2.category.progression": "Прогресс",
  "wiki.ic2.category.reactor": "Компоненты реактора",
  "wiki.ic2.category.reactors": "Реакторы",
  "wiki.ic2.category.scanners": "Сканеры",
  "wiki.ic2.category.second_tier": "Второй уровень",
  "wiki.ic2.category.third_tier": "Третий уровень",
  "wiki.ic2.category.tools": "Инструменты",
  "wiki.ic2.category.tubes": "Трубы",
  "wiki.ic2.category.tutorials": "Учебники\n§l§4Инструкции для начинающих!§r",
  "wiki.ic2.category.upgrades": "Обновления",
  "wiki.ic2.category.villager": "Жители!",
  "wiki.ic2.category.wrenches": "Гаечные ключи",
  "wiki.ic2.page.blocks.cables": "Кабели",
  "wiki.ic2.page.blocks.cables.desc": "Кабели — единственный способ передачи электроэнергии.\n\nУ них разные ограничения по передачи, а так-же потери \nОбязательно изолируйте их, иначе они могут вас ударить током... или нет...§<newPage>§<header;Tutorial;true>\nПожалуйста, ознакомьтесь с §<redirect;true;Основы Элекричества;ic2:subpage.electricity> \nчтобы знать, как оно работает!",
  "wiki.ic2.page.blocks.cfoam": "Строительная пена",
  "wiki.ic2.page.blocks.cfoam.desc": "Строительная пена — ваш входной билет в мир ее собственной магии.\n\nНастоятельно рекомендуем вам быть осторожными!\nНе многие возвращаются после того, как дошли до этого места...§<newPage>§<header;Что это?;true>\nСтроительная пена – это блок, который можно использовать для:\n- §lДекораций§r \n- §lТекстурирования§r §lКопирования,§r используя §<redirect;true;Хамелеон;ic2:preview.obscurator>\n- §lСкрытия§r §rблоков§r по типу Труб и Проводов\n- §lСоздания§r §<redirect;true;Усиленного камня;ic2:preview.reinforced_stone>§<newPage>§<header;Как использовать?;true>\nОбычно вы создаете §<redirect;true;Жидкую ст. пену;ic2:preview.wet_cfoam> и ставите её.\nОна либо высохнет сама если тут достаточно светло, либо вручную используя Песок или Цемент если не привыкли ждать.\nЦемент автоматически перекрасит ее. Хотя это можно сделать и после высыхания используя §<redirect;true;Валик;ic2:preview.painter>§<newPage>§<header;Распыленная ст. пена;true>\nЕсли вы сожмете ее в Гранулы ст. пены, вы получите 13x множитель ст. пены, после чего гранулы могут быть помещены в §<redirect;true;Распылитель ст. пены;ic2:preview.foam_sprayer>.\nБазовый вариант будет распылять в направлении, куда вы смотрите.\nИли же §<redirect;true;Электрический расп. ст. пены;ic2:preview.electric_sprayer> можно использовать для контроля количества распыляемого вещества.\nХотя для этого требуется консервная машина.§<newPage>§<header;Текстурирование;true>\nКак только ст. пена высохнет, можно поменять ее текстуру при помощи §<redirect;true;Хамелеона;ic2:preview.obscurator>.\nСам Хамелеон может копировать текстуры, что означает, что вы можете использовать его для нанесения \"почти\" любой текстуры на строительную пену.\n\nХотите дом из алмазных блоков как в старые добрые, но не хотите тратить алмазы?\nПоложите блок, используйте на нем Хамелеон и разместите вокруг много ст. пены!\nХотите потроллить своих друзей типа RF работает с IC2?\nСкопируйте RF-блок из модов и нанесите его на кабель IC2, а затем поставьте другой кабель рядом с ним!\nПоверьте мне, они будут в шоке :D (Тестил множество раз)§<newPage>§<header;Примечания;true>\nОбратите внимание, что Хамелеон работает только со следующими типами ст. пены:\n- Цельные блоки\n- Плиты\n- Ступеньки\n- Стены\n\nПочему? Потому что сделать их совместимыми очень сложно.\nОсобенно с набором функций, встроенных в них.",
  "wiki.ic2.page.blocks.electric_blocks": "Электроблоки",
  "wiki.ic2.page.blocks.electric_blocks.desc": "Электроблоки — это ваши инструменты, которые сделают вашу электрическую сеть более стабильной и сложной.\n\nЭлектрические накопители, трансформаторы, зарядные устройства, станции, источники света — все, что вы можете пожелать.\n \nУ этих инструментов тоже есть несколько уровней.",
  "wiki.ic2.page.blocks.explosives": "Взрывчатка",
  "wiki.ic2.page.blocks.explosives.desc": "Взрывчатые вещества являются частью индустриализации.\n\nПоэтому IC2 Classic добавляет пару блоков по этому поводу.\nКроме того, IC2C ослабляет пару блоков взрывозащиты, чтобы сделать разрушение менее сдерживаемо.\nЭто не меняет ваниль ни в какой форме, поскольку сопротивление было уменьшено только для того, чтобы сделать более сильные взрывы на самом деле сильнее.\n\nПриведу пример: 6 обсидианов были достаточно прочными, чтобы сдержать 1 ядерный заряд без каких-либо повреждений.\nТеперь вам нужно гораздо больше, чем это.\nОбсидиан был ослаблен с 1200 до 60. (Ванилла делает 4)",
  "wiki.ic2.page.blocks.fluid_blocks": "Жидкие блоки",
  "wiki.ic2.page.blocks.fluid_blocks.desc": "В IC2 Classic есть много блоков, которые используют жидкости или работают с ними.\n\nПоэтому необходима специальная система транспортировки жидкости.\nПредставляем систему подачи жидкости.\n\nКакие наиболее активные производители жидкости автоматически поддерживаются.§<newPage>§<header;Pipes;true>\nДля всего остального у труб есть графический интерфейс, в котором их можно настроить для самостоятельного извлечения жидкости.\nУ труб также есть \"Приоритетная система\" который основан на: меньшее число => более высокий приоритет.\nУказанный графический интерфейс доступен, если присутствует резервуар, а в вашей руке нет предмета.§<newPage>§<header;Realism;true>\nТрубы имеют сопротивление при проталкивании жидкостей через них.\nВ зависимости от силы источника вы можете пройти только определенное расстояние.\nДвижение по горизонтали потребляет 1 Силу, опускание ничего не стоит, а подъем требует 2.\nКроме того, сеть пытается использовать равное распределение, и только в том случае, если остается жидкость, она будет выполнять действия с более низким приоритетом.",
  "wiki.ic2.page.blocks.generator": "Генераторы",
  "wiki.ic2.page.blocks.generator.category": "Следующие уровни генераторов доступны вам в зависимости от того, как далеко вы продвинулись\n\n- §<redirect;true;Генераторы НН;ic2:blocks.generators.lv> \n- §<redirect;true;Генераторы СН;ic2:blocks.generators.mv> \n- §<redirect;true;Генераторы ВН;ic2:blocks.generators.hv> \n- §<redirect;true;Компактные Генераторы;ic2:blocks.generators.compact>",
  "wiki.ic2.page.blocks.generator.compact": "Компактные генераторы",
  "wiki.ic2.page.blocks.generator.compact.desc": "Компактные генераторы — это странная концепция, созданная из-за особой потребности\nдля уменьшения задержек в мире, поскольку Tile Entities на самом деле не оптимизированы.\n\nСегодня это на самом деле больше не требуется, поскольку эти генераторы гипероптимизированы,\nно они по-прежнему нужны для экономии места и для шутки.\n\nЧтобы сделать это менее OP, вы платите дополнительные ресурсы для достижения сжатия.",
  "wiki.ic2.page.blocks.generator.desc": "Вам нужна энергия?\nУ нас есть энергия!\nНиже перечислены решения IC2C по выработке электроэнергии для всех ваших потребностей,\nот низкого напряжения (НН) до высокого напряжения (ВН). ).\nЭнергия используется в формате 'EU/t', или электрических единиц на тик. Если вы еще не ознакомились с учебными пособиями, сделайте это.\nEU подробно объясняется там.",
  "wiki.ic2.page.blocks.generator.hv": "Генераторы высокого напряжения",
  "wiki.ic2.page.blocks.generator.hv.desc": "Генераторы высокого напряжения — ваши производители энергии в конечной игре.\n\nЭто улучшенные формы существующих источников энергии, которые делают их намного лучше\n\nдля компенсации повышенные требования к мощности, которые потребуются вам в этот момент.\nКроме того, эти генераторы нелегко автоматизировать.\n\nОни либо небезопасны, либо имеют особые требования, такие как постоянная стоимость.",
  "wiki.ic2.page.blocks.generator.lv": "Генераторы низкого напряжения",
  "wiki.ic2.page.blocks.generator.lv.desc": "Генераторы низкого напряжения — это ваш ранний доступ к энергии в игре.\n\nЭти решения представляют собой либо небольшие пассивные производители энергии, либо производство энергии, потребляющее ресурсы.\n\nЭто должно чтобы вы начали, пока вы не перейдете к более позднему производству энергии в игре.",
  "wiki.ic2.page.blocks.generator.mv": "Генераторы среднего напряжения",
  "wiki.ic2.page.blocks.generator.mv.desc": "Генераторы среднего напряжения — это шаг к надежному производству электроэнергии.\n\nЭти генераторы используют свое топливо намного эффективнее и/или требуют более дорогого топлива для работы.\n\nЭто должно значительно увеличить производство электроэнергии",
  "wiki.ic2.page.blocks.machines": "Машины",
  "wiki.ic2.page.blocks.machines.category": "В зависимости от вашего прогресса в игре вам доступны следующие уровни машин.\n\n- §<redirect;true;NV Machines;ic2:blocks.machines.nv> \n- §<redirect;true;LV Machines;ic2:blocks.machines.lv> \n- §<redirect;true;MV Machines;ic2:blocks.machines.mv> \n- §< redirect;true;HV Machines;ic2:blocks.machines.hv> \n- §<redirect;true;EV Machines;ic2:blocks.machines.ev> \n- §<redirect;true;LuV Machines;ic2:blocks .machines.luv> \n- §<redirect;true;Промышленный рабочий стол;ic2:blocks.machines.worktable> ",
  "wiki.ic2.page.blocks.machines.desc": "IC2Classic — это мод о индустриализации. Это означает машины. Многие блоки в IC2C — это машины.\n\nМашины в настоящее время разделены на шесть уровней в зависимости от количества ЕС/т они потребляют и, что более важно, могут безопасно принимать.\nМашины NV (без напряжения) не требуют электроэнергии, но нуждаются в запасе печного топлива, такого как уголь или дрова.",
  "wiki.ic2.page.blocks.machines.ev": "Машины сверхвысокого напряжения",
  "wiki.ic2.page.blocks.machines.ev.desc": "Машины с экстремальным напряжением — ваш путь к финальной игре.\n\nОни дают вам доступ к последнему уровню инструментов и машин, требующих большой мощности. \n\nНекоторые могут возразить, что оно того не стоит. НО все знают, что грубая сила - лучшая сила!\n\nЭтот уровень допускает сверхвысокое напряжение (2048EU) и предоставляет последний набор обновлений машин общего назначения.\nКолоссальные Машины.\n\nКолоссальные машины — это динамические мультиблоки, которые обрабатывают несколько элементов одновременно, но требуют гораздо больше места и мощности,\nyи более эффективны, чем их аналоги.",
  "wiki.ic2.page.blocks.machines.hv": "Машины высокого напряжения",
  "wiki.ic2.page.blocks.machines.hv.desc": "Машины высокого напряжения — ваш шаг к завершению игры.\n\nМашины становятся более совершенными и более энергоемкими.\n\nЕсли ваша инфраструктура питания на данный момент уже едва хватает, чтобы не отставать от потребления, \nтеперь пора создавать дополнительную инфраструктуру.\nБольшинство машин на данный момент допускают высокое напряжение (512EU) и меньшую вероятность падения с обычного ключа.\n\nХотя это небольшая цена, поскольку передовые инструменты становятся доступными",
  "wiki.ic2.page.blocks.machines.luv": "Нелепые машины напряжения",
  "wiki.ic2.page.blocks.machines.luv.desc": "Машины смехотворного напряжения — это конец игры.\n\nНет больше ничего, что можно разблокировать, кроме этого уровня развития!\nЭти машины принимают смехотворное напряжение (32765) EU).\n\nШанс выпадения ключа составляет 55%. Как раз достаточно, чтобы прецизионный ключ гарантировал выпадение!",
  "wiki.ic2.page.blocks.machines.lv": "Низковольтные машины",
  "wiki.ic2.page.blocks.machines.lv.desc": "Машины низкого напряжения являются ранней стадией электрической обработки ресурсов.\n\nЭти машины принимают до 32 EU.\nЕсли машину снять без гаечного ключа он всегда теряется.\n\nПо умолчанию есть 80%, чтобы не потерять машину с гаечным ключом.\nЭто может варьироваться в зависимости от самого гаечного ключа.\n\nПочти каждая машина LV принимает обновления.",
  "wiki.ic2.page.blocks.machines.mv": "Машины среднего напряжения",
  "wiki.ic2.page.blocks.machines.mv.desc": "Машины среднего напряжения — это начало мидгейма IC2C.\n\nОн предлагает вам множество новых полезных инструментов и машин, в которые вы теперь можете играть с.\n\nМногие из этих машин поддерживают среднее напряжение (128EU) и, как правило, работают быстрее, чем низковольтные аналоги.\nЗа счет меньшей возможности модернизации и, конечно же, немного более высокой стоимости ресурсов/энергии,\nи без необходимости активного питания машины в режиме ожидания.\n\nРежим ожидания — это пассивная стоимость, которая потребляет 1EU/t и требует сигнала красного камня для поддержания полной скорости.",
  "wiki.ic2.page.blocks.machines.nv": "Примитивные машины",
  "wiki.ic2.page.blocks.machines.nv.desc": "Примитивные машины, которые не используют электричество, — это машины, которые очень рано становятся доступными для вас в игре.\n\nОни используют горючее топливо, такое как дрова и уголь для питания машин.\n\nХотя топливо ужасно неэффективно, они дают много положительных эффектов и могут быть очень легко использованы на лету.",
  "wiki.ic2.page.blocks.machines.worktable": "Промышленный рабочий стол",
  "wiki.ic2.page.blocks.machines.worktable.desc": "Промышленный рабочий стол — безумно мощный инструмент для крафта.\n\nНа самом деле он настолько мощный, что требует отдельного раздела.\n\nКоторый охватывает промышленный Сама рабочая среда и все расширения. §<newPage>Обратите внимание, что для работы всех расширений требуется промышленный рабочий стол.\nИ пока они прямо или косвенно касаются рабочего стола, они будут обнаружены.\n\nКроме того, расширения могут быть общими для нескольких рабочих столов. .",
  "wiki.ic2.page.blocks.misc": "Разные блоки",
  "wiki.ic2.page.blocks.misc.desc": "Это Блоки, которые не вписываются ни в одну из реальных категорий или находятся в декоративной Природе",
  "wiki.ic2.page.blocks.personal_blocks": "Персональные блоки!",
  "wiki.ic2.page.blocks.personal_blocks.desc": "Иногда вы хотите, чтобы предметы были в безопасности от других людей, которые могут их захватить;\n\nЛичные блоки являются персональными!\nТолько вы решаете, кто может получить к ним доступ/уничтожить их.\n\nОни также работают с торговыми блоками.\nОни позволяют пользователям обменивать предметы/жидкости/блоки при желании.§<newPage>§<header;Special Trade O Mat Key;true>\nОдна маленькая дополнительная информация.\nЕсли вы нажмете кнопку §<key;key.ic2.inv> при открытии Trade-o-Mats вы можете просматривать \"Просмотр покупателей\" и тестировать вещи.",
  "wiki.ic2.page.blocks.tubes": "Тюбы",
  "wiki.ic2.page.blocks.tubes.desc": "Трубы — это один из способов автоматизации транспортировки предметов.\n\nЭти трубы очень просты и мало что могут сделать.\nНо все основные компоненты для создают сложную систему.\n\nТак как же они работают? Предметы просто проходят через них и движутся в случайных направлениях, но не в том направлении, откуда они пришли.\nЕсли в трубке слишком много предметов, трубка просто не обрабатывать их, чтобы ваша игра не тормозила.\n\nСуществуют логистические трубы, которые помогают автоматизировать более сложные задачи, но они НЕ автоматизируют маршрутизацию.\n\nДа, автоматической маршрутизации нет, но не бойтесь системы труб содержит все необходимое для самостоятельной автоматической маршрутизации.\nПросто убедитесь, что вы не поджарите себе мозги.\n\nЯ не шучу.\n\nКроме того, для некоторых дополнительных функций был добавлен конфигуратор трубок, чтобы дать больше контроля над вещами.",
  "wiki.ic2.page.credits.head": "Благодарность",
  "wiki.ic2.page.crops": "Культуры",
  "wiki.ic2.page.crops.boni": "Эффекты среды кадрирования",
  "wiki.ic2.page.crops.boni.desc": "Теперь характеристики, которые вы знаете, и что они делают, но как насчет положительных эффектов окружающей среды?\nЭто следующие: Питательные вещества, Влажность, Качество окружающей среды.\n\nПитательные вещества и на влажность могут влиять блоки под ним.\nБлок непосредственно под ним - это \"Сельскохозяйственные угодья\",\nВ то время как 3 блока после сельхозугодий - это \"Недра\".\nВ общих чертах недра имеют меньшую эффект на блок, как и сельскохозяйственные угодья.§<newPage>§lПитательные вещества:§r\nНекоторые биомы могут оказывать на них влияние, которое можно выяснить с помощью здравого смысла.\nЭто можно усилить с помощью удобрений.§<newPage>§ lВлажность: §r\nНекоторые биомы могут влиять на них, что можно выяснить с помощью здравого смысла.\nЭта характеристика может быть усилена с помощью ячеек гидратации.\nДля заболоченных культур эта характеристика автоматически увеличивается до максимума.И в большинстве случаев на самом деле не является фактором.§<newPage>§lКачество среды заболочено:§r\n\nКогда культура заболочена, биом дает базовое значение качества воды на основе его характеристик.\nДля каждого пузырькового столбца или глины в сетке 3x3 вы получаете 1 очко.\nЗа каждую чистящую культуру (морские водоросли/ламинарии) в сетке 3x3 вы также получаете 1 очко.\nЗа каждый блок, который не является водой/мокрой губкой или воздухом, вы теряете 1 очко. \nЭто колеблется от 0 до 10 баллов качества среды.§<newPage>§lКачество среды не заболочено:§r\n\nЗа каждые 15 блоков выше y-64 вы получаете 1 балл (максимум 5)\nЕсли урожай может увидев небо, вы получаете 2 балла.\nИ за каждый воздушный/нетвердый блок, который не является урожаем в формате 3x3, вы получаете полбалла.\nЭто колеблется от 0 до 10 баллов качества среды.\n\n\n§lКачество окружающей среды заболочено:§r\n\nКогда урожай переувлажнен, биом дает базовое значение качества воды на основе его характеристик.\nЗа каждый столбец пузырьков или глину в сетке 3x3 вы получаете 1 очко.\nЗа каждую очистку Урожай (морские водоросли/ламинарии) в сетке 3x3 вы также получаете 1 балл.\nЗа каждый блок, который не является водой/мокрой губкой или воздухом, вы теряете 1 балл.\nЭто колеблется от 0 до 10 баллов качества среды.§ <newPage>§lКачество окружающей среды не заболочено:§r\n\nЗа каждые 15 блоков выше y-64 вы получаете 1 очко (максимум 5)\nЕсли урожай может видеть небо, вы получаете 2 очка.\nИ за каждый воздух/ не сплошной блок, который не является кадром в формате 3x3, вы получаете полбалла.\nЭто колеблется от 0 до 10 баллов за качество среды.\n\n\n§lКачество окружающей среды заболочено:§r\n\nКогда урожай переувлажнен, биом дает базовое значение качества воды на основе его характеристик.\nЗа каждый столбец пузырьков или глину в сетке 3x3 вы получаете 1 очко.\nЗа каждую очистку Урожай (морские водоросли/ламинарии) в сетке 3x3 вы также получаете 1 балл.\nЗа каждый блок, который не является водой/мокрой губкой или воздухом, вы теряете 1 балл.\nЭто колеблется от 0 до 10 баллов качества среды.§ <newPage>§lКачество окружающей среды не заболочено:§r\n\nЗа каждые 15 блоков выше y-64 вы получаете 1 очко (максимум 5)\nЕсли урожай может видеть небо, вы получаете 2 очка.\nИ за каждый воздух/ не сплошной блок, который не является кадром в формате 3x3, вы получаете полбалла.\nЭто колеблется от 0 до 10 баллов за качество среды.\n\n\n§r\n\nКогда культура заболочена, биом дает базовое значение качества воды на основе ее характеристик.\nЗа каждую колонку пузырьков или глину в сетке 3x3 вы получаете 1 очко.\nЗа каждую чистящую культуру (морские водоросли/ Водоросли) в сетке 3x3 вы также получаете 1 очко.\nЗа каждый блок, который не является водой/мокрой губкой или воздухом, вы теряете 1 очко.\nЭто варьируется от 0 до 10 очков качества среды.§<newPage>§lОкружающая среда Качество без переувлажнения:§r\n\nЗа каждые 15 блоков выше y-64 вы получаете 1 очко (максимум 5)\nЕсли урожай может видеть небо, вы получаете 2 очка.\nИ за каждый воздушный/нетвердый блок, который не за урожай в формате 3x3 вы получаете полбалла.\nЭто колеблется от 0 до 10 баллов за качество среды.\n\n\n§rКогда культура заболочена, биом дает базовое значение качества воды на основе ее характеристик.\nЗа каждую колонку пузырьков или глину в сетке 3x3 вы получаете 1 очко.\nЗа каждую чистящую культуру (морские водоросли/ Водоросли) в сетке 3x3 вы также получаете 1 очко.\nЗа каждый блок, который не является водой/мокрой губкой или воздухом, вы теряете 1 очко.\nЭто варьируется от 0 до 10 очков качества среды.§<newPage>§lОкружающая среда Качество без переувлажнения:§r\n\nЗа каждые 15 блоков выше y-64 вы получаете 1 очко (максимум 5)\nЕсли урожай может видеть небо, вы получаете 2 очка.\nИ за каждый воздушный/нетвердый блок, который не за урожай в формате 3x3 вы получаете полбалла.\nЭто колеблется от 0 до 10 баллов за качество среды.\nЗа каждый блок, который не является водой/мокрой губкой или воздухом, вы теряете 1 балл.\nЭто колеблется от 0 до 10 баллов качества среды.§<newPage>§lКачество среды не заболочено:§r\n\nЗа каждые 15 Блоки выше y-64 вы получаете 1 очко (максимум 5)\nЕсли культура может видеть небо, вы получаете 2 очка.\nИ за каждый воздушный/не твердый блок, который не является культурой в 3x3, вы получаете полбалла .\nЭто колеблется от 0 до 10 баллов качества среды.\nЗа каждый блок, который не является водой/мокрой губкой или воздухом, вы теряете 1 балл.\nЭто колеблется от 0 до 10 баллов качества среды.§<newPage>§lКачество среды не заболочено:§r\n\nЗа каждые 15 Блоки выше y-64 вы получаете 1 очко (максимум 5)\nЕсли культура может видеть небо, вы получаете 2 очка.\nИ за каждый воздушный/не твердый блок, который не является культурой в 3x3, вы получаете полбалла .\nЭто колеблется от 0 до 10 баллов качества среды.\nЭто колеблется от 0 до 10 баллов качества среды.\nЭто колеблется от 0 до 10 баллов качества среды.",
  "wiki.ic2.page.crops.breeding": "Разведение сельскохозяйственных культур",
  "wiki.ic2.page.crops.breeding.desc": "Это может отличаться в зависимости от настроек сложности.\n\nКак только 2 или более культур соглашаются на скрещивание, новая культура будет создана в месте результата.\nУ вас есть 0 индикаторов, которые/сколько используются; у вас есть только 2 палочки.\n\nРезультат рассчитывается на основе полуслучайной вероятности.\n\nСначала он оценивает все потенциальные культуры, которые могут там расти (за исключением сорняков), и вычисляет количество баллов для каждой культуры.\nЭто рассчитывается в несколько этапов.\n\nЕсли урожай селекционной культуры совпадает с урожаем из списка, он получает 500 очков. Никаких дальнейших расчетов.\nИначе он начнет сравнивать урожай.\n\nПервое, что он сравнивает, это характеристики (Химия, Расходные материалы, Защитные, Красочные, Сорняки) культур: Если сравниваемые характеристики равны, вы получаете 2 очки, если есть разница в 1 очко в статистике, вы получаете 1 очко, разница в статах в 2 очка игнорируется, а любая большая разница дает -1 очко\nПосле этого сравниваются атрибуты двух культур. За каждый совпадающий атрибут двух культур он получает 5 баллов.\n\nЗатем он сравнивает уровни культур:\nЕсли уровень селекционной культуры меньше, чем 1 балл, возможному урожаю, который вы теряете 2 раза по уровню. разница в очках.\nКроме того, если племенная культура больше, чем 3 уровня, то возможная культура теряет разницу в очках по уровням.\nВ конце она следит за тем, чтобы вы не опустились ниже 0 очков за культуру, и затем добавляет ее к баллы за эту культуру.\n\nПосле того, как оценка завершена, она объединяет все потенциальные баллы вместе и получает случайное число от 0 до всех объединенных баллов культур. \nЗатем он просматривает каждый действительный результат и проверяет, больше ли баллов, чем случайно выбранное значение.\nЕсли да, то это ваш результат.\nЕсли нет, то он потребляет баллы этого конкретного результата и проверяет следующий обрезать. Повторить и т. д.",
  "wiki.ic2.page.crops.desc": "IC2C добавляет в игру очень уникальную систему урожая.\nНекоторым она нравится, некоторым не нравится. Решать вам.\n\nЕсли кто-то помнит мод Forestry, то вы можете не знать, что его механика разведения пчел была вдохновлена ​​им.§<newPage>§<header;Crops;true>\nУрожаи дают множество различных ресурсов и консистенции.\nВы можете выращивать:\n- Древесину\n- Руду \n- Еда\n- Красители\n- КАЛЬМАРЫ!\n\nОбязательно ознакомьтесь с §<redirect;true;Учебник;ic2:subpage.crop>§<newPage>§<header;Planting;true>\nНекоторые культуры можно сажать напрямую, в то время как другие нужно селекционировать.\nХотя, если вы соберете культуру, вы получите мешок с семенами, чтобы пересадить ее. Хотя это не всегда гарантируется.\nПолностью выращенные растения имеют больше шансов выпасть мешок с семенами.\n\nЭта вики показывает, можно ли выращивать урожай по предметам или путем размножения.§<newPage>",
  "wiki.ic2.page.crops.helper": "Помощник по селекции",
  "wiki.ic2.page.crops.helper.desc": "Теперь, когда этот информационный дамп закончился. Надеюсь, ваша голова еще не дымится.\n\nТеперь вы можете вычислить это вручную и надеяться, что ваши расчеты точны.\nНо, к счастью, вам это не нужно.\n\nВ Crop Analyzer есть режим селекции культур, который может моделировать все это целиком и показывать вам каждый шанс для каждой комбинации по желанию.\nОн не показывает идеальные совпадения, но позволяет вам чтобы поиграть и выяснить, какие результаты лучше всего подходят для вашей текущей ситуации.\n\nВы не обязаны владеть какой-либо культурой, чтобы протестировать ее. Она поставляется с творческим запасом всех культур.\nНет, вы не можете получить эти культуры. своего инвентаря.\n\nИ это относится к секции урожая.",
  "wiki.ic2.page.crops.stats": "Статистика урожая",
  "wiki.ic2.page.crops.stats.desc": "Значит, у культур есть характеристики, которые имеют как положительные, так и отрицательные стороны.\nДиапазон каждой характеристики находится в диапазоне от 0 до 31.\n\nХотя более высокие характеристики могут привести к серьезному увеличению являются и недостатками, и они становятся массовыми при 24 или выше.§<newPage>§lРост:§r\nУвеличивает рост по единой норме и увеличивает вероятность скрещивания.\nПри 24 или выше культура превращается в сорняк, что приводит к уничтожить близлежащие неустойчивые культуры.§<newPage>§lПолучение:§r\nУвеличивает дополнительные шансы выпадения на 10 % (3 % автоматически), и это количество может удвоиться с очень низким шансом.\nПри 24 каждое дополнительное очко уменьшает количество выпадающих семян. шанс на 5% (умножение).§<newPage>§lСопротивление:§r\nУвеличивает шанс выпадения семян и снижает вероятность гибели урожая из-за требований или сорняков, пытающихся распространиться на него.\nНа уровне 28 и выше значительно снижает вероятность скрещивания.",
  "wiki.ic2.page.fluids": "Жидкости",
  "wiki.ic2.page.fluids.alcohol": "Алкоголь",
  "wiki.ic2.page.fluids.alcohol.desc": "Алкоголь — это ваша жидкость высокого уровня, но не поддающаяся автоматизации.\n\nОн производит массу энергии или может быть использован для максимизации производительности вашего руды в производство слитков.\n\nЕго можно произвести только с помощью пивоварения в бочке.",
  "wiki.ic2.page.fluids.biofuel": "Биотопливо",
  "wiki.ic2.page.fluids.biofuel.desc": "Биотопливо — это очищенная форма растительного вещества или древесного газа.\n\nЗа приличное время оно производит массу энергии, которую можно использовать в середине/конце игры. чтобы ваша база оставалась на плаву.\n\nЕсли у вас есть производство для ее поддержки.",
  "wiki.ic2.page.fluids.blazing_lava": "Пылающая лава",
  "wiki.ic2.page.fluids.blazing_lava.desc": "Эта, более горячая, чем когда-либо, жидкость производится на перерабатывающем заводе и в 10 раз эффективнее лавы в геотермальных генераторах/термальных генераторах. 1 единица пылающей лавы считается за 10 единиц обычной лавы, и для этого нужно всего несколько размоченных огненных стержней",
  "wiki.ic2.page.fluids.desc": "IC2 Classic также предоставляет пару жидкостей, которые используются для нескольких целей.\n\nВ основном для производства электроэнергии или некоторых коммунальных услуг.",
  "wiki.ic2.page.fluids.steam": "Пар",
  "wiki.ic2.page.fluids.steam.desc": "Пар можно производить разными способами, например, в §<redirect;true;Fuel Boiler;ic2:preview.fuel_boiler> или §<redirect;true;Паровой реактор; ic2:preview.steam_reactor>, но, в конце концов, он в основном используется для производства энергии среднего и высокого уровня в генераторах, таких как §<redirect;true;Steam Tunnel;ic2:preview.steam_tunnel> или §<redirect;true ;Паровая турбина;ic2:preview.steam_turbine>",
  "wiki.ic2.page.fluids.wood_gas": "Дровяной газ",
  "wiki.ic2.page.fluids.wood_gas.desc": "Дровяной газ является побочным продуктом при производстве древесного угля и может быть произведен в §<redirect;true;Wood Gasificator;ic2:preview.wood_gassifier>.\n\nIt является отличным производителем энергии в начале игры, но позже может быть переработан в более мощную жидкость",
  "wiki.ic2.page.items.armors": "Доспехи",
  "wiki.ic2.page.items.armors.desc": "IC2Classic добавляет в игру несколько типов доспехов.\n\nЕсть некоторые ранние игровые, электрические, вспомогательные и другие типы доспехов.\n\nДоспехи вспомогательного назначения включают способы зарядки ваших электроинструментов или реактивных ранцев.§<newPage>§<header;Armors;true>\nТакже электрическая броня в этой версии является модульной и может быть настроена с помощью конфигуратора брони.",
  "wiki.ic2.page.items.batteries": "Батарейки",
  "wiki.ic2.page.items.batteries.desc": "Батарейки — это ваш портативный источник энергии, который вы можете использовать во многих случаях.\n\nЛибо заряжая другие предметы, либо временно запуская с их помощью машины.\n\nЭто может также использоваться в качестве импульсного источника питания, потребляющего большое количество энергии за короткое время\nс которым ваша энергосистема не справляется.",
  "wiki.ic2.page.items.electric_tools": "Электроинструменты",
  "wiki.ic2.page.items.electric_tools.desc": "IC2C добавляет в игру новый тип инструмента:\n\nЭлектроинструмент. У него есть пара плюсов и минусов, но в целом это большое улучшение.§<newPage >§<header;Electric Tools;true>\n– Использует электричество в качестве прочности.\n– Их нельзя сломать.\n– Их можно перезарядить из множества источников.\n– Их можно зачаровать только электрическими инструментами. Enchanter.\n- У них такой отвратительный цвет прочности.\n\nВ этой категории тоже есть много полезных инструментов, которые могут вам понравиться.\nИтак, вперед!",
  "wiki.ic2.page.items.info.cards": "Карты монитора",
  "wiki.ic2.page.items.info.cards.desc": "IC2Classic добавляет монитор в игру.\n\nЭтот монитор может отображать много информации о себе.\n\nЭти карты предоставляют информацию монитору .",
  "wiki.ic2.page.items.misc": "Разное",
  "wiki.ic2.page.items.misc.desc": "Эти предметы не вписываются ни в одну из реальных категорий.",
  "wiki.ic2.page.items.reactor.components": "Компоненты реактора",
  "wiki.ic2.page.items.reactor.components.desc": "Компоненты Reactor являются неотъемлемой частью любого Reactor.\n\nПо сути, это логика реактора.\nСуществует несколько типов компонентов\n\nтаких как топливные стержни, теплоотводы, ячейки охлаждающей жидкости, конденсаторы и т. д.",
  "wiki.ic2.page.items.scanners": "Сканеры",
  "wiki.ic2.page.items.scanners.desc": "Сканеры — чрезвычайно полезный инструмент для сбора ресурсов.\n\nИх можно использовать в майнере, чтобы указать, что он должен для вас выкопать.\n\nНо некоторые из них можно использовать независимо, чтобы показать, сколько руд на самом деле находится под вами.\n\nЧтобы добавить больше функций, их можно использовать в сочетании с горным буром, чтобы показать вам, находится ли что-то, что вы ищете, поблизости\n\nхотя это гораздо более ближний.",
  "wiki.ic2.page.items.tools": "Инструменты",
  "wiki.ic2.page.items.tools.desc": "IC2C предоставляет вам множество инструментов, которые помогут вам в вашем стремлении расширить вашу фабрику.\n\nНекоторые из этих инструментов являются довольно простыми инструментами для копания,\n\nдругие дают вам доступ к ценной информации или просто позволяют укрепить/украсить вашу базу.",
  "wiki.ic2.page.items.upgrades": "Обновления",
  "wiki.ic2.page.items.upgrades.category": "Это следующие категории обновлений:\n- §<redirect;true;Machine Upgrades;ic2:items.upgrades.machine>\n\n- §<redirect ;true;Обновления зарядной панели;ic2:items.upgrades.chargepad>\n\n- §<redirect;true;Обновления инвентаря;ic2:items.upgrades.inventory>\n\n- §<redirect;true;Наборы обновлений; ic2:items.upgrades.kits>",
  "wiki.ic2.page.items.upgrades.chargepad": "Улучшения зарядной панели",
  "wiki.ic2.page.items.upgrades.chargepad.desc": "ChargePads — это круто, и эти обновления делают Chargepad более полезным\n\nособенно для сценариев PVP, для которых они были разработаны их первоначальным автором.\n\nНо осталось еще несколько моментов, даже для тех, кто не использует PVP.",
  "wiki.ic2.page.items.upgrades.desc": "IC2C добавляет множество обновлений для множества разных машин.\n\nЭто могут быть прямые обновления или компромиссы между тем, что вы можете и не можете делать.",
  "wiki.ic2.page.items.upgrades.inventory": "Обновления инвентаря",
  "wiki.ic2.page.items.upgrades.inventory.desc": "Обновления инвентаря изменились по сравнению с последней версией. На самом деле их осталось всего несколько\n\nно они позволяют строго контролировать инвентарь. ",
  "wiki.ic2.page.items.upgrades.kits": "Наборы улучшений",
  "wiki.ic2.page.items.upgrades.kits.desc": "Наборы обновлений — это ваш инструмент для обновления частей вашей фабрики без необходимости разбирать все на части, а затем возвращать обновленные версии обратно.\n\nЭто помощники, которые вместо этого обновите все на месте.\n\nКонечно, это не всегда простой шаг, но он многое упрощает.",
  "wiki.ic2.page.items.upgrades.machine": "Улучшения машины",
  "wiki.ic2.page.items.upgrades.machine.desc": "Улучшения машин — это просто улучшения только для определенных машин.\n\nОни бывают разных вариантов, например: транспорт, модификация продукции, управление красным камнем и т. д. \n\nХотя каждая машина решает, какие из них на самом деле можно использовать.",
  "wiki.ic2.page.main.body": "Так, теперь давайте перейдем к элементам управления.\nВнизу справа/слева есть кнопки.\nПри нажатии они переместят вас вперед/назад.",
  "wiki.ic2.page.main.head": "Вики IC2Classic",
  "wiki.ic2.page.main.intro": "Путеводитель по IC2Classic приветствует вас.\nПросто чтобы Вы знали, я - ценный предмет, не выбрасывайте меня!\nНастоятельно рекомендуется использовать The One Probe с этим модом, он предоставит вам больше информации. Кроме того, Ваттметр тоже важная вещь! Я предупредил!",
  "wiki.ic2.page.main.wiki": "К Вики прикреплено много мелких, не столь очевидных деталей.\nНапример:\nЕсли вы видите §lжирный текст§r и поверх §<redirect; true;жирный текст;ic2:main> может появиться всплывающая подсказка.\nЕсли это происходит, это означает, что это ссылка на другую страницу.\nПо которой можно щелкнуть.§<newPage>Для облегчения перемещения щелкните правой кнопкой мыши вернуться на предыдущую страницу, на которой вы были, если вы перешли по ссылке.\nЕсли вы не перешли по ссылке, вы будете перемещены на первую страницу.\n\nРешение многих проблем \"Потерялись\", о которых сообщалось. ..§<newPage>§<header;Закладки;true>\nЭта вики также содержит метки книг,\nкоторые можно найти в левой части вики.\nНажав на них, вы перейдете на нужную страницу.\nНажав Shift, вы можете удалить закладки, если они больше не нужны.\nПросто нене переусердствуйте с ними!\nЭта вики довольно хрупкая§<newPage>§<header;Bookmark Overlay;true>\nЗакладки можно добавлять динамически по мере необходимости.\nВам просто нужно щелкнуть \"Зеленую\" закладку с помощью значка + Символ\nзатем отображается наложение закладки.§<image;ic2:textures/wiki/bookmarks.png;75;10;98>\nНазвание закладки можно настроить в синей области по своему усмотрению.\n\nВыберите цвет в красной области.\nОдним из следующих способов:\n– выбор предустановленного цвета.\n– ввод шестнадцатеричного кода цвета.§<newPage>§<header;Wiki Search;true>\nThe IC2 Wiki также содержит функцию поиска.\nК ней можно получить доступ с помощью синей закладки с увеличительным стеклом.\n\nНажав на нее, откроется наложение поиска.\nОн попытается показать вам лучшие результаты того, что вы ищете .§<newPage>§<header;Дополнительная информация;true>\nПод некоторыми страницами вы найдете эти направленные вниз стрелки.§<image;ic2:textures/wiki/more_info.png;25;26.5;65>\n\nОбычно они указывают на наличие дополнительной информации о отображаемой в данный момент записи. .\nНажатие на нее приведет к отображению дополнительной информации.§<newPage>§<header;Controls;true>\n- §lLeft§r / §lRight§r §lKey§r: Переместить страницу\n- §lUp§r / §lВниз§r: Переместить главу\n- §lПравый клик§r: Вернуться на последнюю страницу.\n- §l§<key;key.jei.showRecipe>§r: Показать рецепты JEI\n- §l§ <key;key.jei.showUses>§r: Показать использование JEI\n- §l§<key;key.sneak>§r + §l§<key;key.use>§r: В блоке с Wiki в вашей руке, чтобы открыть для него страницу.§<newPage>§<header;Multi Block Overlay Keys;true>\n- §l§<key;key.attack>§r: Удалить призрачную структуру\n- §l§ <key;key.use>§r: Разместить призрачную структуру\n- §l§<key;key.ic2.hud>§r §l+§r §l§<key;key.pickItem>§r: выбрать призрачную структуру\n- §l§<key;key.attack>§r: удалить структуру\n- §lR§r: повернуть структуру §<newPage>§<header;Конец вступления;true>\nЭто введение в вики.\n\nЕсть еще многое, что нужно прочитать, от руководств до случайной полезной информациии.\nИ да, Самая важная часть!\n\nИ, наконец, получайте удовольствие от мода :D",
  "wiki.ic2.page.main.wiki_head": "Учебник по вики",
  "wiki.ic2.page.table.desc": "Это оглавление.\n\n- §<redirect;true;Tutorials;ic2:tutorials>\n- §<redirect;true;Credits;ic2:credits>\n- §<перенаправление;true;Блоки;ic2:blocks.generators>\n - §<redirect;true;Генераторы;ic2:blocks.generators>\n - §<redirect;true;Машины;ic2:блоки .machines>\n - §<redirect;true;Кабели;ic2:blocks.cables>\n - §<redirect;true;Электрические блоки;ic2:blocks.electric_blocks>\n - §<redirect;true;Персональные блоки; ic2:blocks.personal_blocks>\n - §<redirect;true;Fluid Blocks;ic2:blocks.fluid_blocks>\n - §<redirect;true;Tubes;ic2:blocks.tubes>\n - §<redirect;true; Explosives;ic2:blocks.explosives>\n - §<redirect;true;Misc;ic2:blocks.misc>\n\n\n- §<redirect;true;Items;ic2:items.tools>\n - § <перенаправление;true;Инструменты;ic2:items.tools>\n - §<redirect;true;Электроинструменты;ic2:items.electric_tools>\n - §<redirect;true;Броня;ic2:items.armors>\n - §<redirect;true;Батарейки;ic2:items. батареи>\n - §<redirect;true;Сканеры;ic2:items.scanners>\n - §<redirect;true;Обновления;ic2:items.upgrades>\n - §<redirect;true;Компоненты Reactor;ic2: items.reactor.components>\n - §<redirect;true;Карты монитора;ic2:items.info.cards>\n - §<redirect;true;Misc;ic2:items.misc>\n- §<redirect; true;Fluids;ic2:fluids>\n- §<redirect;true;Crops;ic2:crops>\n- §<redirect;true;Компоненты Reactor;ic2:items.reactor.components>\n - §<redirect;true;Карты мониторинга;ic2:items.info.cards>\n - §<redirect;true;Разное;ic2:items. misc>\n- §<redirect;true;Fluids;ic2:fluids>\n- §<redirect;true;Crops;ic2:crops>\n- §<redirect;true;Компоненты Reactor;ic2:items.reactor.components>\n - §<redirect;true;Карты мониторинга;ic2:items.info.cards>\n - §<redirect;true;Разное;ic2:items. misc>\n- §<redirect;true;Fluids;ic2:fluids>\n- §<redirect;true;Crops;ic2:crops>",
  "wiki.ic2.page.table.head": "Оглавление",
  "wiki.ic2.page.tutorials.desc": "Это учебный раздел этой книги.\nОн содержит простые рекомендации и пояснения о том, как работают определенные функции.\n\nЭто должно помочь в продвижении вперед, а также в более сложных возможностей.\n\nНа следующей странице находятся ссылки на уже существующие руководства.",
  "wiki.ic2.page.tutorials.head": "Учебники",
  "wiki.ic2.page.tutorials.head.path": "Ссылки на учебники",
  "wiki.ic2.page.tutorials.path": "Учебники по развитию:\n- §<redirect;true;Первый день;ic2:subpage.first_day>\n- §<redirect;true;Ранняя игра;ic2:subpage. Early_game>\n- §<redirect;true;Второй уровень;ic2:subpage.second_tier>\n- §<redirect;true;Третий уровень;ic2:subpage. Third_tier>\n- §<redirect;true;Четвертый уровень; ic2:subpage.fourth_tier>\n\nРазное Учебники:\n- §<redirect;true;Электричество;ic2:subpage.electricity>\n- §<redirect;true;Логистический транспорт;ic2:subpage.logistic_grid>\n- §<redirect;true;Brewing;ic2:subpage.brewing>\n- §<redirect;true;Reactors;ic2:subpage.nuclear_reactor>",
  "wiki.ic2.preview.accumulator": "Квантовый аккумулятор",
  "wiki.ic2.preview.accumulator.desc": "Аккумулятор — это хранилище большой емкости с низким энергопотреблением. Он хранит меньше, но более гибкий.",
  "wiki.ic2.preview.activity_card.desc": "Карточка активности показывает, активна машина или нет.",
  "wiki.ic2.preview.adamantum.desc": "Адамантум — ваша алмазодобывающая культура. Он растет очень медленно и требует наличия алмазной руды/блока под ним.",
  "wiki.ic2.preview.adjustable_luminator.desc": "Вам нужен определенный уровень освещенности? На помощь приходит регулируемый люминатор. Его можно уменьшить до любого уровня освещенности, сохраняя при этом все функции люминатора!",
  "wiki.ic2.preview.advanced_chainsaw.desc": "Усовершенствованная бензопила — ваш инструмент для рубки деревьев в эндшпиле. Она поедает деревья заживо! Так что будьте осторожны с ней. Не то чтобы она поедала и вас!",
  "wiki.ic2.preview.advanced_drill.desc": "Усовершенствованная дрель - ваш эндгейм копатель. Он позволяет вам копать столько, сколько Шпайгер хотел предотвратить. Похоже, он проиграл эту битву!",
  "wiki.ic2.preview.advanced_hoe.desc": "Усовершенствованная мотыга — это инструмент массового земледелия в поздней игре, который вам нужен. Он может обрабатывать поля в радиусе 5 блоков, что значительно упрощает жизнь!",
  "wiki.ic2.preview.advanced_solar_helmet.desc": "Усовершенствованный солнечный шлем — это модернизированный солнечный шлем, производящий 5EU/т для зарядки вашей брони и инструментов.",
  "wiki.ic2.preview.advanced_tree_tap.desc": "Advanced TreeTap — это монстр. При использовании на каучуковом дереве он избавляется от всего дерева, получая много липкой смолы! Какой монстр!",
  "wiki.ic2.preview.air_refill_module.desc": "Вы находитесь под водой, и у вас заканчивается воздух? Как насчет модуля пополнения воздуха. Он всегда обеспечивает вас свежим запасом кислорода.",
  "wiki.ic2.preview.allium.desc": "Аллиум — пурпурный цветок. Как и все цветы, он требует яркого участка (12 или больше). Больше нечего сказать.",
  "wiki.ic2.preview.alloy_smelter.desc": "Плавильня сплавов — это ворота к следующему уровню развития. Он использует 16EU/т и используется для создания сплавов или более сложных материалов.",
  "wiki.ic2.preview.alumen.desc": "Квасцы — это растение, производящее алюминий, для полного роста ему требуется блок/руда указанного материала или под ним.",
  "wiki.ic2.preview.aluminium_cable_item.desc": "Алюминиевый провод. Он может справиться с 8,192EU при постоянных потерях. Действительно хорош для реакторов эндшпиля.",
  "wiki.ic2.preview.argentum.desc": "Аргентум — это урожай, производящий серебро, которому для завершения роста нужен блок/руда указанного материала под ним.",
  "wiki.ic2.preview.armor.bronze": "Бронзовая броня",
  "wiki.ic2.preview.armor.bronze.desc": "Бронзовая броня немного лучше по защите, чем ее железный аналог. В остальном это дешевый железный вариант.",
  "wiki.ic2.preview.armor.composite": "Композитная броня",
  "wiki.ic2.preview.armor.composite.desc": "Благодаря двухслойной броне и экранированию из сплавных пластин композитная броня является действительно прочной броней. Лучше, чем незеррит.",
  "wiki.ic2.preview.armor.hazmat": "Защитный костюм",
  "wiki.ic2.preview.armor.hazmat.desc": "Защитный костюм при полной экипировке защищает от лавы/огня, а при наличии воздушных ячеек гарантирует, что вы не утонете.",
  "wiki.ic2.preview.armor.jetpack.electric": "Электрический реактивный ранец",
  "wiki.ic2.preview.armor.jetpack.electric.desc": "Электрический реактивный ранец — это электрический вариант реактивного ранца. Это облегчает заправку. Компактный реактивный ранец также имеет режим ракеты!",
  "wiki.ic2.preview.armor.jetpack.nuclear": "Ядерный реактивный ранец",
  "wiki.ic2.preview.armor.jetpack.nuclear.desc": "Раздражает постоянная нехватка топлива? Ядерный реактивный ранец поможет вам. Используйте §msafe§r Уран, чтобы поддерживать его в рабочем состоянии.",
  "wiki.ic2.preview.armor.nano": "Наноброня",
  "wiki.ic2.preview.armor.nano.desc": "Нано-броня — ваша первая электрическая броня в игре. Она использует электричество для вашей безопасности и может быть расширена.",
  "wiki.ic2.preview.armor.quantum": "Квантовая броня",
  "wiki.ic2.preview.armor.quantum.desc": "Квантовая броня — это улучшенная наноброня. Она имеет больший запас энергии и больше возможностей расширения.",
  "wiki.ic2.preview.armor_configurator.desc": "Конфигуратор брони обеспечивает возможность настройки электрических доспехов с помощью §lModules§r, которые включают определенные функции. Такие как Super Speed, Night Vision, Jetpacks и т. д.",
  "wiki.ic2.preview.armor_priority_pad_upgrade.desc": "Улучшение Armor Priority Upgrade изменяет Chargepad, чтобы обеспечить броню энергией до панели быстрого доступа",
  "wiki.ic2.preview.aurelia.desc": "Аурелия – это урожай, приносящий золото, которому для завершения роста требуется руда/блок золота под ним. Некоторые говорят, что он слишком блестит!",
  "wiki.ic2.preview.auto_feeder_module.desc": "Не обращайте внимания на руку, которая выходит из вашей головы и засовывает консервную банку вам в рот. Это только модуль автоматической подачи автоматически кормит вас консервными банками.",
  "wiki.ic2.preview.azure_bluet.desc": "Лазурно-голубой — это цветок, производящий серую краску. Как и для всех цветов, для него требуется уровень освещенности 12 или выше.",
  "wiki.ic2.preview.bamboo.desc": "Урожай бамбука производит бамбук и растет довольно быстро. Хотя он предпочитает низкую (4 или меньше) влажность для роста.",
  "wiki.ic2.preview.base_module.desc": "Базовый модуль. Компонент крафта для создания улучшений электрической брони, которые можно установить в конфигураторе брони.",
  "wiki.ic2.preview.base_teleporter.desc": "Базовый телепорт — это ваша локальная домашняя сеть пунктов назначения, где вы можете прыгать по мере необходимости на 4000EU за телепорт. Он имеет горизонтальный радиус 100 блоков",
  "wiki.ic2.preview.battery": "Батарейки",
  "wiki.ic2.preview.battery.desc": "Батарейки — это ваши портативные накопители энергии, которые можно использовать для питания других машин даже за пределами вашей сети.",
  "wiki.ic2.preview.battery.pack": "Энергетический пакет",
  "wiki.ic2.preview.battery.pack.desc": "Энергоаккумулятор — еще одна портативная форма накопителя энергии. В нем могут использоваться инструменты и т. д.",
  "wiki.ic2.preview.battery_station": "Аккумуляторная станция",
  "wiki.ic2.preview.battery_station.desc": "Аккумуляторная станция разряжает электрические предметы, а затем выводит их в мир. Она создает 4 пакета своего уровня.",
  "wiki.ic2.preview.beetroot.desc": "Урожай свеклы дает красную свеклу, которую можно превратить в еду или красную краску.\n\nПри установке в этот режим можно дополнительно производить семена.",
  "wiki.ic2.preview.blackthorn.desc": "Блэкторн — это роза, производящая черную краску. Ходят слухи, что она использовалась для производства чернильных мешков. К сожалению, это оказалось ложью.",
  "wiki.ic2.preview.blast_induction_furnace.desc": "Индукционная доменная печь — это специализированная индукционная печь только для руды. Она использует 30EU/т для более быстрой плавки",
  "wiki.ic2.preview.blue_orchid.desc": "Известно, что Голубая орхидея в дикой природе растет только на болотах. Высокое содержание питательных веществ делает ее подходящей мишенью. Хотя это не обязательно. Однако для нее требуется светлое место ( 12 или больше). Производит светло-голубой краситель.",
  "wiki.ic2.preview.blue_wheat.desc": "Голубая пшеница — странная культура. Кто-то может сказать, что хотел обокрасть людей, покрасив пшеницу в синий цвет, но нет. Это культура, производящая лазурит, для которой требуется много воды. Из-за известно, что при таких высоких требованиях к воде его выращивают под водой ",
  "wiki.ic2.preview.bone_flower.desc": "У Костяного цветка есть кость, которую вы можете разделить с вами. Я не шучу. Он производит костную муку. Он также нуждается в костяном блоке под ним, чтобы действительно расти.",
  "wiki.ic2.preview.brain_coral.desc": "Мозговой коралл — это подводная культура, которую можно использовать для выращивания коралловых блоков. У него есть шанс произвести все варианты мозговых кораллов. Это при условии, что он жив. Он для роста требуется чистая вода (3 или более).",
  "wiki.ic2.preview.bronze_cable_item.desc": "Бронзовый провод: дешевая альтернатива золоту! Он выдерживает до 128EU, но может быть использован только за 1 блок до потери.",
  "wiki.ic2.preview.brown_mushroom.desc": "Коричневый гриб производит сам себя, как и многие другие культуры. Для его роста требуется влажность 1 или выше. И он растет довольно быстро.",
  "wiki.ic2.preview.bubble_coral.desc": "Пузырьковый коралл — это подводная культура, которую можно использовать для выращивания коралловых блоков. У него есть шанс произвести все варианты пузырьковых кораллов. Это при условии, что он живой. Он для роста требуется чистая вода (3 или более).",
  "wiki.ic2.preview.buffer_storage_expansion.desc": "Расширение буферного хранилища предоставляет промышленному рабочему столу 9 временных выходных слотов, в которых он может хранить нежелательные элементы.",
  "wiki.ic2.preview.cactus.desc": "Кактус жалит при прикосновении, и переход от полноразмерного к меньшему не меняет этого. Ему просто нужен солнечный свет. Кроме того, чем горячее биом, тем быстрее он растет",
  "wiki.ic2.preview.canner.desc": "Canner — это упаковщик, который использует 1EU/т для упаковки еды в банки или заправки инструментов/предметов их топливом/потребностями или комбинирования топлива, чтобы сделать их более эффективными.",
  "wiki.ic2.preview.capacity_pipe.desc": "High Volume Pipe имеет более высокую скорость передачи, 200 мБ/такт, по сравнению с обычным каналом, но мощность такая же.",
  "wiki.ic2.preview.carrot.desc": "Морковь - отличный источник пищи для вас и ваших свиней! Урожай растет сам и обеспечивает вас постоянными запасами моркови. Ему требуется яркое место вокруг себя. (9 или выше)",
  "wiki.ic2.preview.centrifugal_extractor.desc": "Центробежный экстрактор — это модернизированный экстрактор, использующий высокоскоростное вращение для извлечения элементов друг из друга. Используя 16EU/t",
  "wiki.ic2.preview.centrifugal_rare_earth_extractor.desc": "Центробежный РЗЭ - это модернизация своего аналога, который использует силу вращения для разделения редких металлов намного быстрее! Он потребляет 16EU/т.",
  "wiki.ic2.preview.cf_pack.desc": "Пакет Cfoam позволяет носить с собой гораздо больше Cfoam. Это становится действительно полезным для более масштабных миссий по распылению.",
  "wiki.ic2.preview.cfoam": "Строительная пена",
  "wiki.ic2.preview.cfoam.carpet": "Ковер Cfoam",
  "wiki.ic2.preview.cfoam.carpet.desc": "Ковры Cfoam - негорючие и взрывобезопасные ковры!",
  "wiki.ic2.preview.cfoam.desc": "Строительный пеноблок — декоративный взрывостойкий материал. Он не идеален, но тротил не царапает его.",
  "wiki.ic2.preview.cfoam.panel": "Панель Cfoam",
  "wiki.ic2.preview.cfoam.panel.desc": "Панель Cfoam, которую можно использовать для создания перил или ограждений. Она также взрывобезопасна.",
  "wiki.ic2.preview.cfoam.slabs": "Плиты Cfoam",
  "wiki.ic2.preview.cfoam.slabs.desc": "Плиты Cfoam — это декоративные плиты, которые также являются взрывоустойчивыми.",
  "wiki.ic2.preview.cfoam.stairs": "Ступени Cfoam",
  "wiki.ic2.preview.cfoam.stairs.desc": "Cfoam Stairs — это декоративные лестницы, которые также взрывобезопасны.",
  "wiki.ic2.preview.cfoam.tiles": "Плитки Cfoam",
  "wiki.ic2.preview.cfoam.tiles.desc": "Плитки Cfoam похожи на ковер по форме, но при этом похожи на камень. Опять же, для украшения, но взрывобезопасны.",
  "wiki.ic2.preview.cfoam.wall": "Стена Cfoam",
  "wiki.ic2.preview.cfoam.wall.desc": "Хотите декоративную стену, которая является взрывостойкой? Стены Cfoam помогут вам!",
  "wiki.ic2.preview.cfoam.wool": "Cfoam Wool",
  "wiki.ic2.preview.cfoam.wool.desc": "Негорючая взрывостойкая шерсть? Шерсть Cfoam вас прикроет!",
  "wiki.ic2.preview.chainsaw.desc": "Бензопила — ваш универсальный инструмент/оружие! Она очень хороша для рубки деревьев, но также может стричь овец. В целом, действительно полезный инструмент!",
  "wiki.ic2.preview.charged_electrolyzer.desc": "Заряженный электролизер — это модернизированный электролизер, способный использовать несколько накопителей энергии для более быстрого наполнения предметов!",
  "wiki.ic2.preview.chargepad": "Зарядная панель",
  "wiki.ic2.preview.chargepad.desc": "Chargepad — это стационарное зарядное устройство, которое позаботится о ваших электрических устройствах, когда вы стоите на нем. Только не упадите на него!",
  "wiki.ic2.preview.charger_module.desc": "Модуль зарядного устройства. Он добавляет к электрической броне особую схему, чтобы делиться энергией с другими предметами, если они нуждаются в ней в вашем инвентаре.",
  "wiki.ic2.preview.charging_bench": "Зарядная скамья",
  "wiki.ic2.preview.charging_bench.desc": "Зарядная скамья — это инструмент для массовой зарядки, способный заряжать до 16 электрических предметов любого уровня. Он поставляется с некоторыми полезными инструментами.",
  "wiki.ic2.preview.chunkloader.desc": "Загрузчик фрагментов использует электричество, чтобы удержать мир от коллапса, создавая камеру пространства-времени. Насколько она велика, зависит от обеспечиваемой мощности. Минимум 5EU/т.",
  "wiki.ic2.preview.cocoa.desc": "Урожай какао-бобов производит указанные бобы. Для их роста требуется питательная почва (3 или более).",
  "wiki.ic2.preview.coffee.desc": "Кофе - полная противоположность чаю, и обе группы очень не любят друг друга. Он производит кофейные зерна, если область достаточно яркая (9 или выше), которые можно использовать для изготовления различные кофейные продукты, дающие различные эффекты.",
  "wiki.ic2.preview.coin.desc": "Промышленная монета — это предмет, который нельзя создать. Это валюта, поэтому ее нельзя создать. Ее выдает Trade-O-Mats.",
  "wiki.ic2.preview.color_filter_tube.desc": "Цветной фильтр просто сортирует элементы по их цвету. Позволяет использовать более простой фильтр и более сложные системы.",
  "wiki.ic2.preview.colossal_compressor.desc": "Что вы можете сделать, если у вас есть сверхскоростной компрессор? Сделайте максимально возможный компрессор! Это колоссальный компрессор! 40EU/t",
  "wiki.ic2.preview.colossal_extractor.desc": "Что вы можете сделать, если у вас есть сверхскоростной экстрактор? Сделайте максимально возможный экстрактор! Это Колоссальный экстрактор! 40EU/t",
  "wiki.ic2.preview.colossal_furnace.desc": "Что вы можете сделать, если у вас есть сверхскоростная печь? Сделайте максимально возможную печь! Это Колоссальная печь! 40EU/t",
  "wiki.ic2.preview.colossal_macerator.desc": "Что вы можете сделать, если у вас есть сверхскоростной мацератор? Сделайте максимально большой мацератор! Это Колоссальный мацератор! 40EU/t",
  "wiki.ic2.preview.colossal_recycler.desc": "Что вы можете сделать, если у вас есть гиперскоростной рейклер? Сделайте максимально возможный рейклер! Это Колоссальный рейклер! 40EU/t. Он также увеличивает удачу на 500%",
  "wiki.ic2.preview.compact_solar_panel": "Компактная солнечная панель",
  "wiki.ic2.preview.compact_solar_panel.desc": "Набор солнечных панелей, собранных вместе для экономии места. СЕРЬЕЗНО?!?!?",
  "wiki.ic2.preview.compact_watermill": "Компактная водяная мельница",
  "wiki.ic2.preview.compact_watermill.desc": "Собрать их вместе, чтобы увеличить эффективность... и это ещё как-то работает, oO?!?",
  "wiki.ic2.preview.compacting_recycler.desc": "Compacting Recycler — это модернизированный Recycler, который использует 16EU/t для безумно быстрой переработки всего мусора, который вам больше не нужен.",
  "wiki.ic2.preview.comparing_cable_item.desc": "Сравнивающий провод: он выводит сигнал красного камня в зависимости от желаемого диапазона пропускной способности. Он может работать с 2048EU и имеет потери каждые 2 блока",
  "wiki.ic2.preview.compressor.desc": "Компрессор — это одна из машин, необходимых для продвижения в дереве технологий. Он делает то, что говорит: сжимает вещи вместе. По дешевой цене 2EU/т. Получите его раньше поздно!",
  "wiki.ic2.preview.condensator.desc": "Конденсатор — это ресурсное решение для избавления от тепла. Они хранят много тепла. Полезно для нестабильных конструкций реакторов.",
  "wiki.ic2.preview.construction_light.desc": "Вы хотите более интересное освещение на своей строительной площадке? Как насчет строительного освещения? Это делает ощущение более реалистичным! И это работает!",
  "wiki.ic2.preview.copper_cable_item.desc": "Медный провод. Ваш начальный провод, который выдерживает до 32EU и может использоваться для 5 блоков, прежде чем произойдет какая-либо потеря.",
  "wiki.ic2.preview.cornflower.desc": "Василек — это цветок, который, как вы ожидаете, производит кукурузу. Нет, он производит синий краситель! Как это логично? Спросите кого-нибудь другого. Как и для всех цветов, для него требуется яркое место ( 12 и более) для роста.",
  "wiki.ic2.preview.crimson_fungus.desc": "Багровый грибок — это ваш саженец Нижнего мира. Его можно вырастить в бревна, которые позволят вам выжить в Нижнем мире, не имея при себе бревен. Этот урожай, хотя и производит грибы, требует полного сухая среда. Просто убедитесь, что он не взорвется на вас.",
  "wiki.ic2.preview.crop_analyzer.desc": "Анализатор культур — это ваш инструмент, позволяющий узнать, какие культуры у вас есть в данный момент. Но также позволяет увидеть, какие культуры получатся, если вы их размножите.",
  "wiki.ic2.preview.crop_analyzer_block.desc": "Crop Analyzer — это стационарный анализатор урожая, который может автоматически анализировать урожай на 10000EU за культуру. Хотя и не мгновенно, он делает это при 1EU/т.",
  "wiki.ic2.preview.crop_harvester.desc": "Уборочный комбайн — это автоматическая машина для уборки урожая. Он не быстрый и требует меньше ресурсов, но его можно модернизировать, и он выполняет свою работу за 5 евро/т",
  "wiki.ic2.preview.crop_library.desc": "Библиотека культур — это ваше цифровое хранилище урожая. В ней может храниться столько культур, сколько вам нужно. Хотя для доступа к ним требуется 1EU/т, а ее содержимое теряется при повреждении!",
  "wiki.ic2.preview.cropmatron.desc": "Cropmatron — присмотр за вашими посевами. Вы хотите, чтобы посевы были любимыми? Инвестируйте в один из них. 1-31EU/t ваши посевы получают все необходимое для ухода!",
  "wiki.ic2.preview.cutter.desc": "Резак — это ваш инструмент для управления проводами. Он может добавлять и удалять изоляцию кабелей.",
  "wiki.ic2.preview.damage_conversion_pad_upgrade.desc": "Улучшение преобразования урона превращает зарядную панель в смертельную ловушку. Вместо того, чтобы использовать энергию для зарядки игроков, оно наносит им урон.",
  "wiki.ic2.preview.dandelion.desc": "Одуванчик — типичный желтый цветок, для выращивания которого требуется яркое место (12 и более). Ничего особенного в нем нет.",
  "wiki.ic2.preview.detector_cable_item.desc": "Провод-детектор. Он определяет, проходит ли через него энергия, а затем излучает сигнал красного камня. Он может работать с 2048EU и может пройти 2 блока без потери.",
  "wiki.ic2.preview.detector_card.desc": "Карта детектора позволяет вам визуализировать, кто активировал детекторы игроков, что позволяет создать что-то вроде журнала доступа.",
  "wiki.ic2.preview.detector_pipe.desc": "Труба детектора — это труба, испускающая красный камень всякий раз, когда через нее проходит жидкость.",
  "wiki.ic2.preview.diamond_drill.desc": "Алмазная дрель — это модернизация бура, которая дает ему возможность добывать более твердые блоки, такие как обсидиан, но также безумно быстро добывает грязь. Требуется режим грязи!",
  "wiki.ic2.preview.directional_tube.desc": "Направленная трубка направляет предметы в нужном направлении. Выход можно заблокировать, чтобы ничего не пыталось пройти через выход.",
  "wiki.ic2.preview.drain_conversion_pad_upgrade.desc": "Улучшение Преобразования Поглощения еще хуже. Вместо того, чтобы заряжать ваши предметы, оно разряжает их, используя энергию, которую вы имеете в паде.",
  "wiki.ic2.preview.drill.desc": "Шахтерский бур — один из первых электрических инструментов, которые вам понадобятся. Это кирка и лопата, объединенные в одно целое. А с помощью Сканера можно сканировать руды поблизости!",
  "wiki.ic2.preview.dropping_tube.desc": "Катающаяся трубка похожа на пипетку, но к ней не прикреплены случайные движения. Также не требуется красный камень!",
  "wiki.ic2.preview.dyeing_tube.desc": "Трубка для окрашивания окрашивает предметы, проходящие через нее, в нужный цвет. Для выбора цвета используются художники-красители.",
  "wiki.ic2.preview.dynamite.desc": "Динамит — это ваш действительно контролируемый взрыв. Его можно поставить или бросить. Он создает взрыв 3x3x3, который разрушает большинство блоков. Подходит для добычи полезных ископаемых.",
  "wiki.ic2.preview.dynamite_remote.desc": "Динамит-О-Мот может связываться с размещенным динамитом и может активировать все связанные динамиты одновременно.",
  "wiki.ic2.preview.electric_blast_furnace.desc": "Электрическая доменная печь предназначена только для плавки руды с использованием электричества. Она использует 5EU/т и работает примерно на 40% быстрее доменной печи",
  "wiki.ic2.preview.electric_enchanter.desc": "Electric Enchanter дает вам возможность зачаровывать электрические инструменты. Это единственный способ, и для этого требуется 500EU/t.",
  "wiki.ic2.preview.electric_furnace.desc": "Электропечь — это простая, но прямолинейная печь, в которой для приготовления пищи используется электричество. Она использует 3EU/т и работает примерно на 40% быстрее, чем обычная печь.",
  "wiki.ic2.preview.electric_hoe.desc": "Электрическая мотыга — ваша нерушимая мотыга, которая также может менять капли урожая с продуктов на семена и обратно!",
  "wiki.ic2.preview.electric_pipe_pump.desc": "EPP — это насос, который использует электричество для подачи жидкостей по сети трубопроводов. Он имеет мощность 250 блоков и передает до 10 кмБ за тик.",
  "wiki.ic2.preview.electric_smoker.desc": "Электрическая коптильня использует электричество для копчения еды?!?!?! КАК? Магия? Магия! Она использует 5EU/t и примерно на 40% быстрее, чем обычная коптильня",
  "wiki.ic2.preview.electric_sprayer.desc": "Электрораспылитель — это ваш более управляемый распылитель. Использует EU для точного контроля количества выпускаемого CFoam. Заправляется только в Canner.",
  "wiki.ic2.preview.electric_tree_tap.desc": "Treetaps хрупкие, поэтому электрический TreeTap решает эту проблему, используя вместо этого EU. Позже его также можно обновить, чтобы он автоматически вставлял липкую смолу в ваш инвентарь!",
  "wiki.ic2.preview.electric_vent.desc": "Электровентиляторы используют производство вашего реактора в ЕС, чтобы охладить его в 2 раза эффективнее, чем обычные.",
  "wiki.ic2.preview.electric_wood_gassifier.desc": "Электрогазификатор древесины — это электрифицированный газификатор древесины, который использует 1EU/т для выполнения той же работы. К сожалению, он производит немного меньше древесного газа",
  "wiki.ic2.preview.electric_wrench.desc": "Электрический гаечный ключ — это ваш апгрейд гаечного ключа. Он имеет немного более высокую скорость выпадения, его можно улучшить, и он имеет 15 гарантированных выпадений без потерь.",
  "wiki.ic2.preview.electrolyzer.desc": "Электролизер — это машина, которая наполняет предметы электричеством. Чтобы выполнить свою работу, требуется непосредственное прикосновение к почти полностью заполненному накопителю энергии. Уровень хранилища определяет скорость.",
  "wiki.ic2.preview.energy_hud_module.desc": "Модуль HUD добавляет к вашему обзору информационный дисплей, позволяющий постоянно видеть мощность каждой части электроброни. Его положение не является окончательным.",
  "wiki.ic2.preview.energy_o_mat.desc": "Energy-O-Mat — это блок, который позволяет обменивать энергию на предметы или монеты. Для подключения требуется личное хранилище энергии. Позволяет автоматическую торговлю.",
  "wiki.ic2.preview.energy_storage": "Хранилище энергии",
  "wiki.ic2.preview.energy_storage.desc": "Хранилища энергии хранят избыточную энергию в вашей энергосистеме. Лимит энергии пакета такой же, как и на выходе.",
  "wiki.ic2.preview.eu_card.desc": "Карта ЕС показывает, сколько энергии находится внутри машины.",
  "wiki.ic2.preview.eu_reader.desc": "EU Reader — это ваш информационный инструмент. Будь то информация о графическом интерфейсе, информация о потоках энергии или просто общая статистика. Он открывает информацию, которую вы получаете массово!",
  "wiki.ic2.preview.extinguish_module.desc": "Вы горите? Хотите от него избавиться? Модуль тушения приходит на помощь! Он убирает ваш огонь, как только он появляется. Он не защищает из лавы.",
  "wiki.ic2.preview.extraction_tube.desc": "Экстракционная трубка — это трубка, которая просто извлекается из подключенных инвентарей с постоянной пастой. С помощью TubeTool можно добавить дополнительные дополнительные поверхности для извлечения.",
  "wiki.ic2.preview.extractor.desc": "Экстрактор — это переработчик ресурсов. Его основное назначение — перерабатывать липкую смолу в резину, увеличивая производительность втрое! Но у него гораздо больше применений. Обоснование 2EU/t. ",
  "wiki.ic2.preview.ferru.desc": "Урожай Ферру — это ваш Урожай Железа. Самый ценный из всех металлических урожаев. Для завершения выращивания требуется нироновый блок/руда.",
  "wiki.ic2.preview.fertilizer.desc": "Удобрение используется для ускорения роста сельскохозяйственных культур. Со временем оно расходуется медленно.",
  "wiki.ic2.preview.filter_tube.desc": "Трубка фильтров позволяет сортировать элементы в нужном вам направлении.",
  "wiki.ic2.preview.filtered_extraction_tube.desc": "Пробирка для извлечения с фильтром — гораздо более продвинутая трубка для извлечения. Ее можно фильтровать, но также можно улучшить, чтобы перемещать больше предметов одновременно.",
  "wiki.ic2.preview.filtered_scanner.desc": "Сканер с фильтрами позволяет вам решить, что именно вы ищете. Он не ограничивается рудами, как другие.",
  "wiki.ic2.preview.fire_coral.desc": "Огненный коралл — это подводная культура, которую можно использовать для выращивания коралловых блоков. У него есть шанс произвести все варианты огненных кораллов, если предположить, что он живой. Для этого требуется чистая вода (3 и более) для выращивания.",
  "wiki.ic2.preview.fisher": "Электрик Фишер",
  "wiki.ic2.preview.fisher.desc": "Electric Fisher — ваш эндгейм-решение для добычи. Он потребляет много энергии, но высасывает всю добычу из океанов.",
  "wiki.ic2.preview.fluid_expansion.desc": "Расширение жидкости позволяет промышленному верстаку использовать жидкости непосредственно в своих рецептах. Он хранит до 4 различных жидкостей вместимостью 128 ведер.",
  "wiki.ic2.preview.fluid_o_mat.desc": "Fluid-O-Mat — это блок, жидкость которого можно обменять на предметы или монеты. Для этого требуется подключение личного резервуара. Позволяет автоматическую торговлю.",
  "wiki.ic2.preview.fluid_scanner.desc": "Сканер жидкости ищет только жидкости. Его основное использование - это насос дальнего действия или если вы используете шахтер с насосами",
  "wiki.ic2.preview.fluid_scanner_filtered.desc": "Сканер отфильтрованных жидкостей позволяет вам искать определенные жидкости вместо любой из них.",
  "wiki.ic2.preview.fluid_tube.desc": "Жидкостная трубка, нечестивое слияние трубки и трубы. В основном позволяет пересекать 2 потока.",
  "wiki.ic2.preview.flux_generator": "Генератор потоков",
  "wiki.ic2.preview.flux_generator.desc": "Генератор потока создает RF из EU. Позволяет использовать FE/RF Power с помощью EU и может действовать как зарядное устройство!",
  "wiki.ic2.preview.foam_sprayer.desc": "Распылитель CFoam использует гранулы для распыления влажного CFoam. В качестве ориентира можно использовать строительные леса, а также можно распылять провода/трубы/трубы.",
  "wiki.ic2.preview.food_storage_module.desc": "Не хотите носить банки с едой в своем инвентаре? Нет проблем! Модуль хранения еды добавляет 4 слота для пригодных для использования консервов.",
  "wiki.ic2.preview.forget_me_not.desc": "Цветок \"Не забывай меня\" — красиво выглядящий голубой цветок. О нем обычно забывают, так как это составной цветок, который не часто нужен. Как и всем цветам, для его размещения требуется яркое место. расти (12 и более)",
  "wiki.ic2.preview.frequency_transmitter.desc": "Частотный передатчик — это инструмент для соединения 2 телепортов или телепортационных клапанов вместе.",
  "wiki.ic2.preview.fuel_boiler.desc": "Многоблочная структура. Производит 1024 мБ/т пара. Подробности смотрите ниже.",
  "wiki.ic2.preview.fuel_can.desc": "Канада с топливом — это ваше модульное хранилище топлива. Она пополняется в §lКаннере§r и может быть действительно отличным источником топлива. В зависимости от канистр она может быть заполнена 6- 12 шт.",
  "wiki.ic2.preview.fuel_jetpack.desc": "Реактивный ранец — это ваше раннее игровое решение для полета. Он действительно хорош в вертикальном движении, но, к сожалению, не так хорош в горизонтальном.",
  "wiki.ic2.preview.fusion_reactor.desc": "Нет лавы? Хотите постоянное пополнение? И не хотите качать Пустоту? Термоядерный реактор поможет вам. Он производит лаву, используя уран! Сверхэффективно!",
  "wiki.ic2.preview.generator.desc": "Самая основная машина для генерации электроэнергии в IC2. Производит колоссальные 10EU/т. Как и печь, использует уголь или древесину.",
  "wiki.ic2.preview.geothermal_generator.desc": "Мощный генератор, использующий лаву, производящий колоссальные 20EU/т. Легко покрывает многие потребности вашей ранней игры.",
  "wiki.ic2.preview.glassfiber_cable_item.desc": "Провод из стекловолокна. Подождите, стекловолокно? Как? Магия? Во всяком случае, это дорогой, но ценный провод, который работает с 512EU и может пройти 40 блоков без потерь",
  "wiki.ic2.preview.glow_berry.desc": "Светящаяся ягода — это еда в середине игры, которую можно использовать для выпечки!\n\nВ противном случае в ней нет ничего особенного.",
  "wiki.ic2.preview.glowshroom.desc": "Светлячок. Почему он существует? Потому что СВЕТИЛЬНИК! Он производит светящуюся пыль, но требует, чтобы к нему прикасался блок светящегося камня, чтобы он мог закончить рост.",
  "wiki.ic2.preview.gold_cable_item.desc": "Золотой провод: более качественная передача энергии. Выдерживает до 128EU и может передавать 2 блока без потерь.",
  "wiki.ic2.preview.heat_exchanger.desc": "Теплообменник обменивается теплом с соседними компонентами и/или самим реактором, помогая сбалансировать тепло.",
  "wiki.ic2.preview.heat_pack.desc": "Heatpack нагревает реактор в 1000 раз больше его размера. Позволяет легко поддерживать определенный уровень тепла. Нельзя использовать в паровом реакторе",
  "wiki.ic2.preview.heat_spreader.desc": "Теплоотвод компонента медленно охлаждает соседние соприкасающиеся компоненты.",
  "wiki.ic2.preview.heat_storage": "Ячейка охлаждающей жидкости",
  "wiki.ic2.preview.heat_storage.desc": "Хранилище тепла позволяет вам временно сохранять тепло в тепловом кеше. Это позволяет вашим компонентам работать дольше.",
  "wiki.ic2.preview.heat_vent.desc": "Тепловой вентиль медленно охлаждает себя и/или реактор.",
  "wiki.ic2.preview.hemp.desc": "Конопля — это эксклюзивная культура IC2. Да, вы не можете сажать ее без палочек для урожая IC2. Из нее получается указанная конопля, которую можно использовать во многих производственных процессах. площадь для роста (7 и более)",
  "wiki.ic2.preview.hops.desc": "Хмель - это ваше введение в пивоварение. Пиво можно продавать сельским жителям, использовать для производства энергии или для увеличения добычи из руды. Это полностью ручной процесс, который занимает несколько часов но его можно легко производить массово. Для выращивания требуется светлая область (9 или более)",
  "wiki.ic2.preview.horn_coral.desc": "Роговидный коралл — это подводная культура, которую можно использовать для выращивания коралловых блоков. У него есть шанс произвести все варианты роговых кораллов. Это при условии, что он живой. Он для роста требуется чистая вода (3 или более).",
  "wiki.ic2.preview.hover_tube.desc": "Hover Tube — это дорогостоящая технология, которая позволяет предметам не подвергаться влиянию гравитации или вообще изменять скорость.",
  "wiki.ic2.preview.hydration_cell.desc": "Ячейка гидратации — это ваш способ обеспечить дополнительную влажность вашим культурам. Некоторым для роста требуется очень высокая влажность.",
  "wiki.ic2.preview.induction_furnace.desc": "Индукционная печь — это модернизированная электрическая печь, которая может обрабатывать предметы быстрее и до 2 одновременно за счет сохранения питания и 16EU/т (1EU/т в режиме ожидания).",
  "wiki.ic2.preview.industrial_belt.desc": "Промышленный пояс позволяет носить на ногах некоторый заряд, который могут использовать инструменты во время майнинга.",
  "wiki.ic2.preview.industrial_worktable.desc": "Промышленный рабочий стол — это основной инструмент, который обеспечит максимально эффективное решение всех ваших потребностей в крафте!",
  "wiki.ic2.preview.inkbergine.desc": "Inkbergine — это кальмар, посаженный под водой вниз головой в землю. Он медленно выращивает для вас чернильные мешки. Но будьте осторожны, не прикасайтесь к нему. Он может облить вас чернилами.",
  "wiki.ic2.preview.input_pipe.desc": "Входная труба принимает жидкости из внешних источников, заставляя их распределяться через нее. Имеет силу только 25 блоков.",
  "wiki.ic2.preview.insertion_tube.desc": "Трубка для вставки отдает приоритет вставке в инвентарь, а не переходу к другим трубкам, просто и понятно.",
  "wiki.ic2.preview.inv_card.desc": "Карточка инвентаря позволяет визуализировать инвентарь с несколькими режимами его отображения. Хороший способ отслеживать инвентарь!",
  "wiki.ic2.preview.iridium_stone.desc": "Нужна персонализированная база? Иридиевый камень - идеальный источник для нее. Блок может быть уничтожен только их владельцем, и они БЕЗОПАСНЫ!",
  "wiki.ic2.preview.iron_cable_item.desc": "Провод из очищенного железа. Он способен выдержать 2048EU, но с ценой потери 1EU на каждом блоке.",
  "wiki.ic2.preview.iron_furnace.desc": "Улучшенная версия обычной печи. Работает чуть быстрее обычной печи.\nЖелезо > Камень.",
  "wiki.ic2.preview.item_limiter.desc": "Обновление ограничителя предметов позволяет вам решить, сколько предметов каждого типа может оставаться в определенном инвентаре. Что может очень пригодиться.",
  "wiki.ic2.preview.itnt.desc": "Промышленный TNT — это улучшенная форма TNT. Он имеет более сильную взрывную силу, но работает точно так же, как TNT и сбрасывает все разрушенные блоки! Идеально подходит для добычи полезных ископаемых!",
  "wiki.ic2.preview.jump_boost_module.desc": "Модуль ускорения прыжка дает вам большую силу прыжка, чтобы прыгать выше обычного.",
  "wiki.ic2.preview.kelp.desc": "Келп — это ваш подводный источник топлива, который теперь можно выращивать на суше! Обычно желательно массовое производство, поскольку это действительно твердый источник топлива. Он также очищает воду вокруг себя. .",
  "wiki.ic2.preview.lag_card.desc": "Карта отставания показывает, сколько отставаний на сервере. Это глобальное отставание.",
  "wiki.ic2.preview.lava_module.desc": "Вы когда-нибудь хотели принять горячую ванну? Как насчет лавовой ванны? Модуль \"Лава\" позволяет вам плавать в лаве для постоянного расхода энергии.",
  "wiki.ic2.preview.light_module.desc": "Вы ненавидите размещать факелы в пещерах? Световой модуль — это переносной источник света, который можно переключать. Обратите внимание, что это настоящий источник света, а не только средство визуализации.",
  "wiki.ic2.preview.lily_of_the_valley.desc": "Ландыш — ваш типичный белый цветок. Для полного роста ему требуется постоянный источник света 12 или больше.",
  "wiki.ic2.preview.limiter_tube.desc": "Лимитерная трубка — это ваш способ частично разделить сетку запросов, где одни цвета запросов блокируются, а другие пропускаются. ",
  "wiki.ic2.preview.liquid_generator.desc": "Жидкостный Генератор. Использует жидкое топливо для производства энергии. Подробности смотрите ниже.",
  "wiki.ic2.preview.lumilia.desc": "Лумилия — это декоративная культура, для роста которой требуется лунный свет. У нее только листья, но когда она полностью вырастет, она излучает свет.",
  "wiki.ic2.preview.luminator.desc": "Luminator делает то, что говорит: он делает ваш день ярче! Конечно, за небольшую энергию. Он также может быть заключен в стекло, если щелкнуть этим стеклом.",
  "wiki.ic2.preview.macerator.desc": "Масератор — действительно полезная машина для ранней игры. Его цель довольно проста: разбивать руды в пыль, удваивая ваши слитки! Для этого он использует 2EU/t.",
  "wiki.ic2.preview.machine_buffer.desc": "Машинный буфер — это небольшой буфер предметов, который может использовать улучшения транспорта для сортировки предметов. Действительно полезно для автоматизации.",
  "wiki.ic2.preview.machine_tank.desc": "Машинный бак — это небольшой буфер жидкости, который может использовать транспортные улучшения для перекачки жидкостей. Действительно полезно для автоматизации.",
  "wiki.ic2.preview.magnetizer.desc": "Намагничиватель — это то же, что пузырьковая колонна для лестницы. Он заряжает железные заборы, которые поднимут вас в небо или медленно подведут, если вы будете красться в металлических ботинках. !",
  "wiki.ic2.preview.malachite.desc": "Малахит — это ваш ржавый медный урожай. Чтобы закончить рост, ему требуется руда/блок под ним.",
  "wiki.ic2.preview.mass_fabricator.desc": "Слишком много энергии? Не беспокойтесь, Massfab прикрыл вас!! Он использует много энергии для создания розовых капель под названием UU Matter, которые можно использовать для создания практически чего угодно!",
  "wiki.ic2.preview.melon.desc": "Дыня — это крупный источник пищи, который производит ломтики дыни, хотя есть небольшой шанс, что он также производит целые блоки дыни. Его также можно настроить на производство семян вместо ломтиков.",
  "wiki.ic2.preview.memory_expansion.desc": "Расширение памяти предоставляет Industrial Workbench до 18 новых слотов рецептов для более сложных рецептов.",
  "wiki.ic2.preview.memory_stick.desc": "Memory Stick — это расширение рецептов для Industrial Workbench и Bulk Crafter. На нем хранятся рецепты для последующего использования.",
  "wiki.ic2.preview.miner.desc": "Шахтер — действительно эффективный копатель. Он использует сканеры, буры и шахтные трубы, чтобы копать прямо в сторону руды, а не в карьере. Использует 16EU/т. С ним взаимодействуют насосы.",
  "wiki.ic2.preview.miner_remote.desc": "Miner Remote — это локатор для Rocket Miner, который позволяет ему добраться до своего \"домашнего\" местоположения для заправки или опорожнения.",
  "wiki.ic2.preview.mining_laser.desc": "Горный лазер — это ваш продвинутый инструмент для копания. У него есть различные режимы лазера для избавления от блоков. Его можно использовать в шахтере, а также у него есть режим мощного оружия!",
  "wiki.ic2.preview.monitor.desc": "Монитор. Действительно полезный, полностью модульный блок, отображающий на нем текст и другие элементы. Для работы он использует карты монитора.",
  "wiki.ic2.preview.monitor_card.desc": "Карта монитора является основой для всех необходимых вам информационных карт или в терминах TLDR; это компонент для создания. Карты монитора можно настроить с помощью графического интерфейса.",
  "wiki.ic2.preview.mowing_tool.desc": "Вы когда-нибудь раздражались из-за листьев или травы? Инструмент косилки приходит на помощь! Когда вы включаете его, вы смотрите на что-то, что вас раздражает, и оно ИСЧЕЗАЕТ! Однако он избегает урожая.",
  "wiki.ic2.preview.nano_saber.desc": "Нано-сабля — ваше любимое оружие против электрической брони. Она наносит много дополнительного урона на молекулярном уровне. Это делает ее опасной контратакой!",
  "wiki.ic2.preview.netherwart.desc": "Нижний нарост - это противоположность Терраварта. Он используется для производства зелий среди нескольких других вещей. Если под ним находится блок песка душ, он растет на 50% быстрее, и Терраварты превращаются в Пустоты.",
  "wiki.ic2.preview.nightvision_goggles.desc": "Очки ночного видения позволяют видеть в темноте. Но, в отличие от экспериментального аналога, они не ослепляют при ярком освещении.",
  "wiki.ic2.preview.nuclear_reactor.desc": "§lАбсолютный источник энергии§r. Он полностью настраиваемый и §mбезопасный§r! Покроет все твои нужды, с риском потерять всё...",
  "wiki.ic2.preview.nuke": "Ядерная бомба",
  "wiki.ic2.preview.nuke.desc": "Ядерная бомба - это очень сильный взрыв. Он примерно в 75 раз сильнее обычного тротила. Ожидайте очень большую воронку с очень маленькими предметами. Можно обезвредить с помощью гаечного ключа.",
  "wiki.ic2.preview.obscurator.desc": "Вы когда-нибудь хотели построить сплошной дом из алмаза размером 9x9, но не хотели его добывать? Обскуратор делает свою работу! Он может копировать и поворачивать текстуры и вставлять их в Пена!",
  "wiki.ic2.preview.ocean_generator.desc": "Мощный генератор. Для его работы требуется много воды и кораллов, чтобы содержать его в чистоте. Выдаёт 100 EU/т.",
  "wiki.ic2.preview.orange_tulip.desc": "Оранжевый тюльпан является частью семейства тюльпановых цветов. Он производит оранжевый краситель и требует уровня освещенности 12 или выше.",
  "wiki.ic2.preview.ore_scanner.desc": "Сканер руды использует ccanners и 40EU/блок, чтобы точно показать вам, сколько/сколько и где находятся нужные вам ресурсы! Действительно недооценен!",
  "wiki.ic2.preview.overclocked_pump.desc": "Разогнанный насос — это более быстрый насос, который делает то же самое с добавленной стоимостью энергии. Просто намного быстрее.",
  "wiki.ic2.preview.overgrowth_fertilizer.desc": "Это специальное удобрение - ваше ядерное топливо для сельскохозяйственных культур. С ним скорость роста увеличивается в 256 раз на 5 минут. Это может пойти совсем не так.",
  "wiki.ic2.preview.oxeye_daisy.desc": "Оксайская маргаритка — цветок маргаритки, производящий светло-серый краситель. Как и всем цветам, ему нужен яркий уровень освещения.",
  "wiki.ic2.preview.painter.desc": "Раскраски в Painter. Я знаю, это шокирует... Вдобавок ко всему, он делает красители более эффективными и может массово окрашивать блоки.",
  "wiki.ic2.preview.parachute_module.desc": "Вы падаете с очень большой высоты и знаете, что скоро умрете. Вы должны были добавить модуль парашюта, который мог бы предотвратить это. Жаль!",
  "wiki.ic2.preview.personal_chest.desc": "Вы хотите, чтобы ваши предметы были в безопасности? Даже если кто-то уничтожит вашу базу? Личный сундук защитит вас. Он обеспечивает контроль доступа и не может быть уничтожен!",
  "wiki.ic2.preview.personal_tank.desc": "Хотите свой собственный персональный танк? От которого никто не сможет ворчать? Персональный танк поможет вам. Он позволяет даже индивидуальный доступ!",
  "wiki.ic2.preview.pickup_tube.desc": "Трубка Pickup вставляет в себя любой предмет, которого касается, с настраиваемым радиусом, используя §<redirect;true;Tube Tool;ic2:preview.tube_tool>. Линии, которые она броски должны быть такими хорошими. Хорошо для кактусовых ферм.",
  "wiki.ic2.preview.pink_tulip.desc": "Хорошо, вам, должно быть, надоел этот самоповторяющийся текст. Розовый тюльпан — это розовый цветок, для которого требуется уровень освещенности 12 или выше, и он производит розовый краситель.",
  "wiki.ic2.preview.pipe.desc": "Fluid Pipe — это ваш инструмент для транспортировки жидкостей. У него есть несколько выходных фильтров и дополнительные возможности извлечения. Может отправлять 20 мБ/т с силой 25.",
  "wiki.ic2.preview.pixelfoam": "Пиксельная пена",
  "wiki.ic2.preview.pixelfoam.desc": "Pixelfoam — очень декоративный блок с уникальной текстурой. У некоторых могут быть особые способности!",
  "wiki.ic2.preview.plasma_cable_item.desc": "Плазменный провод: СОВЕРШЕННЫЙ провод! Он может работать с 32kEU, хотя и с потерями в каждом блоке. На данный момент? Кого волнуют потери?",
  "wiki.ic2.preview.plasmafier.desc": "Plasmafier — это последние врата на уровень LuV. Он создает плазму с 10000EU/t и UU-Matter, которую можно хранить в пустых ячейках, которые используются для разблокировки всех предметов эндгейма! ",
  "wiki.ic2.preview.plating.desc": "Обшивка реактора позволяет увеличить предел нагрева реактора до того, как он взорвется.",
  "wiki.ic2.preview.poppy.desc": "Мак, также известный как роза, — ваш основной красный цветок. Применяются те же правила, что и для всех цветов.",
  "wiki.ic2.preview.portable_teleporter.desc": "Портативный телепорт находится в §labsolute§r §lendgame§r. Вы можете связать его с телепортом, и одним щелчком мыши вы уже там! Использует много энергии !",
  "wiki.ic2.preview.potato.desc": "Урожай картофеля. Этот урожай немного уникален. Хотя для него требуется уровень освещенности 9 или выше, он производит картофель. Но также у него очень небольшой шанс произвести ядовитый картофель. Что на самом деле является более ценным продуктом.",
  "wiki.ic2.preview.precision_wrench.desc": "Точный гаечный ключ — это последнее обновление гаечного ключа. Он удваивает все шансы гаечного ключа, делая его практически без потерь.",
  "wiki.ic2.preview.pressure_alloy_furnace.desc": "Печь для сплавов под давлением представляет собой многоблочную модернизацию своего аналога. Она требует нагрева для более быстрой обработки ресурсов при 16EU/т.",
  "wiki.ic2.preview.pressure_pipe.desc": "Труба высокого давления — это ваша магистральная труба, если 20 силы недостаточно. Она увеличивает ее до 100 силы.",
  "wiki.ic2.preview.progress_card.desc": "Карта прогресса показывает текущий прогресс операции машины.",
  "wiki.ic2.preview.protective_module.desc": "Яды раздражают. К счастью, Защитный модуль избавляется от них довольно быстро, хоть и дорого.",
  "wiki.ic2.preview.provider_tube.desc": "Трубка логистического провайдера, которая предоставляет предметы по мере их запроса логистической сетью. Множество настроек. Приоритетное направление можно установить с помощью TubeTool.",
  "wiki.ic2.preview.proximity_booster_pad_upgrade.desc": "Улучшение Proximity Booster позволяет заряжать не только предмет, который у вас в руке, но и слоты, непосредственно соприкасающиеся с ним.",
  "wiki.ic2.preview.pump.desc": "Насос — это машина, которая использует EU для всасывания жидкостей непосредственно под ним, чтобы перекачивать их в контейнер с жидкостью. Он использует 1EU/t и имеет множество специальных взаимодействий. ",
  "wiki.ic2.preview.pumpkin.desc": "Урожай тыквы: из него растут тыквы. В этом нет ничего особенного.",
  "wiki.ic2.preview.purple_tulip.desc": "Фиолетовый тюльпан производит пурпурный краситель и требует уровня освещенности 12 или выше.",
  "wiki.ic2.preview.quarry_scanner.desc": "Сканер карьера превращает шахтера в карьер, который выкапывает все подряд. Не заботясь о том, что он выкапывает на самом деле.",
  "wiki.ic2.preview.rainbow_flower.desc": "Радужный цветок - очень уникальный цветок. Он производит все типы красителей, но какой из них выпадает, совершенно случайно. Ходят слухи, что он также мог производить лазурит с очень низкой шанс. Хотя это всего лишь слухи. Также действуют цветочные правила.",
  "wiki.ic2.preview.ranged_pump.desc": "Насос дальнего действия — это еще одно обновление насоса, которое позволяет перекачивать жидкости издалека благодаря способности шахтеров. Он не может добывать ресурсы. Он потребляет 8 евро/т",
  "wiki.ic2.preview.rare_earth_extractor.desc": "Земля кубической формы Матери скрывает от нас много редких ресурсов, таких как алюминий! Экстрактор редкоземельных элементов медленно открывает их для нас. По 1EU/т.",
  "wiki.ic2.preview.reactor_card.desc": "Карта реактора предоставляет вам много информации о реакторе. От производства до времени, которое осталось для запуска урана и многого другого",
  "wiki.ic2.preview.reactor_fuel_cell.desc": "Топливный элемент реактора — это топливо, которое нужно зарядить, прикоснувшись к урановому стержню. Он поглощает создаваемые им изотопы.",
  "wiki.ic2.preview.reactor_planner.desc": "The Reactor Planner — это симулятор, который позволяет вам безопасно тестировать установки вашего реактора, не подвергаясь ядерной бомбардировке. Он использует 100EU/t для моделирования конструкции реактора.",
  "wiki.ic2.preview.recycler.desc": "Переработчик используется для уничтожения всех ненужных предметов, лежащих вокруг базы. Хотя он медленнее, чем бассейн с лавой, он может производить лом, который можно использовать позже. По цене 1EU/т. ",
  "wiki.ic2.preview.red_mushroom.desc": "Красный гриб красивее из двух. Но не говорите этого коричневому грибу. Он производит красные грибы и требует любой влажности для роста.",
  "wiki.ic2.preview.red_tulip.desc": "Красный тюльпан, по сути, является клоном мака. Вот и все.",
  "wiki.ic2.preview.red_wheat.desc": "Красная пшеница - просто застенчивая пшеница. Ей не нравится яркость (между 5 и 12). Ее продукт - пыль красного камня, поэтому она действительно ценна. Она также может производить семена, если она установлен режим.",
  "wiki.ic2.preview.redirector_master.desc": "Мастер-перенаправитель — действительно уникальный блок. Он может распределять мощность между подчиненными в зависимости от процента. Позволяет взять распределение мощности в свои руки.",
  "wiki.ic2.preview.redirector_slave.desc": "Слэйв-перенаправитель получает питание от своего мастера и пытается распределить его. Если он не может этого сделать, будущие пакеты будут временно разделены между другими слэйвами.",
  "wiki.ic2.preview.redstone_tube.desc": "Труба красного камня излучает сигнал красного камня каждый раз, когда через нее проходит предмет, и как только в ней больше нет предметов, сигнал исчезает.",
  "wiki.ic2.preview.refinery.desc": "Перерабатывающий завод позволяет перерабатывать ресурсы в ресурсы более высокого качества. При необходимости смешивая предметы и жидкости. Увеличение выхода руды или производство высококачественного топлива.",
  "wiki.ic2.preview.reflector.desc": "Отражатель нейтронов делает уран более эффективным, вызывая при этом больше тепла, отражая нейтроны обратно в источник.",
  "wiki.ic2.preview.reinforced.glass": "Армированное стекло",
  "wiki.ic2.preview.reinforced.glass.desc": "Армированное стекло — это сверхпрочное стекло, способное противостоять взрывам. Оно немного слабее своего каменного аналога.",
  "wiki.ic2.preview.reinforced.stone": "Укрепленный камень",
  "wiki.ic2.preview.reinforced.stone.desc": "Укрепленный камень прочнее обсидиана, и с несколькими слоями он может выдержать ядерный взрыв!",
  "wiki.ic2.preview.reinforced_door.desc": "Усиленная дверь отлично защищает от взрывов. Короче говоря, это безопасная дверь!",
  "wiki.ic2.preview.request_tube.desc": "Труба запроса позволяет запрашивать элементы из подключенных трубок провайдера. Она имеет множество настроек, например цветовое кодирование, которые можно просмотреть.",
  "wiki.ic2.preview.restoring_fertilizer.desc": "Это удобрение восстанавливает урожай от своего ядерного аналога, поскольку впоследствии он погиб. Ни одно из них нельзя использовать дважды.",
  "wiki.ic2.preview.rock_cutter_drill.desc": "Отбойный молоток — это специализированная дрель, которую изобрел Грег. Она была оптимизирована для работы с камнями и обсидианом и ни с чем другим. Добыча обсидиана еще никогда не была такой приятной!",
  "wiki.ic2.preview.rocket_miner.desc": "Ракетный шахтер — это летающий шахтер, который ищет новые места для раскопок. Кроме того, вы можете дать ему заправочную станцию ​​и способ избавиться от мусора.",
  "wiki.ic2.preview.rotary_macerator.desc": "Rotary Macerator — это модернизированный Macerator, который может разбивать камни намного быстрее за 16EU/т, хотя для поддержания такой высокой скорости требуется постоянный сигнал.",
  "wiki.ic2.preview.rotor": "Роторы ветряных мельниц",
  "wiki.ic2.preview.rotor.desc": "Роторы — это то, что вы бросаете в §<redirect;true;ветряную мельницу;ic2:preview.windmill>, чтобы заставить ее вращаться. Только у них разная долговечность.",
  "wiki.ic2.preview.round_robin_tube.desc": "Трубка Round Robin перераспределяет предметы на другие стороны в нужном количестве; размер стека полностью игнорируется.",
  "wiki.ic2.preview.sapling_acacia.desc": "Дерево акации бонсай — это ваш производитель бревен/саженцев акации. Это одна из самых эффективных ферм деревьев, которые вы можете построить. Для нее требуется уровень освещенности 9 и все. ",
  "wiki.ic2.preview.sapling_birch.desc": "Березка бонсай — это ваш производитель березовых бревен и саженцев. Это одна из самых эффективных лесных ферм, которую вы можете построить. Для нее требуется уровень освещенности 9 и все. ",
  "wiki.ic2.preview.sapling_dark_oak.desc": "Бонсай Темный дуб — ваш производитель бревен и саженцев Темного дуба. Это одна из самых эффективных лесных ферм, которую вы можете построить. Для нее требуется уровень освещенности 9, и это все Это.",
  "wiki.ic2.preview.sapling_jungle.desc": "Дерево джунглей бонсай — это ваш производитель бревен/саженцев в джунглях. Это одна из самых эффективных ферм деревьев, которую вы можете построить. Для нее требуется уровень освещения 9 и все. ",
  "wiki.ic2.preview.sapling_oak.desc": "Дуб бонсай — это ваш производитель дубовых бревен и саженцев. Это одна из самых эффективных лесных ферм, которую вы можете построить. Для нее требуется уровень освещенности 9 и все. ",
  "wiki.ic2.preview.sapling_spruce.desc": "Ель бонсай — это ваш производитель еловых бревен/деревьев. Это одна из самых эффективных лесных ферм, которые вы можете построить. Для нее требуется уровень освещенности 9 и все. ",
  "wiki.ic2.preview.sawmill.desc": "Лесопилка — это простая машина. Она яростно распиливает бревна на доски по цене 2EU/t с возможностью стать более эффективной, чем игрок, использующий улучшения §<redirect;true;Sawblade; ic2:preview.upgrade_efficient_sawblade>. Берегите кончики пальцев!",
  "wiki.ic2.preview.scanner.od": "Сканер плотности руды",
  "wiki.ic2.preview.scanner.od.desc": "Сканер плотности руды показывает вам, насколько плотны руды под вами, используя бинарную оценку.",
  "wiki.ic2.preview.scanner.ov": "Сканер стоимости руды",
  "wiki.ic2.preview.scanner.ov.desc": "Сканер стоимости руды показывает вам общую стоимость руд под вами, оценивая ее на основе стоимости руд.",
  "wiki.ic2.preview.scrapbox.desc": "Scrapbox — неофициальный лутбокс в игре. В нем много случайных и редких предметов. Только не выпускайте их массово...",
  "wiki.ic2.preview.sea_grass.desc": "Морская трава — это ваша подводная трава, которая уничтожает ваши посевы. Поскольку трава не может расти под водой, вместо этого она будет распространяться.",
  "wiki.ic2.preview.sea_pickle.desc": "Кажется, Море в маринаде, ну, оно растет маринадом. Морские маринады являются источником зеленого красителя, а также излучают свет под водой. Это классный источник света. Для него требуется яркая область (10 и более) для роста.",
  "wiki.ic2.preview.shields": "Щиты",
  "wiki.ic2.preview.shields.desc": "IC2 добавляет в игру несколько пользовательских щитов, которые просто добавляют разнообразия. Электрический использует электричество вместо прочности.",
  "wiki.ic2.preview.simple_crop_library.desc": "Простая библиотека культур — это ваш ранний доступ к более плотному хранилищу культур. Она может хранить до 20 различных культур с 20 мутациями и не требует питания.",
  "wiki.ic2.preview.simple_pipe_pump.desc": "Простой трубчастый насос — это насос, которая перекачивает жидкости через сетку труб. Он имеет дальность 100 блоков и передает 20мб за тик.",
  "wiki.ic2.preview.simple_tube.desc": "Ваша основная трубка, которая перемещает предметы. Нечего добавить. Дешево и выполняет свою работу.",
  "wiki.ic2.preview.singularity_compressor.desc": "Singularity Compressor — это модернизированный компрессор, использующий мощность 16EU/t для создания достаточного давления для сингулярности.",
  "wiki.ic2.preview.slag_generator.desc": "Продвинутый Генератор. Выдаёт 60EU/т. Так-же, рандомно производит Утильсырьё в качестве побочного продукта.",
  "wiki.ic2.preview.slow_grinder.desc": "Slow Grinder — это высокоэффективный ресайклер, который имеет эффективность 100% или меньше, если желательна более высокая скорость. За 10EU/т.",
  "wiki.ic2.preview.smoker_induction_furnace.desc": "Индукционная коптильня — это специализированная индукционная печь, которая может коптить продукты намного быстрее всего за 30 евро/т. Как? Волшебство! Как иначе?!?!",
  "wiki.ic2.preview.solar_helmet.desc": "Солнечный шлем — ваш пассивно переносимый источник энергии, который заряжает вашу броню и инструменты. Под землей не поможет!",
  "wiki.ic2.preview.solar_panel.desc": "§lБесплатная энергия солнца§r. Выдаёт 1EU/т в течение дня. Убедитесь, что где-то есть запасной генератор, пожалуйста...",
  "wiki.ic2.preview.solar_panel_compressed.desc": "\"Что, если я брошу свою солнечную панель в компрессор?\". Давай посмотрим...",
  "wiki.ic2.preview.solar_turbine.desc": "§lСолнце и вода?§r При наличии воды она выдаёт до 32EU/т и будет вырабатывать энергию по мере остывания, максимизируя свою мощность.",
  "wiki.ic2.preview.sonar_module.desc": "Сонарный модуль — это сканер ближнего и дальнего действия, который выделяет все объекты в пределах диапазона. Может оказаться полезным, если вы что-то ищете. Включен классный эффект.",
  "wiki.ic2.preview.sound_beacon.desc": "Звуковой маяк — это ваш способ управления звуками IC2. Поскольку они особенные, это позволяет вам создавать микрокарманы шумоподавителей/усилителей. Используются улучшения.",
  "wiki.ic2.preview.speed_boost_module.desc": "Модуль повышения скорости заставляет вас двигаться со скоростью звука. Только не врезайтесь в стены.",
  "wiki.ic2.preview.speed_tube.desc": "Speed Tube гарантирует, что ваши предметы быстро перемещаются в вашем мире.",
  "wiki.ic2.preview.splitter_cable_item.desc": "Провод-разветвитель. Его можно использовать для отключения соединения через красный камень. Он работает с 2048EU и теряет каждые 2 блока.",
  "wiki.ic2.preview.splitter_pipe.desc": "Разделительная труба — это вспомогательная труба, которая обрывает все соединения, когда на нее подается питание, но восстанавливает их, когда сигнал красного камня пропадает.",
  "wiki.ic2.preview.stacking_tube.desc": "Стакационная трубка. Направленная трубка, которая поглощает все предметы и складывает их до нужного размера. Затем выводит их на нужную сторону.",
  "wiki.ic2.preview.stannum.desc": "Олово — это ваша гибкая оловянная руда. Олово используется практически везде. Для его роста требуется руда/блок указанного металла под ним, гладкий и простой.",
  "wiki.ic2.preview.static_boots.desc": "Статические ботинки - это то, что всегда делают дети, когда узнают, что ковры могут быть использованы для ударов током. Вы получаете небольшое производство в ЕС за каждые несколько пройденных кварталов.",
  "wiki.ic2.preview.steam_reactor.desc": "Улучшенная версия Ядерного Реактора. Риск выше. Награда больше. Без права на ошибку...",
  "wiki.ic2.preview.steam_tunnel.desc": "Многоблочная структура, производящая колоссальные 2048EU/т в пакетах по 512EU ипользуя до 4096 мВ пара. Возвращает воду.",
  "wiki.ic2.preview.steam_turbine.desc": "Энергия из пара. Генерирует 32EU/т из 64 мВ пара, без возврата воды. Использование §lТопливного котла§r в качестве источника добавляет 8EU/т.",
  "wiki.ic2.preview.steam_vent.desc": "Паровой клапан использует воду из реактора для создания пара. Чем они горячее, тем эффективнее они работают.",
  "wiki.ic2.preview.step_assist_module.desc": "Все любят помощь при шагах. Вот модуль для него. Хотя с ним связана небольшая плата.",
  "wiki.ic2.preview.stickreed.desc": "Липкие камыши - самая ценная культура из всех культур, поскольку они массово производят липкую смолу. Если у вас всегда нет каучука, это решит все ваши проблемы. Это просто довольно сложно получить, но особых нужд нет.",
  "wiki.ic2.preview.sticky_dynamite.desc": "Липкий динамит — это ваш бросок динамита, который прилипает к первому блоку, которого касается. В остальном он работает точно так же, как обычный динамит.",
  "wiki.ic2.preview.sticky_tube.desc": "Липкая трубка - это действительно крутая трубка, она прилипает везде! Кроме шуток, она позволяет вам извлекать из древесины и ведер каучуковые деревья! Больше никаких летающих смоляных хлопьев!! ",
  "wiki.ic2.preview.stone_canner.desc": "Кухонный комбайн, который при помощью банок, превращает обычную еду в консервы. Компактно и вкусно.",
  "wiki.ic2.preview.stone_macerator.desc": "Примитивный дробитель, работающий на угле. Ужасно неэффективен по топливу, но позволяет быстро удваивать руду.",
  "wiki.ic2.preview.storage_expansion.desc": "Расширение хранилища добавляет еще 18 слотов к промышленному рабочему столу, просто и понятно.",
  "wiki.ic2.preview.su_battery.desc": "Одноразовая батарея — это небольшой, но полезный инструмент, который дает 1000 евро за немного красного камня и угля. Позволяет быстро получать энергию без строительства генераторов.",
  "wiki.ic2.preview.sugarcane.desc": "Сахарный тростник, очень быстрорастущая культура. Он производит сахарный тростник и является материалом для размножения липкого тростника. Ходят слухи, что он растет быстрее на песке, чем на земле. Другие слухи говорят об обратном. Никто не знает, какой из них верный",
  "wiki.ic2.preview.super_cable_item.desc": "Ах, суперпровод. Благодаря силе пива вы можете передать 8192EU через 1000 блоков, прежде чем произойдет какая-либо потеря. Некоторые могут сказать, что это слишком дешево!",
  "wiki.ic2.preview.sweet_berry_bush.desc": "Ягодный куст — это источник еды в ранней игре, который жалит вас, если вы не будете осторожны. Помимо этого, у них нет никаких требований.",
  "wiki.ic2.preview.switch_tube.desc": "Простая трубка-переключатель. Делает то, что говорит. Если она получает сигнал красного камня, она просто закрывает все соединения, пока сигнал не исчезнет.",
  "wiki.ic2.preview.tank.desc": "Бак — это модульный контейнер для жидкости, который можно собрать из множества блоков. Блоков может быть до 50x200x50. Для взаимодействия с ним используются клапаны.",
  "wiki.ic2.preview.tank_storage_module.desc": "Как насчет того, чтобы превратить вашу броню в переносной танк? Это то, что делает модуль хранения танков. Ничего особенного.",
  "wiki.ic2.preview.tea.desc": "Чай для тех, кто хочет расслабиться. Из него получаются чайные листья, из которых можно приготовить различные виды чая. Большинство любителей чая не любят кофе. Для него требуется уровень освещенности 7 или лучше расти.",
  "wiki.ic2.preview.teleport_tube.desc": "Труба телепорта. Она отправляет/принимает предметы в/из других желаемых труб телепорта. Запросы на логистику не отправляются. Работает в разных измерениях.",
  "wiki.ic2.preview.teleporter.desc": "Телепорт - ваш инструмент для телепортации на большие расстояния, который требует невероятного количества энергии. Вот почему он должен оставаться рядом с хранилищами энергии.",
  "wiki.ic2.preview.teleporter_hub.desc": "Что, если вы объедините телепорт и базовый телепорт? Да, вы получите концентратор телепорта! По сути, это телепорт \"выбери свою цель\". Потребляет много энергии! ",
  "wiki.ic2.preview.terraformer.desc": "Мир не такой, как вы хотите? Вы хотите его изменить? Терраформер приходит на помощь. Он способен изменить мир. За тысячи евро/ т.",
  "wiki.ic2.preview.terrawart.desc": "Terrawart — действительно полезный предмет. Его можно легко получить, поместив снежный блок под адский нарост. Снежный блок также увеличивает рост на 50%. Съеденный Terrawart удаляет все плохие эффекты зелья от вас.",
  "wiki.ic2.preview.tesla_coil.desc": "Катушка Теслы - это шокер! В буквальном смысле. Она накапливает заряд, и когда рядом находится какое-либо живое существо, она высвобождает заряд, убивая его током. Полезно для гриндеров.",
  "wiki.ic2.preview.text_card.desc": "Текстовая карточка показывает текст, который вы можете ввести здесь. Также поддерживается табуляция. (Будет преобразована в пробелы).",
  "wiki.ic2.preview.tfbp.desc": "Чертеж терраформера определяет, как работает терраформер. Это план изменения окружающей среды. Это очень дорого.",
  "wiki.ic2.preview.tfbp_biome.desc": "Чертеж биома терраформера определяет, как работает терраформер. Он изменяет биом, в котором вы находитесь. Это также очень дорого.",
  "wiki.ic2.preview.tfbp_biome_chilling.desc": "Террачип на Охлаждение меняет биом на биом снежной тундры.",
  "wiki.ic2.preview.tfbp_biome_cultivation.desc": "Террачип на Озеленение изменяет биом на биом равнин.",
  "wiki.ic2.preview.tfbp_biome_desertification.desc": "Террачип на Опустынивание изменяет биом на биом пустыни.",
  "wiki.ic2.preview.tfbp_biome_forestification.desc": "Террачип на Лесообразование изменяет биом на биом леса",
  "wiki.ic2.preview.tfbp_biome_irrigation.desc": "Террачип на Орошение изменяет биом на болотный биом",
  "wiki.ic2.preview.tfbp_biome_mushroom.desc": "Террачип на Грибы меняет биом на грибной биом",
  "wiki.ic2.preview.tfbp_biome_undergrowth.desc": "Террачип на Подлесок изменяет биом на биом джунглей",
  "wiki.ic2.preview.tfbp_chilling.desc": "Террачип на Охлаждение создает зимнюю страну чудес.",
  "wiki.ic2.preview.tfbp_cultivation.desc": "Террачип на Озеленение превращает вашу территорию в равнинное поле с растущими культурами и цветами.",
  "wiki.ic2.preview.tfbp_desertification.desc": "Террачип на Опустынивание превращает территорию в пустыню.",
  "wiki.ic2.preview.tfbp_flatification.desc": "Террачип на Выравнивание выравнивает область вокруг себя до уровня терраформирования y. Либо заполняя недостающие блоки, либо удаляя блоки.",
  "wiki.ic2.preview.tfbp_irrigation.desc": "Террачип на Орошение превращает вашу территорию в тропический лес.",
  "wiki.ic2.preview.tfbp_mushroom.desc": "Террачип на Грибы превращает вашу область в грибной остров. Включая сбор грибов!",
  "wiki.ic2.preview.thermal_generator.desc": "Улучшенный Геотермальный Генератор. Выдаёт 90EU/т. Подробности смотрите ниже.",
  "wiki.ic2.preview.thermometer.desc": "Термометр — это ваш инструмент для реакторов. Он позволяет вам увидеть, насколько горяч реактор в данный момент. Это может быть жизненно важной информацией.",
  "wiki.ic2.preview.time_card.desc": "Карта времени. Она показывает игровое время, время сервера, ваше время и время Галактики... Подождите, не это. Но она показывает время.",
  "wiki.ic2.preview.tin_cable_item.desc": "Оловянный провод. Это очень дешевый, но слабый проводник энергии. Он может работать только с 5EU, но без потерь для 40 блоков. Идеально подходит для солнечных ферм или водяных мельниц!",
  "wiki.ic2.preview.tool_box.desc": "Ящики для инструментов — это ваш портативный инвентарь для инструментов/еды, которые вы не используете так часто, но все же в них нуждаетесь. Они бывают разных размеров.",
  "wiki.ic2.preview.tools.aluminium": "Алюминиевые инструменты",
  "wiki.ic2.preview.tools.aluminium.desc": "Алюминиевые инструменты находятся между алмазом и железом. Менее долговечны, но быстрее, но наносят меньше урона.",
  "wiki.ic2.preview.tools.bronze": "Бронзовые инструменты",
  "wiki.ic2.preview.tools.bronze.desc": "Бронзовые инструменты немного более долговечны, чем их железные аналоги. Это просто еще один набор полезных инструментов для ранней игры.",
  "wiki.ic2.preview.trade_o_mat.desc": "Trade-O-Mat позволяет обменивать предметы на другие предметы или монеты. Для этого требуется подключение личного сундука. Позволяет автоматическую торговлю.",
  "wiki.ic2.preview.transformer": "Трансформер",
  "wiki.ic2.preview.transformer.desc": "Преобразователь позволяет вам контролировать энергию пакетов, проходящих через сеть. 1 большой пакет превращается в 4 меньших пакета.",
  "wiki.ic2.preview.transformer_adjustable.desc": "Настраиваемый преобразователь — это полностью настраиваемый преобразователь. Его нельзя инвертировать, но он может создавать до 32 пакетов любого размера.",
  "wiki.ic2.preview.transport_tube.desc": "Транспортная труба соединяется только с другими трубами. Инвентарь игнорируется.",
  "wiki.ic2.preview.tree_tap.desc": "Treetap — ваш инструмент для извлечения липкой смолы из каучуковых деревьев. Будьте осторожны, чтобы не перебить деревья.",
  "wiki.ic2.preview.treetap_and_bucket.desc": "Treetap & Bucket — очень полезный вспомогательный блок, который вы можете прикрепить к каучуковым деревьям, чтобы автоматически собирать их. Они хранят 5 единиц смолы и ускоряют рост смолы.",
  "wiki.ic2.preview.tube_coral.desc": "Трубчатый коралл — это подводная культура, которую можно использовать для выращивания коралловых блоков. У него есть шанс произвести все варианты трубчатых кораллов. При условии, что он живой. Он для роста требуется чистая вода (3 или более).",
  "wiki.ic2.preview.tube_tool.desc": "TubeTool — это ваш конфигуратор некоторых функций трубки. Эти функции значительно расширяют контроль над действиями трубки",
  "wiki.ic2.preview.upgrade.kit.pad": "Комплекты обновления зарядной панели",
  "wiki.ic2.preview.upgrade.kit.pad.desc": "Наборы для обновления зарядных устройств позволяют обновлять зарядные устройства без их замены.",
  "wiki.ic2.preview.upgrade.kit.storage": "Наборы для улучшения накопителей энергии",
  "wiki.ic2.preview.upgrade.kit.storage.desc": "Наборы для улучшения хранилища позволяют обновить ваше предыдущее хранилище энергии до желаемого нового уровня.",
  "wiki.ic2.preview.upgrade_basic_fluid_export.desc": "Обновление Simple Fluid Export Upgrade в основном выталкивает из машины 100 МБ за такт. Можно складывать до 9 элементов.",
  "wiki.ic2.preview.upgrade_basic_fluid_import.desc": "Простое обновление импорта жидкости в основном извлекает 100 МБ за тик из резервуара с жидкостью. Может быть сложено до 9 элементов.",
  "wiki.ic2.preview.upgrade_cobble_generator.desc": "Улучшение Cobblegen производит булыжник на входе машин со скоростью 1 единица в секунду. Его можно складывать.",
  "wiki.ic2.preview.upgrade_container.desc": "Контейнер обновлений — это, по сути, расширение для обновления. У него есть 3 слота для обновлений, которые может использовать машина. Хотя недопустимые обновления отключены.",
  "wiki.ic2.preview.upgrade_crafting.desc": "Улучшение крафта создает предметы вместе и экспортирует их в подключенный инвентарь. Скорость крафта зависит от того, насколько быстро инвентарь предоставляет предметы.",
  "wiki.ic2.preview.upgrade_creative.desc": "Творческое обновление предназначено только для творческого использования. Обеспечивает повышение мощности/уровня/скорости.",
  "wiki.ic2.preview.upgrade_durable_sawblade.desc": "Прочный пильный диск — это улучшение только для лесопилки. Скорость станка увеличивается на 400%, а производительность увеличивается на 2 предмета по цене +2EU/т",
  "wiki.ic2.preview.upgrade_efficiency.desc": "Обновление \"Эффективность\" делает машины намного более эффективными. Потребление энергии снижается на 5%. В каждой машине допускается несколько стеков.",
  "wiki.ic2.preview.upgrade_efficient_sawblade.desc": "Efficient Sawblade — это улучшение только для лесопилки. Скорость станка увеличивается на 200%, а производительность увеличивается на 4 единицы по цене +1EU/т",
  "wiki.ic2.preview.upgrade_energy_storage.desc": "Обновление хранилища энергии увеличивает внутренний буфер на +10000EU.",
  "wiki.ic2.preview.upgrade_energy_storage_multiplier.desc": "§Обновление Energy Storage Multiplier удваивает текущий внутренний буфер энергии.",
  "wiki.ic2.preview.upgrade_exp_collector.desc": "Обновление \"Сборщик опыта\" собирает дополнительный опыт с машин. Он имеет ограничение в 5000 единиц хранения опыта и эффективность его сбора 50%.",
  "wiki.ic2.preview.upgrade_export.desc": "Export Upgrade — это расширенное обновление ввода-вывода. Его можно фильтровать, и оно использует EU для одновременного выпуска гораздо большего количества элементов",
  "wiki.ic2.preview.upgrade_field_upgrade": "Обновление расширения поля",
  "wiki.ic2.preview.upgrade_field_upgrade.desc": "Обновление Field Expansion Upgrade увеличивает диапазон зарядки зарядной панели.",
  "wiki.ic2.preview.upgrade_fluid_export.desc": "Обновление Fluid Export Upgrade — это расширенное обновление ввода-вывода. Оно может быть отфильтровано и использует EU для увеличения в 10 раз его более простого варианта.",
  "wiki.ic2.preview.upgrade_fluid_import.desc": "Обновление Fluid Import Upgrade — это расширенное обновление ввода-вывода. Его можно фильтровать и использовать EU, чтобы увеличить его в 10 раз по сравнению с более простым вариантом.",
  "wiki.ic2.preview.upgrade_import.desc": "Обновление импорта — это расширенное обновление ввода-вывода. Его можно фильтровать, и он использует EU для одновременного извлечения гораздо большего количества элементов",
  "wiki.ic2.preview.upgrade_loudness.desc": "Обновление громкости делает машину громче. Если она работает на максимальной мощности, звук будет слышен еще дальше.",
  "wiki.ic2.preview.upgrade_muffler.desc": "Обновление глушителя делает машину тише. Таким образом, ее все еще можно услышать, но она менее раздражает.",
  "wiki.ic2.preview.upgrade_mute.desc": "Обновление без звука сразу отключает звук машины.",
  "wiki.ic2.preview.upgrade_overclocker.desc": "Обновление Overclocker делает машину намного быстрее, чем раньше. Оно обеспечивает прирост скорости на 30% при увеличении энергопотребления на 60%.",
  "wiki.ic2.preview.upgrade_quantum_overclocker.desc": "Обновление Quantum Overclocker Upgrade — это обновление для эндшпиля. Оно делает машину на 60% быстрее и увеличивает энергопотребление на 30%.",
  "wiki.ic2.preview.upgrade_redstone_inverter.desc": "Обновление Redstone Inverter Upgrade инвертирует требования к красному камню. Если требуется сильный сигнал, теперь требуется низкий уровень.",
  "wiki.ic2.preview.upgrade_redstone_sensitivity.desc": "Обновление чувствительности красного камня переключается, если у машины есть какие-либо требования к красному камню. Обеспечивает гораздо больший контроль.",
  "wiki.ic2.preview.upgrade_simple_export.desc": "Обновление простого экспорта медленно выталкивает предметы из машины. 1 предмет в секунду/операцию. Можно складывать до 9 предметов.",
  "wiki.ic2.preview.upgrade_simple_import.desc": "Обновление простого импорта медленно загружает предметы в машину. 1 предмет в секунду/операцию. Можно складывать до 9 предметов.",
  "wiki.ic2.preview.upgrade_slowness.desc": "Улучшение \"Медленность\" действительно редко используется. Оно вдвое снижает скорость производства машины и снижает энергопотребление на 40%",
  "wiki.ic2.preview.upgrade_transformer.desc": "Улучшение \"Трансформер\" повышает максимальный уровень мощности машин, который он может принять.",
  "wiki.ic2.preview.uranium_enricher.desc": "Обогащатель урана — это машина, которая сочетает Уран с экзотическими материалами и 250EU/т для создания очень странных вариантов Урана. Это делает жизнь более интересной.",
  "wiki.ic2.preview.uranium_rod_blaze_single.desc": "Пылающий урановый стержень. Вырабатывает аномальное количество тепла. Полезно для паровых реакторов.",
  "wiki.ic2.preview.uranium_rod_charcoal_single.desc": "Урановый стержень из древесного угля. Долговечное, но медленно производящее топливо. Очень хорошо подходит для долговременных установок.",
  "wiki.ic2.preview.uranium_rod_ender_pearl_single.desc": "Урановый стержень Эндера. Он имеет больший радиус действия в областях, на которые может воздействовать.",
  "wiki.ic2.preview.uranium_rod_isotopic.desc": "Изотопные стержни — это стержни, готовые к повторному обогащению в реакторе.",
  "wiki.ic2.preview.uranium_rod_near_depleted.desc": "Близкие к истощению элементы - это отходы урановых стержней. Можно повторно разжечь до полного урана.",
  "wiki.ic2.preview.uranium_rod_nether_star_single.desc": "Жезл Звезды Пустоты. Производит массу энергии и тепла. Трудно освоить!",
  "wiki.ic2.preview.uranium_rod_re_enriched.desc": "Переобогащенные урановые стержни — это порода урана, которую можно использовать в реакторе.",
  "wiki.ic2.preview.uranium_rod_redstone_single.desc": "Урановый стержень Redstone очень пульсирует. Производит в 2 раза больше изотопов. Работает немного горячее.",
  "wiki.ic2.preview.uranium_rod_single.desc": "Урановый стержень очень простой. Производит мощность по умолчанию. Ничего особенного.",
  "wiki.ic2.preview.uu_crop_library.desc": "Библиотека UU-культур — это обновленная библиотека культур, в которой есть возможность создавать уже известные мутации культур из UU-материи и энергии. Это недешево!",
  "wiki.ic2.preview.uu_expansion.desc": "Расширение Matter позволяет вам более эффективно использовать UU Matter. Оно также предоставляет ресурсы, которые иначе нельзя было бы создать. Можно выбрать из 9.",
  "wiki.ic2.preview.vacuum_canner.desc": "Вакуумная консервная машина — это высокоскоростная консервная машина, которая создает вакуум, чтобы упаковывать больше ресурсов и упаковывать их быстрее. Он использует 16EU/т.",
  "wiki.ic2.preview.valve.desc": "Простой многоцелевой клапан, позволяющий внешнее взаимодействие с баками мультиблоков. Может использоваться с Обскуратором.",
  "wiki.ic2.preview.valve_animated.desc": "Анимированный клапан — это небольшое визуальное обновление клапана. Он показывает поток в резервуар и то, что в него входит.",
  "wiki.ic2.preview.valve_pushing.desc": "Проталкивающий клапан — это модернизация обычного клапана, в котором он автоматически откачивает жидкости. Он также может работать с сеткой труб.",
  "wiki.ic2.preview.valve_teleporting.desc": "Клапан телепортации — это клапан, который соединяет один резервуар с другим с помощью §<redirect;true;Link;ic2:preview.frequency_transmitter>. Гаечный ключ может настроить его на излучение режиме. Выпуск 100 мБ/т своего содержимого в другой резервуар!",
  "wiki.ic2.preview.venomilia.desc": "Веномилия - хитрый фиолетовый цветок. Если вы соберете его слишком поздно, он станет ядовитым и ужалит вас, когда вы пройдете через него или соберете его неосторожно, но это отличный источник Порошка Грина.\nОн ядовит и производит Порошок Грина только тогда, когда он почти полностью выращен.",
  "wiki.ic2.preview.villager_o_mat.desc": "The Villager-O-Mat — это автоматический торговец, который использует кражу личных данных, чтобы торговать от вашего имени! Звучит плохо, но на самом деле это действительно хорошо! Он может массово торговать для вас, как вы! ",
  "wiki.ic2.preview.void_tube.desc": "Труба Пустоты. Пустота.... Пустота.... Пустота.... Да, не говори \"это слово\" слишком часто. Во всяком случае. Оно удаляет входящие предметы, бросая их в пустоту. Пустота... Пустота... Пустота... Чёрт!",
  "wiki.ic2.preview.warped_fungus.desc": "Искаженный гриб — ваш другой гриб, производящий дерево Нижнего мира. Урожай производит грибы, и для роста он должен быть полностью сухим.",
  "wiki.ic2.preview.water_mill.desc": "§lБесплатная энергия воды§r. Выдаёт 0,25EU/т или 1EU/т. Для работы, его нужно погружать в воду... или воду в него? Хм... Стоит попробовать.",
  "wiki.ic2.preview.water_walker_module.desc": "Модуль хождения по воде позволяет вам ходить по воде. Использование электромагнитных полей для стабилизации жидкости под вами. Думаю, по крайней мере...",
  "wiki.ic2.preview.wave_generator.desc": "Мощный генератор, который выдаёт около 16,5EU/т. Для его работы требуется прямая линия в 50 блоков воды перед ним.",
  "wiki.ic2.preview.weedex.desc": "Сорняк-экс - ваша защита от сорняков. Пока в культуре есть сорняк-экс, сорняки не могут появиться. Хотя, если его применить более одного раза, есть вероятность, что статистика снизится .",
  "wiki.ic2.preview.wet_cfoam.desc": "Использовать для копирования текстур, скрытия кабелей/труб или как декорация! Высыхает со временем или мгновенно с помощью песка.",
  "wiki.ic2.preview.wheat.desc": "Пшеница – это стандартная пшеница, для выращивания которой требуется уровень освещенности 9 или выше. Она также может давать семена.",
  "wiki.ic2.preview.white_tulip.desc": "Белый тюльпан является частью семейства цветов. Поэтому применяются цветочные условия. Он производит не белый, а светло-серый краситель.",
  "wiki.ic2.preview.wide_band_booster_pad_upgrade.desc": "Широкополосное обновление позволяет зарядной панели заряжать всю панель быстрого доступа, а не только удерживаемый предмет.",
  "wiki.ic2.preview.wind_turbine.desc": "§lБесплатная энергия воздуха§r. Выдаёт до 16EU/т, в зависимости от сылы ветра. И да, свободное пространство важнее, чем высота.",
  "wiki.ic2.preview.windmill.desc": "Продвинутая ветряная турбина. Требует роторы. Выдаёт до 256EU/т в зависимоти от скорости ветра.",
  "wiki.ic2.preview.wood_gassifier.desc": "Гассификатор древесины — это машина, которая сжигает топливо и использует древесный уголь и древесный газ для производства дополнительной энергии в генераторе жидкого топлива.",
  "wiki.ic2.preview.wrench.desc": "Гаечный ключ — это ваш инструмент, позволяющий избавиться от машин, не теряя их. Но он не идеален, поэтому все равно может терять машины. Всем нравится эта функция! Верно?",
  "wiki.ic2.subpage.brewing.body": "Таким образом, неделя равняется 10 годам.\nПри заклеивании бочки количество лет округляется в меньшую сторону до ближайшего шага варки.\nТак что этот не может испортиться.§<newPage>§<header;Potion Brewing;true>\nPotion Brewing тоже довольно просто.\n\nОн работает как обычная подставка для зелий, но вместо того, чтобы варить 1 шаг за раз.\nВы используете ингредиенты, чтобы настроить то, что хотите сделать, а затем позволяете ему массово обрабатывать все шаги одновременно.\n\n\n\n\nНапример, для зелья сопротивления огню вы добавляете:\nНаросты Пустоты, Сливки магмы и воду.\nЗатем вода начинает вариться.\n\nЗаранее вы можете добавить до 20 единиц красного или светящегося камня. \n- §lКрасный камень§r: Увеличение времени действия зелья. До 30 минут.\n\n\n- §lСветящийся камень§r: усиление действия зелья. До 3-го уровня.\n\nХотя имейте в виду, что каждый дополнительный уровень снижает продолжительность вдвое.",
  "wiki.ic2.subpage.brewing.head": "Варка",
  "wiki.ic2.subpage.chunkloader.body": "Загрузчик фрагментов прост в использовании, но требует питания для запуска.\n\nОн поставляется с 4 различными настройками диапазона:\n\n§l0§r:Локальный фрагмент: 5EU/t\n§l1§r:Локальный фрагмент + 1 радиус фрагмента:15EU/t\n§l2§r:Локальный фрагмент + 2 фрагмента радиуса:60EU/t\n§l3§r:Локальный фрагмент + 3 радиуса фрагмента :300EU/т",
  "wiki.ic2.subpage.chunkloader.body2": "Загрузчик фрагментов сохраняет все объекты и тайловые объекты, загруженные в области.\n\nТогда есть возможность включить 'Chunk Ticks'.\n\nЧто включит случайный ставит галочки внутри кусков, поэтому такие вещи, как урожай, могут расти.\nОднако затраты в ЕС/т удваиваются.",
  "wiki.ic2.subpage.chunkloader.head": "Загрузчик фрагментов",
  "wiki.ic2.subpage.colossal_machine.body": "Колоссальная машина — это динамическая машина, которую можно построить как структуру 2x2x2, 3x3x3 или 4x4x4.\n\nМастер-блок находится в левом верхнем углу в зависимости от лица. \n\nКаждое обновление удваивает емкость слотов по сравнению с предыдущим. Оно потребляет 25 МБ воды за операцию и производит пар в качестве побочного продукта.",
  "wiki.ic2.subpage.colossal_machine.compressor": "Колоссальный компрессор",
  "wiki.ic2.subpage.colossal_machine.extractor": "Колоссальный экстрактор",
  "wiki.ic2.subpage.colossal_machine.furnace": "Колоссальная печь",
  "wiki.ic2.subpage.colossal_machine.macerator": "Колоссальный измельчитель",
  "wiki.ic2.subpage.colossal_machine.recycler": "Колоссальный переработчик",
  "wiki.ic2.subpage.crop.body": "IC2Classic поставляется с системой урожая.\nВы можете выращивать, скрещивать и собирать урожай по своему желанию.\n\nВ отличие от его ванильной части, урожай IC2 не зависит от случайного Система тиков Minecraft.\nНо у них постоянный тикрейт.§<newPage>§<header;Crop Stat;true>\nУрожаи растут каждые 256 тиков (12,8 с).\nНасколько зависит от множества факторов и немного случайности.\n\nКультуры IC2 также можно размещать под водой.\nХотя некоторые культуры могут или не могут пережить подводную обработку.\nВ то время как другие не любят свежий воздух.§<newPage>§<header;Crop Stats; true>\nИтак, какие характеристики у культур на самом деле? Скорость роста\n– §lПолучение§r: дополнительная доходность\n– §lСопротивление§r:Повышает защиту\n\nВсе эти 3 характеристики могут находиться в диапазоне от 0 до 31, чем выше статистика, тем больше внимания нужно урожаю.§<newPage>§<header;Stat Warning;true>\nВаша главная цель – повысить статистику, но держите их ниже 24.\nЕсли вы превысите 24 для каждой характеристики, есть серьезный недостаток, который может разрушить ваше поле урожая.\nКроме того, если характеристики слишком высоки, а уход недостаточен, урожай также может погибнуть от голода.\nПоэтому, если вы выращиваете более высокие характеристики, следите за тем, чтобы урожай действительно мог расти без дополнительного ухода.§<newPage>§<header;Статистика роста;true>\n§lСтатистика роста§r увеличивает скорость роста урожая.\nЭто означает, что каждая культура отметьте, что рост увеличивается намного больше, чем без высокого показателя.\n\nКогда показатель достигает уровня 24, урожай становится \"Похожим на сорняки\".\nХотя он не будет самоуничтожаться, он будет атаковать другие культуры, которые не являются \"подобными сорнякам\".§<newPage>§<header;Gain Stat;true>\n§lGain Stat§r увеличивает урожайность.\nЭто может быть массивным при ручном сборе урожая, когда несколько культур могут давать стопки капель.\nАвтоматизированный сбор урожая не даст такого значительного увеличения урожайности, но все же существенно увеличит урожайность.\n\nКогда показатель достигнет 24 или выше, это уменьшит вероятность получения дополнительных семян. Bags.§<newPage>§<header;Статистика сопротивления;true>\nСтатистика §lСтатистика сопротивления§r увеличивает силу против сорняков.\nНа уровне 31 она больше не может быть захвачена сорняками.\n\nНо когда стат падает выше 28 уменьшает вероятность участия в скрещивании. §<newPage>§<header;Crop Boosters;true>\nНа урожай влияет Окружающая среда §<image;ic2:textures/wiki/crops/environment.png;33;20;78>\n§<padding;2>\nЭти 3 характеристики значительно повышают скорость роста урожая и гарантируют, что он не погибнет от голода.\nКаждый биом имеет несколько преимуществ/недостатков в зависимости от того, где вы находитесь.§ <newPage>§<header;Crop Boosters;true>\nНапример, в Нижнем мире ужасна влажность, в то время как океаны творят с ней чудеса.\n\nПрактическое правило: чем выше, тем лучше.§<newPage>§<header ;Питательные вещества / Влажность;true>\nПитательные вещества и влажность зависят от сельскохозяйственных угодий / подпочвы под ними.\nКаждый из них может быть повышен в зависимости от биома, в котором они находятся, или с помощью удобрений или увлажнения.§<newPage>§<header; Окружающая среда;true>\nПолям также нужна здоровая среда, чтобы расти быстрее.\nСуществует 3 фактора, повышающих качество среды.\n- §lДоступ к световому люку§r\n- §lПространство§r: отсутствие сплошных блоков или посевов вокруг себя.\n- §lВысота§r: До определенного момента более высокие высоты помогают улучшить качество окружающей среды.§<newPage>§<header;Подводная среда;true>\nПодводным культурам также нужна хорошая среда.\nЧто немного его сложнее создать.\nЕсть несколько способов увеличить его.\n– §lГлина§r: Наличие глины в окружающей почве немного увеличивает ее.\n– §lОчищение посевов§r: Некоторые растения очищают воду вокруг себя.\n- §lПузырьковые столбцы§r: обеспечивает приятную среду.§<newPage>§<header;Селекция культур;true>\nСелекция культур — это сердце системы растениеводства.\n\nИ это может быть довольно прямолинейно.\nПоместите 2 -4 урожая вокруг палочки, на которой вы хотите размножаться, и поместите на нее еще один набор палочек.\nВы не можете гарантировать, что в процессе размножения будет использовано более 2 культур, но по крайней мере 2 будут использованы.§<newPage> §<заголовок;Растениеводство;true>\n*Утерянный фрагмент* защищает ваши посевы от уничтожения сорняками.\nНо при всем хорошем, чрезмерное использование может повредить посевы. В частности, статистика.\nИтак, эмпирическое правило таково: используйте его только один раз или когда список сорняков почти пуст.§<newPage>§<header;Crop Analyzer;true>\nВы можете сканировать посевы скрытно. Щелкнув по нему с помощью §<перенаправления ;true;Crop Analyzer;ic2:preview.crop_analyzer>\n\nВ целом, когда на панели быстрого доступа есть анализатор урожая, в One Probe для вас отображается гораздо больше информации!§<newPage>§<header;Farmland / Subsoil! ;правда>",
  "wiki.ic2.subpage.crop.breeding": "Так как же работает разведение? Это довольно просто! Почти каждое комбо может привести к чему угодно§<newPage>§<header;Crop Breeding;true>\nНо как определяется результат?\n\nОно основано на системе баллов.\nОчки начисляются в зависимости от того, сколько признаков объединяет культура или насколько близки черты по отношению друг к другу.\nСумма этих очков рассчитывается вместе со всеми родительскими культурами, а затем случайным образом выбирается одна из них.\nОднако с 1 переопределением. Если исходная культура равна той культуре, которую можно было собрать, она получает фиксированный положительный эффект на 500 очков.\nЧто делает это гораздо более вероятным.\n\n §<redirect;true;Crop Analyzer;ic2:preview.crop_analyzer> может имитировать примеры и показать потенциальные результаты.\n\nПомимо этого, это случайная удача, что выбрано.§<newPage>§<header;Stat Breeding;true>\nТеперь всякий раз, когда вы выращиваете урожай, он также меняет статистику.\nКак это делается также довольно просто.\n\nОн берет сумму родительских характеристик, каждой характеристики в отдельности, и делит ее на количество родительских элементов.\nЭто ваша средняя характеристика.§<newPage>§<header;Stat Breeding;true>\nЗатем некоторые добавлена ​​флуктуация, когда случайным образом применяются 2 очка характеристик в любом направлении для каждого присутствующего родителя.\nТаким образом, вы можете потерять или получить статистику с помощью селекции культур.§<newPage>§<header;Crop Copying;true>\nТеперь можно получить большое количество семян это действительно сложно и раздражает.\nТаким образом, вы можете довольно просто копировать урожай.\n\nВ основном, если у палочки для размножения есть только 1 возможный родитель для размножения, вместо этого будет клонироваться родительская культура.\nНикакие характеристики не меняются, никакая культура не меняет прямой клон.§<newPage>§<header;Weed Ex;true>\n§<redirect;true;Weed Ex;ic2:preview.weed_ex> защищает ваши культуры от уничтожения сорняками.\nНо со всем хорошим, чрезмерное использование может повредить урожаю. В частности, статистика.\nИтак, эмпирическое правило таково: используйте его только один раз или когда список сорняков почти пуст.§<newPage>§<header;Crop Analyzer;true>\nВы можете сканировать посевы скрытно. Щелкнув по нему с помощью §<перенаправления ;true;Crop Analyzer;ic2:preview.crop_analyzer>\n\nВ целом, когда на панели быстрого доступа есть анализатор урожая, в One Probe для вас отображается гораздо больше информации!§<newPage>§<header;Farmland / Subsoil! ;правда>",
  "wiki.ic2.subpage.crop.head": "Культуры",
  "wiki.ic2.subpage.crop.subsoil": "Так что же такое сельхозугодья и недра?§<newPage>§<header;Farmland / Subsoil;true>\nБлок сельхозугодий — это блок, расположенный непосредственно под урожаем,\nв то время как Subsoil блок — это 3 блока непосредственно под сельхозугодьями.\nВы можете выполнить поиск через JEI после \"Farmland\" или \"SubSoil\" и найти все блоки, которые считаются таковыми.\n\nНекоторые культуры требуют специальных блоков.\nЭти находятся на 1 блок ниже Недр.",
  "wiki.ic2.subpage.crop_analyzer.body": "Анализатор урожая — это ваш мобильный инструмент для анализа урожая.\n\nВы можете либо щелкнуть по урожаю, чтобы отсканировать его, пока он посажен, либо бросить предмет в его внутренний инвентарь для сканирования.\nКаждое полное сканирование занимает 10 000 EU. Это делается с помощью нескольких шагов, каждый из которых удаляет часть данных.\n\nКроме того, анализатор урожая можно переключить в режим размножения, который позволяет имитировать выращивание сельскохозяйственных культур.\n\n\nВ верхней части графического интерфейса вы выбираете культуры, которые хотите использовать, а затем нажимаете кнопку «Выращивание».\nПоявятся результаты того, что потенциально может получиться.\nМелкий Caviat для добавления: только 2 культуры полностью точны, потому что у вас нет реального контроля над тем, сколько культур будет включено в результат селекции.\nПоскольку это случайно, какая культура желает размножаться.",
  "wiki.ic2.subpage.crop_analyzer.head": "Анализатор урожая",
  "wiki.ic2.subpage.crop_harvester.body": "Комбайн для сбора урожая — это ваш способ автоматического сбора урожая IC2.\n\nОн автоматически собирает урожай, когда он полностью вырастет. Обратите внимание, что это приведет к меньшему количеству продукции по сравнению с ручным сбором урожая. .\nЕго диапазон может быть от 3x3x3 до 11x11x11 с использованием улучшений Field Expansion. Машина находится в центре этой кубической коробки.\n\nЕго также можно модернизировать с помощью Overclockers, чтобы он мог собирать урожай намного быстрее.",
  "wiki.ic2.subpage.crop_harvester.head": "Урожай урожая",
  "wiki.ic2.subpage.crop_library.body": "Библиотека культур является значительным обновлением по сравнению с ее простым аналогом.\n\nОна имеет неограниченное количество типов культур и хранилище мутаций, но для доступа и изменения требуется EU.\nЭто занимает пассивный слив примерно 1EU, чтобы иметь возможность увидеть урожай, и 5 EU, чтобы вставить урожай любого размера.\nКак и другие части, он принимает только полностью проанализированные семена.\nХотя его реальный недостаток заключается в том, что весь урожай будет потерян, если вы сломаете библиотеку. Так что обязательно очистите его перед перемещением.\n\nЭто цена за неограниченное хранилище",
  "wiki.ic2.subpage.crop_library.head": "Библиотека обрезки",
  "wiki.ic2.subpage.cropmatron.body": "Cropmatron — это инструмент, который вам нужен для ваших культур IC2.\n\nОн автоматизирует применение гидратации/удобрения/прополки ваших культур.\nХотя он не так эффективен в том, как сколько вы получите от этих предметов с течением времени, в целом оно того стоит.\nЕго полное покрытие 9x5x9, которое должно быть в центре.\n\nВода может быть закачана в Cropmatron, чтобы дать машине 2 реальных преимущества. \nВо-первых, Cropmatron становится заболоченным и следит за тем, чтобы сельскохозяйственные угодья оставались влажными в течение 1 мБ воды за тик.\nВо-вторых, он автоматически пополняет ячейки гидратации, используя воду из резервуара Cropmatron.",
  "wiki.ic2.subpage.cropmatron.head": "Кропматрон",
  "wiki.ic2.subpage.early_game.body": "Итак, вы завершили свои поездки по сбору ресурсов, возможно, даже умерли примерно +10 раз по пути,\nи чувствуете, что готовы погрузиться в мод IC2.\n\nВозможно, вы уже создали каменные машины для более эффективной обработки ваших руд.§<newPage>§<header;С чего начать?;true>\nОбычное погружение в IC2Classic начинается со следующих вещей:\n- §<redirect;true;Generator;ic2:preview.generator> \n- §<redirect;true;Extractor;ic2:preview.extractor> \n- §<redirect;true;Macerator;ic2:preview.macerator> \n- §<redirect;true;Электропечь ;ic2:preview.electric_furnace> \n- §<redirect;true;Кабели;ic2:preview.copper_cable_item> \nИдеальная установка может выглядеть следующим образом:§<image;ic2:textures/wiki/early_setup.png;60;5 ;108>§<newPage>§<header;Ideal Setup;true>\nХотя это идеальная установка, она не идеальна.\nПоскольку генератор не экономит топливо эффективно,\na §<redirect;true;Batbox;ic2:preview.batbox> может быть хорошим дополнением.\nУчет лучшая топливная экономичность.§<image;ic2:textures/wiki/early_setup_storage.png;60;5;108>§<newPage>§<header;Ideal Setup;true>\nС помощью небольшой настройки вы можете более эффективно использовать свои ресурсы. \nИзмельчитель/экстрактор обеспечивает более высокий выход ресурсов,\nв то время как генератор/электропечь делает топливо более эффективным.\n\nНа следующей странице вы найдете список блестящих вещей, которые могут вас заинтересовать.§<newPage>§ <header;Блестящие мишени!;true>\nПозволяет повысить эффективность использования топлива.§<image;ic2:textures/wiki/early_setup_storage.png;60;5;108>§<newPage>§<header;Ideal Setup;true>\nС помощью небольшой настройки вы можете обрабатывать свои ресурсы более эффективно.\nИзмельчитель/экстрактор обеспечивает более высокий выход ресурсов,\nв то время как генератор/электропечь делает топливо более эффективным.\n\nНа следующей странице вы найдете список блестящих вещей, которые могут вас заинтересовать.§< newPage>§<header;Блестящие мишени!;true>\nПозволяет повысить эффективность использования топлива.§<image;ic2:textures/wiki/early_setup_storage.png;60;5;108>§<newPage>§<header;Ideal Setup;true>\nС помощью небольшой настройки вы можете обрабатывать свои ресурсы более эффективно.\nИзмельчитель/экстрактор обеспечивает более высокий выход ресурсов,\nв то время как генератор/электропечь делает топливо более эффективным.\n\nНа следующей странице вы найдете список блестящих вещей, которые могут вас заинтересовать.§< newPage>§<header;Блестящие мишени!;true>\n\nНа следующей странице вы найдете список блестящих вещей, которые могут вас заинтересовать.§<newPage>§<header;Shiny Targets!;true>\n\nНа следующей странице вы найдете список блестящих вещей, которые могут вас заинтересовать.§<newPage>§<header;Shiny Targets!;true>",
  "wiki.ic2.subpage.early_game.head": "Ранняя игра",
  "wiki.ic2.subpage.early_game.list": "Этот список содержит цели, к которым вы можете перейти.§<newPage>§<header;Shiny Tools!;true>\n- The §<redirect;true;Wrench;ic2:preview.wrench> позволяет вам собирать машины, не уничтожая их, большую часть времени.\n- §<redirect;true;Mining Drill;ic2:preview.drill> дает вам доступ к бесконечной кирке, пока вы подпитайте его силой.\n– §<redirect;true;Бензопила;ic2:preview.chainsaw> – ваше любимое оружие?!!!!!\n– §<redirect;true;Косилка;ic2:preview. mowing_tool> избавляется от всех этих надоедливых ЛИСТЬЕВ!\n- И §<redirect;true;Toolbox;ic2:preview.tool_box> хранит все ваши инструменты.",
  "wiki.ic2.subpage.electric_enchanter.body": "Электрический зачарователь представляет собой сплав стола для зачарования, наковальни, распылителя и Силы ЕС!\n\nЭто единственный способ зачаровать электрические инструменты ЕС.\nНо в целом это также действительно мощный зачарователь. \n\nУ Enchanter есть несколько режимов.§<newPage>§<header;Режим зачарования;true>\nРежим зачарования — это, по сути, ваша обычная таблица зачарования\nно вместо случайного броска он показывает вам именно то, что вы получите\nи он использует EU для снижения требуемой стоимости XP.\n\nЗачарованные инструменты также могут быть переработаны с ним по более высокой цене, чем обычное зачарование.\nЯчейки для книг вверху определяют, сколько зачарований вы получите и насколько они сильны.\nЕсли внутри этих слотов есть зачарованные книги, они будут иметь приоритет, а остальные будут применены позже.\nВы получаете 2 чар на каждый слот для книг. Если есть достаточно чар на выбор.\nЛазурит также требуется.§<newPage>§<header;Режим наковальни;true>\nРежим наковальни — это ваша классическая наковальня, только со сниженной стоимостью XP и возможностью зачаровывать электрические предметы.\nТакие предметы, как §<redirect;true;Mining Laser;ic2:preview.mining_laser>, могут быть действительно полезными, поскольку чары будут работать и в §<redirect;true;Miner;ic2:preview.miner>.\nХотя сам по себе добывающий лазер не будет работать напрямую с чарами.§<newPage>§<header;Режим распыления;true>\nРежим распыления тоже очень прост.\nПоместите предмет для распыления в центральный слот.\nДайте книги и опыт\nВЫИГРАЙТЕ !\n\nи он берет верхнее зачарование указанного предмета и перемещает его в специальную книгу.",
  "wiki.ic2.subpage.electric_enchanter.head": "Электрический зачарователь",
  "wiki.ic2.subpage.electricity.body": "IC2Classic имеет форму электричества под названием EU. (Энергетические единицы)\n\nЭУ создается в генераторах и перемещается по кабелям к машинам, которые вы хотите запустить. Это то, что питает весь мод.\n\nЭУ — очень простая форма силы, но она не позволяет вам ослабить бдительность.\nДавайте начнем с генераторов.§<newPage>§<header;Генераторы;true >\nГенераторы довольно просты.\nОни используют топливо и производят энергию.\nОбычный генератор, например, производит 10EU/такт.\nЭта энергия затем автоматически выпускается в виде пакета энергии.\n\nЧто такое пакет энергии?\nЭто получает объяснено позже.§<newPage>§<header;Electric Machines;true>\nЭлектрические машины — это вещи, которые используют EU для работы.\nНапример, Измельчитель (Машина) использует энергию, чтобы превратить булыжник в песок.\n\nМашина может принимать энергию в зависимости от уровня.\nВ нашем примере Macerator он может принимать 32EU за пакет.§<newPage>§<header;Electric Machines;true>\nЧто произойдет, если вы поместите 40EU за пакет в Macerator?\nЭто § lEXPLODE§r.\n\nПоэтому при работе с машинами убедитесь, какую мощность они могут принять на один пакет.§<newPage>§<header;Energy Packets?;true>\n§<reset_header>\nХорошо, а что? на самом деле энергетический пакет?\nЭто довольно просто.\nЭто коробка, наполненная энергией, которую вы отправляете по почте. Это занимает некоторое время, но в конце концов это приходит.\n\nХорошо, шутки в сторону.\nДа, вы можете думать, что энергетический пакет - это коробка, и сама сила определяет, насколько велика эта коробка.\n\nТаким образом, машины могут принимать только коробки вверх до определенного размера, но бесконечное количество ящиков, пока не заполнится.\n\nНет, машина не взорвется, если она заполнена, и вы пытаетесь вставить больше ящиков силы.§<image;ic2:textures/wiki/packet.png;80>§<newPage>§<header;Cables;true>\nКабели — это ваш транспорт этих воображаемых блоков энергии.\nКак и у машин, у них есть предел мощности, которую они могут передавать.\n\nМедь Кабели, например, имеют предел передачи 32EU/пакет.\nНо они могут передавать бесконечное количество пакетов.\n\nХотя, поскольку вы пытаетесь протолкнуть энергию через металл, для этого есть некоторые потери.\nВ нашем примере с медью . Он теряет 0,2 EU за каждый блок, через который вы пытаетесь протолкнуть энергию.\n\nДля облегчения игры проигрыш округляется в меньшую сторону. Это означает, что пока вы не достигнете 1,0, вы не потеряете мощность.\nЭто означает, что вы хотите, чтобы расстояния были короткими, или учитывали это.\nОбратите внимание, что потери относятся к каждому пакету отдельно.\n\nТакже убедитесь, что вы держите кабели изолированными, иначе вы можете получите шокирующий опыт, если подойдете к ним.§<newPage>§<header;Transformers;true>\nТеперь здесь есть вопиющая проблема.\nЧто делать, если мой источник питания слишком высок для моей машины?\nНужно ли мне строить новый?\n\nЗдесь в игру вступают преобразователи.\nОни могут принимать пакеты более высокого уровня и преобразовывать их в пакеты более низкого уровня.§<newPage>§<header;Transformers;true>\n§<image;ic2:textures/wiki/transformer.png;50>\n§<padding;3>\nНа этом изображении показано, как 1x 128EU поступает на преобразователь и выходит в виде 4x 32EU пакетов.\nПозволение понижать пакеты и защищать сеть более слабых машин .\nКрасный камень может инвертировать поток энергии.§<newPage>§<header;EU-Reader;true>\nВся эта информация полезна, но вся эта информация скрыта и не видна.\n\nТеперь §<redirect;true;EU-Reader;ic2:preview.eu_reader> меняет это.\nНаличие EU-Reader на панели быстрого доступа включает всплывающие подсказки к элементам, которые позволяют вам видеть точную статистику указанных генераторов/кабелей/машин.§< newPage>§<header;Directional Power;true>\nБольшинство источников энергии излучают свою энергию во всех 6 направлениях.\nНо есть несколько источников, направленных по своей природе.§<image;ic2:textures/wiki/directional.png;45>§<newPage>§<header;Directional Power;true>\nПрактическое правило:\n- Одна точка является §lВыходом§r\n- а §lВходом§r не является ни одна точка или 3 точки. n\nНебольшое примечание:\nЦвета точек показывают, какая мощность будет на их стороне, в зависимости от соответствующих кабелей§<newPage>§<header;Grid Splitting;true>\nТеперь есть еще одна проблема, с которой вы можете столкнуться. или, возможно, не столкнулись.\nНо что произойдет, если вам нужно проложить кабели очень близко друг к другу и вы не хотите, чтобы они соединялись?\n\nУ вас есть 2 решения этой проблемы:\n- 1: Сдаться. \n- 2: Сделать больше§<newPage>§<header;Painters;true >\nШутки в сторону. Вариант 1: §<redirect;true;Painters;ic2:preview.painter> §<image;ic2:textures/wiki/color_blocking.png;45>\n§<padding;5>\nОкрашенные кабели не подключаются к другие кабели, если они разного цвета.§<newPage>§<header;Mining Pipes;true>\nВаш второй вариант — майнинговые трубы: §<image;ic2:textures/wiki/mining_blocking.png;45>\n§<padding ;5>\nГорнодобывающие трубы могут быть размещены на кабелях и действовать как анкеры / заглушки, поэтому кабели не будут соединяться друг с другом.\n\nКроме того, что удерживающие горные трубы показывают это болезненное наложение.",
  "wiki.ic2.subpage.electricity.head": "Электричество",
  "wiki.ic2.subpage.electrolyzer.body": "Электроилзер — это машина, которая напрямую черпает энергию из накопителей энергии.\n\nХотя ему нужно прикасаться к накопителю энергии, для работы ему не нужно подключаться к выходу. \n\nОн потребляет 1/4 от выходной мощности накопителей энергии.§<newPage>§<header;Рецепты;true>\nЭлектролизер имеет 2 режима рецептов:\n- §lЗарядка§r: Когда запас составляет 70% или более полным.\n– §lОсвобождение§r: Когда хранилище заполнено на 30 % или менее.\n\nРецепты сами могут решать, какие режимы работают с ними.\nКогда в рецепте написано \"Двойной\", это означает, что он работает с оба.",
  "wiki.ic2.subpage.electrolyzer.head": "Электролизер",
  "wiki.ic2.subpage.first_day.body": "Итак, вы начали свой первый день,\nи хотите знать, как начать IC2Classic.\n\nВаша первая цель — собрать ресурсы.\nИтак, ваше прохождение начинается так же, как и любое другое. \n\nВы идете на добычу/разведку и собираете ресурсы.\nПорядок на самом деле не важен.§<newPage>§<header;Ores;true>\nВо время вашей первой добычи вы хотите избежать смерти,\nи найти следующие руды:\n- Уголь\n- Железо\n- Медь\n- Олово\n- Красный камень\n\nУголь/Железо/Медь и Олово можно найти довольно высоко,\nв то время как для красного камня нужно копать довольно глубоко .§<newPage>§<header;Исследование;true>\nВаша цель исследования — найти эти деревья: §<image;ic2:textures/wiki/rubber_tree.png;130>\nОни называются §lРезиновые деревья.§r\nИх можно найти в:\n- Лесах\n- Болотах\n- Биомах джунглей.\nИх источниками являются болота.\nНо, как всегда, будьте любезны выбраться из их болота.\n\nНайдя их, вы захотите собрать их смолу и собрать саженцы для своего дома.§<newPage>§<header;Resin Collection;true>\nКак только у вас будет немного каучуковые деревья, смолу которых вы хотите собрать с помощью древоточца.\n\nНа каучуковых деревьях есть пятна смолы, которые вы можете использовать для получения смолы.\nПосле нажатия правой кнопкой мыши с помощью древоточца они будут медленно расти заново.\nПросто сделайте следите за тем, чтобы не пережать их, иначе пятно смолы перестанет существовать.§<newPage>§<header;Полезные элементы;true>\n\nНа каучуковых деревьях есть эти пятна смолы, которые вы можете нажать для получения смолы.\nПосле нажатия, щелкнув их правой кнопкой мыши с помощью Treetap, они будут медленно расти заново.\nПросто следите за тем, чтобы не переборщить с ними, иначе пятно смолы перестанет существовать. .§<newPage>§<header;Полезные элементы;true>\n\nНа каучуковых деревьях есть эти пятна смолы, которые вы можете нажать для получения смолы.\nПосле нажатия, щелкнув их правой кнопкой мыши с помощью Treetap, они будут медленно расти заново.\nПросто следите за тем, чтобы не переборщить с ними, иначе пятно смолы перестанет существовать. .§<newPage>§<header;Полезные элементы;true>",
  "wiki.ic2.subpage.first_day.head": "Первый день",
  "wiki.ic2.subpage.first_day.list": "В этом списке предметов показано несколько вещей, которые вам следует использовать,\nво что вы можете превратиться и т. д.",
  "wiki.ic2.subpage.fisher.body": "Electric Fisher — это ваш конечный игровой способ получить добычу.\n\nДля его работы требуется много энергии, но вы получаете много добычи.\nIt быстрее, чем 64 игрока в сочетании с лучшей добычей.\n\nСтруктура довольно проста, всего лишь небольшая платформа и цепочка вниз.\nДлина цепочки определяет, сколько дополнительной удачи вы получите.\n\nЦепочка должна иметь минимальную длину 5 блоков и максимальный диапазон 10.\n\nПлатформа может быть сделана из любой доски / бревна, а контейнер над рыбаком должен иметь как минимум 20 слотов, чтобы быть действительным.",
  "wiki.ic2.subpage.fisher.head": "Электрик Фишер",
  "wiki.ic2.subpage.fourth_tier.body": "Для четвертого уровня вам нужен Iridium\n\nIridium создается с использованием UU-Matter, который создается §<redirect;true;Massfabricator;ic2:preview.mass_fabricator> .\nПревращение энергии и необязательных других ресурсов в UU.\n\nНеобязательные ресурсы являются \"Отходами\", что делает процесс в 7 раз менее энергоемким.§<newPage>§<header;Shiny Dog Treat!;true>\nВ любом случае на данный момент вам больше ничего не нужно.\nВот ваш блестящий список!\n\nПожалуйста, уходите!!!!",
  "wiki.ic2.subpage.fourth_tier.head": "Четвертый уровень",
  "wiki.ic2.subpage.fuel_boiler.body": "Топливный котел является одним из источников генерации энергии на позднем этапе игры.\nЭто многоблочная структура 2x2 из него самого и 3 Структурных Блока.\n\nИспользует Топливные Канистры, чтобы превращать воду в пар. Он эффективнее в 2 раза производит 1024 мБ/т пара, но это происходит только после того, как он нагреется. Во время нагрева потребление топлива в 10 раз больше, чем когда он полностью нагрет.\nЭта топливная эффективность может быть значительно улучшена за счёт эффективного использования топливной канистры, которая представляет собой модульный источник топлива, который может быть довольно ужасным или безумно хорошим.\n\n4 верхних блока этого мультиблока автоматически выдают пар в напрямую подключенные резервуары.\n\nВ отличие от аналогов из других модов, этот котёл не взрывается, если у него заканчивается вода и вы снова наполняете его.",
  "wiki.ic2.subpage.fuel_boiler.head": "Топливный котел",
  "wiki.ic2.subpage.fusion_reactor.body": "Термоядерный реактор представляет собой кубическую структуру 5x5x5, в которой все блоки являются усиленными вариантами. \n\nЭто также ответ на животрепещущий вопрос... сколько лавы достаточно лавы ?\n\nОтвет? Многого не бывает!§<newPage>§<header;The Structure;true>\nКаркас и пол из любого армированного камня,\nостальное из любого армированного стекло.\n\nКлапаны могут быть вставлены в точку конструкции.§<newPage>§<header;Как запустить;true>\nКак работает термоядерный реактор?\nБросьте в него до 6 урановых стержней и плавкий блок.\nРазличные типы урана имеют свою собственную производительность.\n\nИмейте в виду, что стоимость нагрева высока, но после нагрева это делает топливо довольно эффективным.",
  "wiki.ic2.subpage.fusion_reactor.head": "Термоядерный реактор",
  "wiki.ic2.subpage.gui.body": "IC2Classic имеет разнообразный набор функций графического интерфейса, призванных помочь вам в прохождении игры.\n\nДавайте начнем с трех наиболее распространенных кнопок.§<image;ic2:textures/wiki/gui/buttons.png;30;42; 34.56>\n§<padding;5>\n- §lI§r: Настройки инвентаря\n- §lC§r: Настройки компаратора\n- §lS§r: Информация о слоте\n\nЭти настройки доступны в каждая машина с графическим интерфейсом.\nЭто замена \"Machine Tool\", которая присутствовала в предыдущих версиях мода.\n\nИ да, я просто дополняю текст, чтобы следующая информация могла быть на двойная страница!\n\nВы поймете, почему я это делаю, когда перелистнете!§<newPage>§<header;Настройки инвентаря;true>\n§<image;ic2:textures/wiki/gui/machine.png;74>\n§<padding;5>\nУправление доступом к машине позволяет установить параметры инвентаризации для всей машины / слотов\nПо умолчанию выбраны настройки машины.§<newPage>§<header;The Controls;true>\n - §lСиний§r: Буквы DUNSWE обозначают каждую сторону, которую вы хотите настроить.\n- §lКрасный§r: Эти кнопки-переключатели позволяют u, чтобы включить/отключить, если сторона доступна.\n- §lГолубой§r: 4 кнопки состояния позволяют вам решить, будет ли сторона Обе, Только вставка, Только экспорт или Отключена.\n- §lСброс§r: Просто сбрасывает настройки по умолчанию для всей машины.\n- §lЗеленая§r: 2 кнопки предназначены только для настроек машины, которые используются только на некоторых машинах.\n - §lЛевая кнопка§r: позволяет использовать только 1 элемент каждого типа. для вставки в видимый инвентарь (для этой конкретной стороны)\n - §lПравая кнопка§r: позволяет вставить в видимый инвентарь только 1 стопку (для этой конкретной стороны)\n \n- §lСлоты инвентаря§ r: позволяет вставлять обновления инвентаря, чтобы вы могли фильтровать, какие и сколько предметов разрешено, а какие нет.§<image;ic2:textures/wiki/gui/machine_selected.png;60;10;98>\n §<padding;5>\nТакже вы можете нажимать на слоты и задавать настройки для них!§<newPage>§<header;Элементы управления компаратором;true>\n§<image;ic2:textures/wiki/gui/comparator.png;74>\n§<padding;5>\nНастройки компаратора позволяют модифицировать спроектируйте свой вывод Comparator.§<newPage>§<header;Comparator Controls;true>\n- Раздел §lСиний§r позволяет вам выбрать, какой выход компаратора вы хотите изменить.\nV => Ванильный компаратор,\nв то время как все остальное относится к расширенному компаратору.\n- Раздел §lЗеленый§r содержит исходники. для выходного сигнала, который вы можете выбрать.\nПоказ в реальном времени, какой выходной сигнал они могут предоставить.\n\n- В разделе §lКрасный§r рассчитывается выходной сигнал вашего компаратора. число — это то, что будет фактическим выводом.\nЭто связано с 3 кнопками, которые обрабатываются слева направо.\n§lФакторы§r инвертируют сигнал.§<newPage>§<header;Comparator Controls;true> \nв то время как §lRepeater§r подписывает его либо 0, либо 15, если он включен.\nОкончательный вывод затем рассчитывается на основе того, что говорит кнопка \"Селектор\".\nПо умолчанию это будет делать §l\"Мин\" §r, но §l\"Max\"§r и §l\"Среднее\"§r являются вариантами. Будут учтены все предоставленные источники.\n\nПросто нажмите на источник, чтобы добавить или удалить его.§<newPage>§<header;Что входит в этот слот?;true>\nЧасто вы спрашиваете себя, что входит в этот слот машины?§<image;ic2:textures/wiki/gui/inventory_selected.png;74>\n§<padding;5>\nИнформация о фильтре слотов в основном делает именно это!\nПоказывает, что находится в каждом слоте.\nПросто нажмите на кнопку §l\"S\"§r и нажмите на любой слот в инвентаре, на который вы нажали.\nИ он точно показывает, что в него входит.\n\nЕсли список немного длинный, есть также панель поиска!\nСпасибо, что Дейнара предложила эту идею! §<newPage>§<header;Slot Filter Selector;true>\nИнформация о фильтре слота также имеет другие утилиты.\nЗнаете, как вам нужен предмет для установки фильтра?\nДаже если он не используется?\n\nЯ точно знаю, о чем вы думаете!\nИ да, вы правы!§<newPage>§<header;Slot Filter Selector;true>\n§<image;ic2:textures/wiki/gui/item_selector.png;74>\n§<padding;5>\nКогда слот - это фильтр. Вы можете просто нажать на этот слот, чтобы выбрать свой фильтр.\nОн даже проверяет, какой элемент является допустимым вводом. Так что не надо гадать!§<newPage>§<header;Подсказки к элементам;true>\n§<image;ic2:textures/wiki/gui/tooltip.png;18>\n§<padding;5>\nЭлементы имеют всплывающие подсказки с привязкой клавиш которые точно говорят вам, что делать.\nИногда привязка клавиш говорит только \"m\", как в этом примере.\nВ большинстве случаев \"Ключ\" сочетается с \"Действием правой кнопки мыши\", если это не разумно понять, что комбинация правого клика невозможна.\nКак и с реактивными ранцами.§<newPage>§<header;Item Inventories;true>\nИ последняя функция, которую люди не ожидают.\nВы можете открывать инвентарь предметов даже из внутри другого блока.\nИ взаимодействуйте с ним, не вынимая предмет и не используя функцию щелчка правой кнопкой мыши.\n\nЭто уже было сделано с некоторыми другими модами, но это работало только с инвентарями игроков.§<newPage >§<header;Графический интерфейс друзей;true>\nВ IC2Classic есть несколько персонализированных блоков.\nНо иногда вы играете в группе.\nИменно здесь в игру вступает графический интерфейс друзей.\n\nОн открывается нажатием:\n§ <ключ;key.ic2.hud> + §<ключ;key.ic2. toggle> \n\nЗатем вы можете включить, кто является вашим другом, а затем выбрать их и указать определенные разрешения по желанию.",
  "wiki.ic2.subpage.gui.head": "Основы графического интерфейса",
  "wiki.ic2.subpage.industrial_worktable.head": "Промышленный рабочий стол",
  "wiki.ic2.subpage.item_energy.body": "У IC2Classic есть много электроинструментов и портативных накопителей энергии.\nТакже называемые батареями.\n\nЕсть несколько вещей, которые нужно знать о портативных источниках энергии в целом, что важно для гладкое прохождение.§<newPage>§<header;Tools;true>\nКак перезарядить инструменты, не возвращаясь к моему генераторному блоку?\n\nЕсть 2 способа:\n- §lБроня/Реквизит§r: Иметь портативный накопитель энергии в слотах вашей брони или Curio (если он установлен).\n Инструменты автоматически попытаются перезарядиться в тот момент, когда вы их используете.§<newPage>§<header;Инструменты;true>\n- §lItem§r: Щелкните правой кнопкой мыши батарею в своей основной руке.\n В тот момент, когда вы щелкните правой кнопкой мыши батарею в своей руке, она перезарядит все на панели быстрого доступа своей собственной энергией.§<newPage>§<header;Energy Tiers;true>\nПредметы также имеют свой уровень силы.§<image;ic2:textures/wiki/energy_tier.png;40>\n§<padding;5>\nПри попытке зарядить/разрядить аккумулятор/инструмент любого типа зарядное/разрядное устройство должно быть равно или выше уровень энергии.\n\n\nНапример, §<redirect;true;Batbox;ic2:preview.batbox> не может заряжать §<redirect;true;Energy Crystal;ic2:preview.energy_crystal>.\nПоскольку Energy Crystal — это уровень 2, а Batbox — уровень 1.§<newPage>§<header;Charing Benches;true>\n§<redirect;true;Charging Benches;ic2:preview.charging_bench_lv> and §<redirect;true;Battery Stations;ic2:preview.battery_station_lv> может переопределить это.\nПоскольку они являются специализированными блоками для решения подобных задач.\nУровень энергии зарядного/разрядного устройства должен быть равен или выше.\n\n\nНапример, §<redirect;true;Batbox;ic2:preview.batbox> не может заряжать §<redirect;true;Energy Crystal; ic2:preview.energy_crystal>.\nПоскольку энергетический кристалл относится к уровню 2, а Бэтбокс — к уровню 1.§<newPage>§<header;Charing Benches;true>\n§<redirect;true;Charging Benches;ic2:preview. charge_bench_lv> и §<redirect;true;Battery Stations;ic2:preview.battery_station_lv> могут переопределить это.\nПоскольку они являются специализированными блоками для решения подобных задач.",
  "wiki.ic2.subpage.item_energy.head": "Портативная энергия",
  "wiki.ic2.subpage.liquid_generator.body": "Его производство сильно зависит от используемого топлива. В основном принимает 3 разные жидкости.\n\n§lДровяноый Газ§r\n4мВ : 1 тик : 10EU/т \n\n§lБио-Топливо§r\n1мВ : 2 тика : 128EU/т \n\n§lАлкоголь§r\n1мВ : 24 тика : 50EU/т \n\nДровяноый Газ может быть произведён с помощью §<redirect;true;Газификатор Древесины;ic2:preview.wood_gassifier>",
  "wiki.ic2.subpage.liquid_generator.head": "Жидкости для генераторов на жидком топливе",
  "wiki.ic2.subpage.miner.head": "Шахтер",
  "wiki.ic2.subpage.ocean_generator.body": "Океанический генератор проверяет блоки в радиусе 15 во всех направлениях.\n\nДля начало работы, требуется минимум 26 коралловых блоков рядом.\n\nКаждый блок коралла выше 25 увеличивает эффективность на 4%, а каждые 10 блоков воды будут производить 1EU/т",
  "wiki.ic2.subpage.ocean_generator.head": "Океанический генератор",
  "wiki.ic2.subpage.overgrowth_fertilizer.body": "Удобрение Overgrowth — опасный инструмент.\n\nОно дает высокую награду при определенном риске.\nПовышает скорость посева в 256 раз на 5 минут.\nЭто имеет Урожаи растут в 256 раз быстрее, но при этом удобрения и гидратация расходуются в 256 раз быстрее.§<newPage>§<header;Limitations;true>\nПо истечении 5 минут урожай в основном погибает. Он больше не тикает.\nПоэтому, если у вас есть частично выращенный урожай, удачи вам в получении того же урожая. §<newPage>§<header;Revival;true>\nВосстановление удобрения можно использовать, чтобы вернуть его к прежнему поведению, но оба они могут быть использованы только один раз на палке урожая .\nЕсли вы хотите применить его повторно, вам нужно сломать и заменить палочки для обрезки.§<newPage>§<header;Warnings;true>\nОдним действительно жестоким недостатком этого является то, что если сорняк решит когда-либо распространиться на другой побег,\nон также распространит чрезмерный рост, что означает, что вы развяжете ад на своих сельскохозяйственных фермах.§<newPage>§<header;Почему?;true>\nПочему Вы бы когда-нибудь использовали это?\n\nВ контролируемом пространстве это может быть действительно полезным инструментом.\nВыращивание одного урожая может занять несколько часов.\nЭто ускоряет процесс, рискуя потерять то, что вы получили. или потеряете свой урожай, который вы используете для разведения.§<newPage>§<header;Final words;true>\nЕго также можно использовать для массового производства определенных продуктов, которые вы хотите только один раз и не хотите ждать долго. \n\nИмейте в виду, что это опасный инструмент.true>\nЗачем вам это использовать?\n\nВ контролируемом пространстве это может быть действительно полезным инструментом.\nВыращивание одного урожая может занять несколько часов.\nЭто ускоряет процесс с риском потерять так же, как и вы получили его или потеряли свой урожай, который вы используете для разведения вещей.§<newPage>§<header;Final words;true>\nЕго также можно использовать для массового производства определенных продуктов, которые вы хотите только один раз и не хотите ждать долгое время.\n\nИмейте в виду, что это опасный инструмент.§<newPage>§<header;Final words;true>\nЗачем вам это использовать?\n\nВ контролируемом пространстве это может быть действительно полезным инструментом.\nВыращивание одного урожая может занять несколько часов.\nЭто ускоряет процесс с риском потерять так же, как и вы получили его или потеряли свой урожай, который вы используете для разведения вещей.§<newPage>§<header;Final words;true>\nЕго также можно использовать для массового производства определенных продуктов, которые вы хотите только один раз и не хотите ждать долгое время.\n\nИмейте в виду, что это опасный инструмент.\nЕго также можно использовать для массового производства определенных продуктов, которые вы хотите только один раз и не хотите долго ждать.\n\nПоэтому имейте в виду, что это опасный инструмент.\nЕго также можно использовать для массового производства определенных продуктов, которые вы хотите только один раз и не хотите долго ждать.\n\nПоэтому имейте в виду, что это опасный инструмент.",
  "wiki.ic2.subpage.overgrowth_fertilizer.head": "Удобрение для переростков",
  "wiki.ic2.subpage.pressure_alloy_furnace.body": "Печь для сплавов под давлением — это мультиблок, который использует для формирования печь для сплавов под давлением и ее структурные блоки. Это структура 2x2x2, главный блок которой находится в верхнем левом углу на основе лицом.",
  "wiki.ic2.subpage.pressure_alloy_furnace.head": "Печь сплавов под давлением",
  "wiki.ic2.subpage.pump.body": "Насос:\nЭто действительно полезный блок, если вам нужен стабильный источник воды, который не будет случайно удален из-за чрезмерного использования.\nНасос способен только перекачивая жидкость прямо под ним.\n\nДля массовой очистки: пожалуйста, проверьте ваш местный §<redirect;true;Range Pump;ic2:preview.ranged_pump>.§<newPage>§<header;Pump Special Interactions;true> ",
  "wiki.ic2.subpage.pump.compressor": "Насос можно использовать с §<redirect;true;compressor;ic2:preview.compressor> напрямую.§<newPage>§<header;Compressor;true>\nIt будет забирать воду из насосов и превращать ее прямо в снежки!§<newPage>§<header;Miner;true>\nЕсть также специальные взаимодействия с §<redirect;true;Miner;ic2:preview.miner>.\nwhere это поможет шахтеру справиться с жидкостями при контакте с ними.",
  "wiki.ic2.subpage.pump.head": "Насосы",
  "wiki.ic2.subpage.pump.interactions": "Прокачивать специальные взаимодействия",
  "wiki.ic2.subpage.reactor.body": "Ядерный реактор — очень сложный, но также и модульный генератор.\n\nОн использует §<redirect;true;Компоненты реактора;ic2:items.reactor.components> для работы. \nОни заставляют его вырабатывать энергию, пусть взрываются и делают что угодно.\n\nТаким образом, реакторы - это просто пустые оболочки, бесполезные без компонентов!§<newPage>§<header;Reactor Simulation;true>\nПервое, что должно быть известно, что инвентарь реактора обновляется определенным образом.\nПорядок операций сверху слева вниз справа.\n\nИ реактор взрывается, если после обновления последнего компонента тепло превышает максимально допустимое level.§<newPage>§<header;Components;true>\nСуществует несколько типов компонентов.\nОбзор:\n- §<redirect;true;Uranium Rods;ic2:preview.uranium_rods>\n- §<redirect;true;Теплоотводы;ic2:preview.heat_vent> \n- §<redirect;true;Теплообменники;ic2:preview.heat_exchanger> \n- §<redirect;true;Обшивка реактора;ic2: preview.plating> \n- §<redirect;true;Рефлекторы;ic2:preview.reflector> \n- §<redirect;true;Изотопические стержни;ic2:preview.isotopic_rod> \n- §<redirect;true;Конденсаторы; ic2:preview.конденсатор> \n\nНебольшое примечание:\nКомпоненты, если они перегреются, могут сломаться.\nТак что будьте осторожны§<newPage>§<header;Урановые стержни;true>\nУрановые стержни производят энергию, которой вы обладаете интересуются.\nК сожалению, они также вызывают эти надоедливые взрывы, которые все ненавидят...\n\nУран получает бонус к эффективности, если касается другого уранового стержня.\nХотя выход тепла также увеличивается.§<newPage>§<header;Урановые стержни ;true>\nЕсли стерженьt касаясь компонентов, которые могут принять тепло, стержень отдает свое тепло непосредственно в реактор.§<newPage>§<header;Heat Vents;true>\nHeat Vents — это ваше решение для охлаждения реактора.\nОбычно они охлаждают только себя, а другие охлаждают §<newPage>§<header;Heat Vents;true>\nЕсть несколько вариантов:\n- §lHeat Vents§r: \nОсновное решение для охлаждения.\n- §lStream Vents§r: \nПреобразование воды в пар становится более эффективным, чем меньше тепла они могут хранить.\nРаботают только в паровых реакторах.\n- §lЭлектрические вентиляционные отверстия§r:\nНемного сократите производство в ЕС, чтобы добиться двойного охлаждения.§<newPage>§<header; Теплообменники;true>\nТеплообменники обмениваются теплом между компонентами и иногда между реактором.\nОни помогают сбалансировать тепло, чтобы ваш реактор не взорвался так быстро.§<newPage>§<header;Тепловые балансировщики;true>\nТеплобалансирующие устройства почти аналогичны теплообменникам.\nЕдинственное отличие состоит в том, что они работают как балансировочные устройства с переливом, где слив происходит только из почти полных компонентов\nи заполнение только почти пустых компонентов.\n\nПозволяет контролировать поток тепла немного.§<newPage>§<header;Coolant Cells;true>\nЭто дает буфер хранения тепла, который может быть вставлен, но также и извлечен из.§<newPage>§<header;Plating;true>\nРеакторная обшивка позволяет увеличить максимальное тепловыделение и снизить взрывную силу вашего реактора.\nЧто можно использовать для повышения эффективности размножения.§<newPage>§<header;Isotopic Cells;true>\nIsotopic Cells — это в основном клетки, использующие реактор тепла и ионов урана для самовосстановления.\nЧто позволяет вашему реактору работать намного дольше.\nЭтот процесс также позволяет вам в 8 раз превратить слитки урана в стержни.§<newPage>§<header;Конденсаторы;true>\nКонденсаторы — это ваш метод грубой силы для охлаждения.\nОни используют ресурсы, такие как лазурит/красный камень, для охлаждения реактора. .\nОни могут поглощать определенное количество тепла, прежде чем их нужно будет снова наполнить.\nНо они никогда не ломаются.§<newPage>§<header;Reactor Planner;true>\nТеперь вас может напугать весь \"Reactor Взрыв\", если вы сделаете что-то не так.\n\nК счастью, существует §<redirect;true;Reactor Planner;ic2:preview.reactor_planner>.\nОн позволяет моделировать реакторы в безопасной среде и безопасно запускать все, прежде чем переключиться на производство.\n\n\nТакже он показывает вам много дополнительной статистики о реакторе, так что вы можете спроектировать все, что вам нужно.\n\nТакже самое худшее, что может случиться:\nВы взрываете киберпространство... это все равно никому не нужно.",
  "wiki.ic2.subpage.reactor.head": "Ядерный реактор",
  "wiki.ic2.subpage.rocket_miner.head": "Ракетный майнер",
  "wiki.ic2.subpage.second_tier.head": "Второй уровень",
  "wiki.ic2.subpage.second_tier.list": "Вот машины/материалы, которые вам нужны.\nДа, немного суховато, но получайте удовольствие, узнавайте сами блестящие вещи!",
  "wiki.ic2.subpage.simple_crop_library.body": "Простая библиотека культур — это решение для массового хранения ваших семян сельскохозяйственных культур.\n\nХотя это наиболее ограниченное решение, оно не требует питания и сбрасывает все свое содержимое при поломке. \n\nОн хранит 20 типов культур, и каждый тип может иметь 20 мутаций со 128 сохраненными элементами.\nВ результате общее количество семян сельскохозяйственных культур, которое он потенциально может хранить, составляет 51 200.\n\nЭто удовлетворит вашу потребность в хранении урожая в ранней игре. . Это намного лучше, чем двойной сундук, и предоставляет намного больше информации.\n\nЕдинственный реальный недостаток в том, что семена сельскохозяйственных культур должны быть проанализированы, чтобы быть сохраненными в библиотеке.",
  "wiki.ic2.subpage.steam_reactor.body": "Паровой Реактор - это улучшенный Ядерный Реактор.\nЗа довольно высокую цену...\n\nВ отличии от обычного реактора, у Паровово Реактора существует ряд изменений, которые делают его более рисковым, но гораздо более интересным.§<newPage>§<header;Изменение тактики;true>\nВ первую очередь, Паровой рекатор вырабатывает тепло вместо электричества. \nЭто тепло проходит через Паровые Вентили, которые используют внутренний резервуар реактора для преобразования тепла в пар.§<newPage>§<header;Паровые Вентили;true>\nЧем горячее Паровые Вентили, тем они эффективнее превращают тепло в пар.\nЕсли в них нет воды или они не могут выпускать пар, они мгновенно перестают охлаждаться.§<newPage>§<header;Награда;true>\nИ последнее, но не менее серьёзное изменение: тактовая частота, с которой работает реактор, в 20 раз превышает частоту обычного.\n\nЭто значит, что у тебя очень мало времени на исправление ошибок.\n\nНаграда заключается в высоком уровне производительности.\n\nЕсли ты, конечно, сможешь справиться с этим, но не как некий Dovahkiin0_0.",
  "wiki.ic2.subpage.simple_crop_library.head": "Простая библиотека обрезки",
  "wiki.ic2.subpage.steam_reactor.head": "Паровой реактор",
  "wiki.ic2.subpage.steam_tunnel.body": "Паровой туннель — это мультиблочный источник энергии, который производит EU из пара и способен перерабатывать пар обратно в воду.\n\nОн потребляет до 4096 мБ/т для производства 2048EU/т. в пакетах по 512EU.§<newPage>§<header;Структура;true>\nСтруктура представляет собой полый многоблок размером 5x3x3. §<redirect;true;Клапан;ic2:preview.valve> используется для заполнения/слива пара/воды .\nДля обшивки используются Блоки Структуры Машины и блок Парового Туннеля в центре лицевой части турбины.",
  "wiki.ic2.subpage.steam_tunnel.head": "Паровой туннель",
  "wiki.ic2.subpage.tank.body": "Танк — это полностью динамический мультиблок, который можно построить от 3x3x3 до 50x200x50.\n\nЕго можно построить из большого количества блоков.\nКаждый воздушный блок стоит 16 ведер.\n\n§<redirect;true;Valve Blocks;ic2:preview.valve> можно использовать в любом блоке без рамы для взаимодействия с резервуаром.\n\nСтеклянные блоки не допускаются в раме.\n\nВот список допустимых блоков: ",
  "wiki.ic2.subpage.tank.head": "Танк",
  "wiki.ic2.subpage.teleporter.body": "Чтобы связать телепорты, вам потребуется §<redirect;true;Частотный передатчик;ic2:preview.frequency_transmitter> и используйте его на соответствующих телепортах для связывания.",
  "wiki.ic2.subpage.teleporter.body2": "Телепорт может телепортировать многие вещи, включая сущности, жидкости, предметы и ЕС.\n\nОн будет телепортировать все, что найдет перед собой, если он соответствует другой телепорт.\n\nНаличие любого контейнера для хранения (например, сундуков) перед ним приведет к телепортации предметов в контейнер для хранения других телепортов.\nТо же самое касается жидкостей и ЕС с их соответствующими контейнерами для жидкости (баком) и контейнером ЕС (например, MFSU).\n\nЧто касается объектов, он будет телепортировать любой объект, который находится перед ним, если с другой стороны есть место.\n\nИмейте в виду, что затраты очень высоки, но делается массово. ",
  "wiki.ic2.subpage.teleporter.head": "Телепорт",
  "wiki.ic2.subpage.tesla_coil.body": "Как уже было сказано, Катушка Теслы очень полезна для измельчения мобов.\n\nРадиус действия Катушки Тесла составляет 4 блока, и она наносит одинаковый урон всем существам, находящимся в радиусе действия.\n\nОн разряжается каждые 32 такта (1,6 секунды) и наносит 1 урон за каждые 400 разряженных EU.\n\nОн считается фальшивым игроком, поэтому он дает выпадение \"Только для игрока\"\n\nЭлектроброня защищает от смертельные последствия высокого напряжения СМЕРТЬ и может превратить его в бесплатную зарядку!",
  "wiki.ic2.subpage.tesla_coil.head": "Катушка Тесла",
  "wiki.ic2.subpage.thermal_gen.body": "Тепловой Генератор - продвинутый Геотермальный Генератор.\n\nОн увеличивает срок службы топлива на 50% и производит на 50% больше энергии. Так-же, он производит пассивную энергию в зависимости от окружающих его блоках. Выработка пассивной энергии может быть усилена/ослаблена биомом, в котором он находится.\nПродолжение на следующей странице. §<newPage>§<header;Thermal Generator;true>\nВот примерный список:\n- §lПохожие на лаву:§r\n 0,005EU/блок\n- §lОгонь/Текущая лава:§r\n 0,0015EU/блок\n- §lМагмовый блок:§r\n 0,0035EU/блок\n- §lОбсидиан:§r\n 0,0025EU/блок\n- §lКамень/Блоки металла:§r\n 0,001EU/блок\n- §lПохожие на воду:§r\n 0,0015EU/блок\n- §lБлок Снега:§r\n 0,0025EU/блок\n- §lБлок Льда:§r\n 0,005EU/блок\nТаким образом, если генератор окружён лавой, пассивная генерация будет примерно 16EU/т.\nНо даже так, пассивная генерация составит 5EU/т в горах или около 10EU/т в Незере...",
  "wiki.ic2.subpage.thermal_gen.head": "Тепловой генератор",
  "wiki.ic2.subpage.third_tier.body": "Хаааа, вы наконец-то достигли того момента, когда, по вашему мнению, пора переходить на следующий уровень.\n\nНо вы не знаете, с чего начать.\nНе беспокойтесь, мы у вас есть все необходимое!\n\nВот некоторые требования, которые вы хотите проверить перед началом работы:§<newPage>§<header;ТРЕБОВАНИЯ!;true>\n- §lМощность§r: Иметь не менее 300-500 единиц энергии EU, \nХотя это и не требуется, это значительно упрощает жизнь, так как теперь мы переходим к этапу энергоемкости.\n- §lРесурсы§r: убедитесь, что у вас есть несколько стопок кварца и редкоземельных элементов. Хотя это несложно чтобы получить их, необходимо.§<newPage>§<header;Как продолжить!;true>\nТеперь, когда вы §mне§r уверены, что у вас есть все необходимое.\nВот что вам нужно сделать:\n\n- Вы используете Quartz & Redstone в §<redirect;true;Плавильный завод;ic2:preview.alloy_smleter> для производства пульсирующего кварца§<newPage>§<header;Как продолжить!;true>\n- И превратить редкоземельные элементы в магниты с помощью §<redirect;true;Electrolyzer;ic2:preview.electrolyzer>\n\n\nЭти два ресурса позволяют вам производить машины следующего уровня, о которых вы так мечтаете, чтобы войти в следующую область прогресса...\nХорошо, я остановлюсь на этих громких словах... поехали к БЛЕСТЯЩИМ вещам!§<newPage>§<header;Shiny Stuff!;true>\nХорошо, я остановлюсь на этих громких словах... давайте перейдем к БЛЕСТЯЩИМ вещам!§<newPage>§<header;Shiny Stuff!;true>",
  "wiki.ic2.subpage.third_tier.head": "Третий уровень",
  "wiki.ic2.subpage.third_tier.list": "На данный момент вы действительно должны знать, чего хотите.\nЭто руководство вообще необходимо?!?!?!?!\nДА OFC! Верно?",
  "wiki.ic2.subpage.tube_tool.body": "TubeTool — это ваше большое расширение системы трубок.\n\nПозволение вещей, которые были бы невозможны без него, путем включения функций, которые отключены по умолчанию.\n\nПоскольку есть так много функций, что есть список вещей, которые он может делать.",
  "wiki.ic2.subpage.tube_tool.head": "Инструмент трубки",
  "wiki.ic2.subpage.tubes.head": "Трубы и логистические трубы",
  "wiki.ic2.subpage.uu_crop_library.body": "Библиотека культур UUMatter предназначена для тех, кто проделал профессиональную работу по разведению культур.\n\nКак и ее аналог, она может хранить неограниченное количество типов и мутаций. Несмотря на ограничение размера стека изменено на 1.\nИ хранение этого семени стоит 512EU.\nВозможность библиотеки культур UUMatter состоит в том, чтобы клонировать семена. Используя UUMatter и EU.\nДублирование урожая стоит количество характеристик, которое оно умножило на 10000 EU и 1 UU Matter за клонированный предмет.\nОн может хранить до 512 UUMatter.",
  "wiki.ic2.subpage.uu_crop_library.head": "Библиотека культур UU",
  "wiki.ic2.subpage.villager_o_mat.body": "Деревенский житель-О-Мэт — это автоматический торговец, который использует кражу личных данных, чтобы торговать как вы!\n\nХотя вначале это звучит плохо, на самом деле это очень полезно. \nПоскольку вы сохраняете все полезные скидки, которые торговец сделает для вас со временем.\nИли, если вы сохраните их, скидки спасителя.§<newPage>§<header;Family Friendly Game Mechanics!;true>\nДавайте проигнорируем, что вы были стимулированы для создания ситуаций, в которых необходимо было спасти жителей деревни!\n\n§l*кашель*§r §l*кашель*§r Дезомбификация для получения скидок §l*кашель*§r §l*кашель*§ r§<newPage>§<header;UI;true>\n§<image;ic2:textures/wiki/villager_o_mat.png;85>\n§<padding;2>\nUI кажется сложным, но довольно просто.\nПолоска вверху показывает накопленный опыт, который автоматически собирается при совершении сделки.§<newPage>§<header;The UI;true>\nСелектор деревенских жителей отслеживает всех жителей, которых он может найти\nи предоставляет вам их всех для выбора.\nПоказывая вам полоски XP.\n\nЖители, которые не Полоски опыта — это \"Категории\" сельских жителей, которые позволяют вам массово выбирать их, чтобы уменьшить рутинную работу.§<newPage>§<header;Выбор торговли;true>\nЦентральная часть — это, по сути, ваш селектор торговли.\nВы просто нажмите на сделку, чтобы отключить / включить ее.\n\nВ разделе «Вход/выход» в основном сообщается, откуда он импортирует предметы для торговли и куда он также экспортирует результаты торговли.\nВывод поддерживает трубы, но не ввод. §<newPage>§<header;Как это работает?;true>\nThe Villager-O-Mat — довольно медленная машина.\nОн пытается торговать только один раз в минуту.Но он попытается обработать каждую выбранную сделку сразу.\nЕсли была совершена хотя бы одна сделка, с вас будет взиматься плата в размере 6000 евро за выбранную сделку, независимо от того, была ли она продана или нет.§<newPage>§<header;Как это работает work?;true>\nЗвучит очень дорого, но если у вас выбрано 20 сделок, то есть 6000 евро, фактическое потребление сводится к 100 евро/тонну.\nЧто не так уж и дорого.\nИ это даже не учитывается. для сельского жителя, который может торговать только два раза в день.",
  "wiki.ic2.subpage.villager.body": "IC2Classic так же добавляет несколько жителей в игру.\nОни имеют следующие блоки профессий:§<newPage>§<header;Электрик;true>\n§lБлок:§r §lЖелезная печь§r\nЭтот электрифицированный житель - ваш поставщик компонентов, он продает схемы и некоторые другие штуки.\nПолезен если у вас проблемы с железом!\nХотя я бы избегал его, несколько жителей рассказывали, что от удара током он сошел с ума...§<newPage>§<header;Ядерщик;true>\n§lБлок:§r §lЯдерный реактор§r\nКаким-то образом светящийся зеленым цветом житель - это ваш реакторный поставщик, продающий компоненты реактора и уран...\nЭто объясняет свечение... Думаю.\nНо это только один из способов получения большого количества урана.§<newPage>§<header;Фермер культур;true>\n§lБлок:§r §lПростая библиотека культур§r\nФальшивый фермер - ваш местный любитель урожая. Ничего подозрительного в нем нет...\nОн продает урожай с плохими или приличными показателями, а также некоторые предметы, связанные с урожаем.§<newPage>§<header;Разрушитель;true>\n§lБлок:§r §lПромышленный динамит§r\nПокрытый пылью житель - ваш инженер-взрывотехник.\nНужно что-то взорвать? Он - тот самый парень!\nПродает все виды взрывчаток и сломанных металлов!\nТолько не оставляйте его одного со взрывчаткой на вашей базе!§<newPage>§<header;Пивовар;true>\n§lБлок:§r §lБочка (из IC2)§r\nПьяный житель - ваш эксперт по варке!\nПродает все сорты пива и виски.\nОчень приятный в общении парень!§<newPage>§<header;Грег;true>\n§lБлок:§r §lСтроительная пена: GregTech§r\nГрег - это... Грег. Он был настолько сумасшедшим, что нам пришлось превратить его в жителя!\nОн также одобрил это... Ну, он только сказал \"hmmmmmmmmmm\", но это должно быть согласием...\nВерно! Верно???\nОн продает строительную пену, инструменты и некоторые другие вещи.\nТолько будьте осторожны. Некоторые сделки слишком хороши, чтобы быть правдой!§<newPage>§<header;Рецепты;true>",
  "wiki.ic2.subpage.villager.head": "Жители",
  "wiki.ic2.subpage.villager.recipes": "Здесь вы найдете все рецепты для создания необходимых блоков!",
  "wiki.ic2.subpage.villager_o_mat.head": "Торговая станция жителя",
  "wiki.ic2.subpage.wrench.head": "Гаечный ключ",
  "wiki.ic2.translated": "Angron42",
  "wiki.ic2.translated_by": "Перевод"
}